[
	{
		"id": "6257644124412218284",
		"title": "Conway happy to have enhanced spin game ahead World Cup 2023",
		"url": "https://www.orissapost.com/conway-happy-to-have-enhanced-spin-game-ahead-world-cup-2023/",
		"description": "Opener Devon Conway is delighted to have added the sweep and reverse sweep to his repertoire on New Zealand's ongoing tour of the sub-continent with the ODI World Cup scheduled in India later this year.",
		"body": "Indore: Opener Devon Conway is delighted to have added the sweep and reverse sweep to his repertoire on New Zealand's ongoing tour of the sub-continent with the ODI World Cup scheduled in India later this year.\r\n\r\nNew Zealand are having a bittersweet tour of the sub-continent. Having won the ODI series in Pakistan, the Black Caps slumped to a 0-3 loss in the 50-over fixtures in India.\r\n\r\nConway scored two Test centuries in the drawn series against Pakistan, followed by a 138 in the third ODI against India as he successfully negotiated spinners of both countries.\r\n\r\n\"I'm certainly pretty happy with how things have gone, personally, over the last month-and-a-half,\" Conway said at the post-match press conference.\r\n\r\n\"There's been a lot of learnings for me, how to attack spin in the subcontinent. I've had to learn how to sweep, reverse sweep and put bowlers under pressure as much as possible.\"\r\n\r\nThe 31-year-old opener has emerged as a force to reckon with at the top, boasting of an exceptional record across all three formats that includes a double century on Test debut.\r\n\r\n\"I've been very fortunate to have good experience in our group. We had Kane with us in Pakistan, it gave me the opportunity to have those conversations with him and Tommy Latham - guys who've played here in these conditions quite often - and see how they go about it.\r\n\r\n\"For me, I can take a lot of learning moving forward, especially for the World Cup coming up,\" he added.\r\n\r\nThe third ODI against India started on a challenging note for the Kiwis as it was raining sixes and fours with Rohit Sharma and Shubman Gill sharing a 212-run opening stand.\r\n\r\n\"It was a challenge for our bowlers today, it was a batting surface. The nature in which Rohit and Shubman batted put serious pressure on us. We just tried to hang in there and break the partnership and then put pressure on the new batter.\"\r\n\r\nNew Zealand were without the services of several senior players including the pace duo of Trent Boult and Tim Southee.\r\n\r\n\"The absence of Boulty and Southee is massive for us, they are very experienced bowlers but on the flipside it has given opportunity for the younger bowlers to come through and learn on the go,\" said Conway.\r\n\r\nPTI",
		"snippet": "Conway scored two <b>Test</b> centuries in the drawn series against Pakistan, followed by a 138 in the third ODI against India as he successfully negotiated ...",
		"keywords": "",
		"language": "en",
		"isSafe": true,
		"datePublished": "2023-01-25T13:49:48",
		"provider": {
			"name": "orissapost",
			"favIcon": "",
			"favIconBase64Encoding": ""
		},
		"image": {
			"url": "https://www.orissapost.com/wp-content/uploads/2022/01/Conway.jpg",
			"height": 508,
			"width": 929,
			"thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=309773677490588068",
			"thumbnailHeight": 126,
			"thumbnailWidth": 232,
			"base64Encoding": null,
			"name": null,
			"title": null,
			"provider": {
				"name": "orissapost",
				"favIcon": "",
				"favIconBase64Encoding": ""
			},
			"imageWebSearchUrl": null,
			"webpageUrl": "https://www.orissapost.com/conway-happy-to-have-enhanced-spin-game-ahead-world-cup-2023/"
		}
	},
	{
		"id": "9159408073663901938",
		"title": "Ex-Suzuki technical boss Ken Kawauchi settles in at Hondas Jerez MotoGP test",
		"url": "https://www.crash.net/motogp/news/1019446/1/exsuzuki-technical-boss-ken-kawauchi-settles-honda",
		"description": "Former Suzuki MotoGP technical manager Ken Kawauchi is making his first public appearance in Honda colours during a private test at Jerez.",
		"body": "Francesco Bagnaia to race with #1 plate, can he break the 'curse'?\nMotoGP test rider Stefan Bradl is sharing the track with World Superbike teams as Honda prepares the latest RC213V parts for next months Sepang test, the first outing of the year for race riders Marc Marquez, Joan Mir, Alex Rins and Takaaki Nakagami.\nHonda sources told Crash.net that Kawauchi is mainly using the Jerez test to get up to speed in his new role and understanding of HRC.\nIt will take time for Kawauchi to have a direct impact on technical development at Honda since most of the current parts were designed following feedback from last year.\nFlashback: Suzuki's Ken Kawauchi and HRCs Shuhei Nakamoto at Brno 2012, during Suzuki's previous 'pause' in its MotoGP activities from 2012-2014.\nWhile Kawauchis GSX-RR signed off with two wins in its last three races, 2022 saw Honda suffer its second winless MotoGP season in the last three years.\nRelated Articles\nKawauchis arrival is also a major boost for his former Suzuki riders Mir and Rins, who were only 18th and 20th on their Honda debuts at Novembers Valencia test.\nAlex Rins: 'Ken was a key part of our success in Suzuki'\nRins reacted to the news of Kawauchi's arrival by posting on social media:\n\"Very happy to see this!  Ken was a key part of our success in Suzuki, he developed the bike and made it competitive until its very last lap so it is great news to have him to work in our new challenge!\"\nKawauchi is not the only ex-Suzuki MotoGP team member switching to HRC with technician Toshifumi Fukae announcing his move on Instagram:",
		"snippet": "... during a private <b>test</b> at Jerez. Francesco Bagnaia ... the 'curse'? MotoGP <b>test</b> rider Stefan Bradl is ... for next months Sepang <b>test</b>, the first outing of ...",
		"keywords": "",
		"language": "en",
		"isSafe": true,
		"datePublished": "2023-01-25T12:23:37",
		"provider": {
			"name": "crash",
			"favIcon": "",
			"favIconBase64Encoding": ""
		},
		"image": {
			"url": "https://cdn.crash.net/styles/large_article/s3/pa/3003414.0008.jpg?itok=-ifJceky",
			"height": 866,
			"width": 1300,
			"thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=1533319143437349183",
			"thumbnailHeight": 161,
			"thumbnailWidth": 243,
			"base64Encoding": null,
			"name": null,
			"title": null,
			"provider": {
				"name": "crash",
				"favIcon": "",
				"favIconBase64Encoding": ""
			},
			"imageWebSearchUrl": null,
			"webpageUrl": "https://www.crash.net/motogp/news/1019446/1/exsuzuki-technical-boss-ken-kawauchi-settles-honda"
		}
	},
	{
		"id": "2664411005464048059",
		"title": "COLUMN: To Denver schools Baldermann, test prep is a sin",
		"url": "https://gazette.com/column-to-denver-schools-baldermann-test-prep-is-a-sin-alan-gottlieb/article_e83087cc-9bf3-11ed-a7a9-9be600940aae.html",
		"description": "Last week I came across the latest example of at least one Denvers school board member focusing on the trivial in place of substance, while simultaneously trying to use board",
		"body": "Copy article link\nSave\nLast week I came across the latest example of at least one Denvers school board member focusing on the trivial in place of substance, while simultaneously trying to use board power to constrain innovation.\nIn a little-noticed, 9 a.m. work session on Friday the 13th, board member Scott Baldermann introduced an executive limitation that would instruct Superintendent Alex Marrero to reject any innovation schools proposal to start the school year early if the purpose of the waiver is to receive an advantage on standardized tests.\nThis smacks of unnecessarily obtrusive micro-managing by the governing body of Denver Public Schools. Its hard even to begin to understand why this caught Baldermanns attention, and I struggle to comprehend his reasoning even after a lengthy text-message exchange I had with him on the subject.\nFortunately, Marrero sounded skeptical at best about this proposal, as did board member Michelle Quattlebaum, even though she said she supported the idea in theory (why?). I suspect it will go nowhere. But I also expect Baldemann to keep trying.\nIn fact, Quattlebaum said, trying to limit calendar days of instruction to avoid test-gaming could fly in the face of the boards repeated statements about being equity focused and equity driven.\nBaldermann said he was bothered by language in some innovation plans that expressly stated that one reason for starting the school year early was to improve scores on the Colorado Measures of Academic Success (CMAS) annual tests.\nHis biggest ally was DPS general Counsel Aaron Thompson, who seemed suspicious of innovation school motivations. They can come up with a hundred different reasons why they may want an early start, he said. But its something that the district has suspected, that (innovation) schools are trying to push up so they have more prep time before those standardized tests.\nIn our text conversation, Baldermann cited Merrill Middle Schools innovation plan as an especially egregious example. Heres language from the Merril plan, written in 2018 (the boldfacing is mine, for emphasis):\nWe need calendar flexibilities to allow us more time with students in the critical period before testing, enabling us to be more targeted with data, instruction, curriculum, and interventions to close gaps for diverse learners. Merrill teachers are highly reflective and analytical and have recognized that the set DPS calendar is not necessarily the best for our diverse student population. Teachers are the most equipped to provide input on the calendar as they best understand the nuanced needs of the students and how they change throughout the year. Teacher voice is imperative in crafting a yearly schedule that will yield high teacher morale, maximize instructional time during the calendar year, and enable us to serve students where they learn best to close gaps.\nWhy would the critical period before state testing be the phrase that jumps out at Baldermann, rather than the part about teacher voice?\nMore instructional time for learning makes total sense, but starting the school year early to improve test scores does not. Instead of a school starting early, why not extend the end of their school year? Baldermann replied when I asked about his objection.\nHeres where Baldermann loses me. If you believe state tests provide no meaningful information and amount to little more than a beauty contest among schools, then jumping the gun on the school year might seem like cheating.\nBut if state tests have any validity when it comes to measuring how groups of students are performing in individual schools, then starting early at least has the potential to help struggling students make gains, as demonstrated by the test results.\nYes, state tests are imperfect. The most extreme anti-test true-believers insist they measure little more than socioeconomic status. Put me in the camp that sees the tests as one useful measure, best used as one component of a broader body of evidence.\nUnless and until we come up with better, more rigorous measures, CMAS is what we have to work with. And the tests do tell us a great deal about how schools are preparing students for success.\nBaldermann said it would be more equitable for a school like Merrill to start the year early for struggling students while having a more traditional, later start-date for other students. That strikes me as attempting to close achievement gaps by reining in high-performers as much as accelerating struggling students.\nBaldermann pointed out that Merrill doesnt, in fact, follow the calendar proposed in its innovation plan. Instead, he said, they bring in sixth-graders early to adjust to their new school, before seventh- and eighth-graders arrive later in the week. He said the middle school his son attends follows that same practice.\nI support those flexibilities because its about the well-being of sixth-graders. It has nothing to do with state tests, he told me.\nI left our conversation puzzled about Baldermanns fixation on what he sees as schools trying to game the state-test regimen. Why does he care? And why cant he turn his intelligence and sharp eye for detail to issues that could have a positive impact on DPS students?\nAlan Gottlieb is editor of Denver-based public education watchdog boardhawk.org. Gottlieb covered Denver Public Schools as a newspaper reporter in the mid-1990s, worked as an education program officer for The Piton Foundation and co-founded Education News Colorado and Chalkbeat.\nAlan Gottlieb is editor of Denver-based public education watchdog boardhawk.org. Gottlieb covered Denver Public Schools as a newspaper reporter in the mid-1990s, worked as an education program officer for The Piton Foundation and co-founded Education News Colorado and Chalkbeat.\nFacebook",
		"snippet": "... part about teacher voice? More instructional time for learning makes total sense, but starting the school year early to improve <b>test</b> scores does not.",
		"keywords": "",
		"language": "en",
		"isSafe": true,
		"datePublished": "2023-01-25T12:00:00",
		"provider": {
			"name": "gazette",
			"favIcon": "",
			"favIconBase64Encoding": ""
		},
		"image": {
			"url": "https://bloximages.newyork1.vip.townnews.com/gazette.com/content/tncms/assets/v3/editorial/1/6b/16bcf08c-2302-11ed-831c-b799808b3194/630502da389b5.image.jpg?crop=586%2C586%2C0%2C54&amp;resize=200%2C200&amp;order=crop%2Cresize",
			"height": 586,
			"width": 586,
			"thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=5216056494450180475",
			"thumbnailHeight": 219,
			"thumbnailWidth": 219,
			"base64Encoding": null,
			"name": null,
			"title": null,
			"provider": {
				"name": "gazette",
				"favIcon": "",
				"favIconBase64Encoding": ""
			},
			"imageWebSearchUrl": null,
			"webpageUrl": "https://gazette.com/column-to-denver-schools-baldermann-test-prep-is-a-sin-alan-gottlieb/article_e83087cc-9bf3-11ed-a7a9-9be600940aae.html"
		}
	},
	{
		"id": "3582609670219890751",
		"title": "Pressure Washer Pain Test!!!",
		"url": "http://onenewspage.com/video/20230125/15368516/pressure-washer-pain-test!!!.htm",
		"description": "Pressure Washer Pain Test!!!: .. News video on One News Page on Wednesday, 25 January 2023",
		"body": " 2008-2023 One News Page Ltd.\nAll rights reserved.",
		"snippet": "Pressure Washer Pain <b>Test</b>!!!: . News video on One News Page on Wednesday, 25 January 2023. 2008-2023 One News Page Ltd.",
		"keywords": "",
		"language": "en",
		"isSafe": true,
		"datePublished": "2023-01-25T11:45:27",
		"provider": {
			"name": "onenewspage",
			"favIcon": "",
			"favIconBase64Encoding": ""
		},
		"image": {
			"url": "https://video.newsserve.net/v/20230125/1674647138-Pressure-Washer-Pain-Test!!!_hires.jpg",
			"height": 720,
			"width": 1280,
			"thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=6131828572939761919",
			"thumbnailHeight": 180,
			"thumbnailWidth": 320,
			"base64Encoding": null,
			"name": null,
			"title": null,
			"provider": {
				"name": "onenewspage",
				"favIcon": "",
				"favIconBase64Encoding": ""
			},
			"imageWebSearchUrl": null,
			"webpageUrl": "http://onenewspage.com/video/20230125/15368516/pressure-washer-pain-test!!!.htm"
		}
	},
	{
		"id": "7876708140304248208",
		"title": "Without him all three formats should not even exist: Suresh Raina backs Suryakumar Yadav to succeed in Test cricket",
		"url": "https://indianexpress.com/article/sports/cricket/without-him-all-three-formats-should-not-even-exist-suresh-raina-suryakumar-yadav-8404390/",
		"description": "Suryakumar Yadav will be in Indias Test team that will take on Australia next month.",
		"body": "Having tasted success in white-ball cricket for India, Suryakumar Yadav needs to be involved in Tests, believes former India allrounder Suresh Raina. According to Raina, the swashbuckling Indian batter who has had ridiculously good run in the shortest format of the game, has an array of shots which will help him succeed in red-ball cricket. In a conversation with Aakash Chopra on Viacom18 Sports, Raina said, The way he is performing, I think he should play in all three formats and without him, all three formats should not even exist. The way he performed, the way he shows intent, the way he plans different shots, he also plays fearlessly and knows how to use the dimension of the ground.\" \"He is a Mumbai player, and he knows how to play red-ball cricket. I think he has a great chance - playing Test cricket will get him another establishment in ODIs and some stability as well. He will score multiple 100s and then 200s,\" he added. Former India spinner Pragyan Ojha agreed with Raina and said, Absolutely he should be in the Test team. The way he has played cricket, and the way he has performed, I think he must be there in all three formats. I know why this question is coming.\" On the other hand, former India batter Abhinav Mukund disagreed and felt that the man in-form Sarfaraz Khan, should be given a chance. Why? Because why keep the Ranji trophy? Why not reward domestic performances? Sarfaraz Khan has been in insane form, I would have rewarded him with a cap for the Australia series at least. Suryakumar Yadav is exceptional in the T20 format. They want the same sort of belligerence from him in the Test side. But unfortunately, I'm the guy that follows hierarchy and Sarfaraz should be there. \"The way young talent Sarfaraz Khan is performing at the moment. I understand there is temptation and I think his time will come. But Surya deserves a hundred percent to be in the Test team,\" said Ojha.",
		"snippet": "Suryakumar Yadav will be in Indias <b>Test</b> team that will take on Australia next month. Having tasted success in white-ball cricket for India, ...",
		"keywords": "",
		"language": "en",
		"isSafe": true,
		"datePublished": "2023-01-25T11:43:57",
		"provider": {
			"name": "indianexpress",
			"favIcon": "",
			"favIconBase64Encoding": ""
		},
		"image": {
			"url": "https://images.indianexpress.com/2022/12/Surya-Kumar-Yadav.jpg",
			"height": 667,
			"width": 1200,
			"thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=946642942032208713",
			"thumbnailHeight": 186,
			"thumbnailWidth": 334,
			"base64Encoding": null,
			"name": null,
			"title": null,
			"provider": {
				"name": "indianexpress",
				"favIcon": "",
				"favIconBase64Encoding": ""
			},
			"imageWebSearchUrl": null,
			"webpageUrl": "https://indianexpress.com/article/sports/cricket/without-him-all-three-formats-should-not-even-exist-suresh-raina-suryakumar-yadav-8404390/"
		}
	},
	{
		"id": "1558648048629883391",
		"title": "63% increase in Indian GRE test takers says ETS official",
		"url": "https://indianexpress.com/article/education/study-abroad/63-increase-in-indian-gre-test-takers-says-ets-official-study-abroad-8377518/",
		"description": "While the ETS is not planning to discontinue at-home test services for GRE, authorities are now motivating candidates to opt for test centres to avoid technical glitches, cases of cheating.",
		"body": "With an impactful increase in the number ofGREtest takers in India, there has also been an increase in the number of cheating cases. Alberto Acereda, Associate Vice President of Global Higher Education, ETS, who is responsiblefor the growth ofGRE, talks toindianexpress.comabout the increase of Indian test takers, technical snags, security features and more. According to the data provided by ETS, GRE test takers in India have increased from 56,782 in 2012-13 to 114,647 test takers in 2021-22, which was a 63 per cent increase from the year before (70,136 in 2020-21). From talking about the increase in Indian test takers to pros and cons of 'at-home' test, here's excerpts from his conversation with indianexpress.com. Since the beginning of 'at-home tests', has there been an increase in the number of test takers from the rural parts of India? We have seen phenomenal growth in the number of test takers, for both our at-home and test center testing. We know that India is amongst the worlds largest markets for outbound students with nearly 1.8 million Indian students estimated to apply for admission to overseas education programmes by 2024 (Red Seer Report). With this, we are confident the GRE test will be the natural beneficiary of this overseas education rush. In fact, we have seen this already with our GRE test volume having increased 63 per cent from 2020-2021 to 2021-2022. If we look at the last six years of data, non-metros such as Pune and Ahmedabad have appeared as the top 10 cities where GRE test takers live. In the last four years, cities such as Thane, Guntur, Vijaywada and Khammam have made it to the list, with Guntur and Vijaywada in the top 5 in both 2021 and 2022. These trends point to increased GRE demand from mini metros and tier 2 towns. Over the last 10 years, we have seen considerable growth among our IndianGREtest taking population. In 2012-13, 56,782 test takers from India took theGREGeneral test. In 2013-2014, we served 85,489; in 2014-2015 we grew to 96,178; in 2015-2016 we grew further to 99,376 test takers; in 2016-2017, we served 80,123 test takers; 68,702 in 2017-2018; in 2018-2019, just before the pandemic, we had 72,855 Indian students take theGREtest; 2019-2020, we served 69,835 in the midst of COVID-19 and began to grow back again in 2020-2021 with 70,136 test takers. We experienced incredible growth in 2021-2022 with 114,647 test takers, a 63 per cent increase from the year before as we continue to emerge from the pandemic. Below are the top 10 cities from where this growth has come (last 6 years data by testing year, June-July): With things getting back to normal, and Covid taking a backseat, is ETS planning to discontinue the 'at-home GRE test'? When Covid came, we thought that as the leading organisation, we needed to provide an opportunity for people to have the test available to them in a place that was safe and that was proctored without obviously the possibility of going to a test centre. That's how the at-home test was created by ETS for GRE and TOEFL. Then other assessment companies followed the same for their tests. So, now that Covid is winding down, we still believe that there are places in rural areas in the world that don't have easy access to test centres. Therefore, the solution of the at-home test for GRE and TOEFL continues to be an opportunity to serve these individuals. Having said that, we are also aware in the case of India, of some situations where there have been some reported cheating situations and ETS stands understands the need to stop that type of behaviour. We have taken steps for a while now and we are now actually enhancing steps to stop that situation. So, at this point, everything is on the table, but we are not making any decisions about that just now for two reasons. One, we do not want to leave individuals who require this solution (of at-home test). The second reason is that we want to make sure we look at the data and understand if these are isolated instances in a specific area in the country. Talking about cheating cases, how many cases have been caught in India since the launch of at-home tests, and what are the security measures taken against that now? The number of cheating incidents we see represents a very small percentage of the overall number of tests we administer each year across the globe. While we have seen these incidents increase since the pandemic, each day we continue to thoroughly investigate and mitigate the incidents of those who cheat on our assessments. We go to great lengths to certify the scores of our test takers because we have an obligation to those test takers who test with integrity. It is important to know that if you diligently prepare and demonstrate your skills on test day, you will not only be setting yourself up for success in graduate school, but also in your career and beyond. At the end of the day, cheaters and those trying to commit fraud eventually get caught. The risk is not worth the perceived reward and does not pay off. To safeguard test security, our Office of Testing Integrity (OTI), Chief Security Office and Research and Development teams work to analyse scores and testing sessions that are suspected of having been earned or conducted unfairly (and cancel test scores when evidence warrants doing so); investigate cheating rings and services; identify new trends and patterns that require action; work with local law enforcement, etc. In the most extreme cases, we have and will continue to ban test takers from taking our assessments. In the coming months, we also plan to invest tens of millions of additional dollars to further our technological capabilities and double down on test security measures to ensure we are continuing to be at least one step ahead in this space. Have there been cases in rural parts of India where students faced technical snags in the at-home test services or at the test centres? How are these being dealt with? Sometimes test taker-takers dont have good Wi-Fi and they dont get the opportunity. We see such cases every single day, but our processing test centres help us in such cases. This is not like we send a student to a test centre and whatever happens, happens. We have protocols in place that if these things, unfortunately, happen because of a network issue, there are hundreds of individuals in call centres addressing these issues for thousands of students that take the test and need help. We have all that in place. So, for anyone who encounters a problem, we work with the positioned test centres and at the same time we work with our call centre. No candidate is denied an opportunity due to these technical issues, and we ensure that we deal with it in a fair and an unbiased way. Are there any changes or modifications that we can expect in the GRE test in the near future? Yes, we are now in the process of revising some of the areas in the test. We are looking at how can we position GRE as a more modern test and stay relevant with the changing times. We want to ensure t",
		"snippet": "... is responsiblefor the growth ofGRE, talks toindianexpress.comabout the increase of Indian <b>test</b> takers, technical snags, security features and more.",
		"keywords": "",
		"language": "en",
		"isSafe": true,
		"datePublished": "2023-01-25T11:39:31",
		"provider": {
			"name": "indianexpress",
			"favIcon": "",
			"favIconBase64Encoding": ""
		},
		"image": {
			"url": "https://images.indianexpress.com/2023/01/GRE-interview-Edu.jpg",
			"height": 667,
			"width": 1200,
			"thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=6439336544514356948",
			"thumbnailHeight": 166,
			"thumbnailWidth": 298,
			"base64Encoding": null,
			"name": null,
			"title": null,
			"provider": {
				"name": "indianexpress",
				"favIcon": "",
				"favIconBase64Encoding": ""
			},
			"imageWebSearchUrl": null,
			"webpageUrl": "https://indianexpress.com/article/education/study-abroad/63-increase-in-indian-gre-test-takers-says-ets-official-study-abroad-8377518/"
		}
	},
	{
		"id": "4164626492279712239",
		"title": "North Carolina doctor sues over abortion pill access, in test case on federal power",
		"url": "https://abcnews.go.com/Health/north-carolina-doctor-sues-abortion-pill-access-test/story?id=96634916",
		"description": "The lawsuit argues that state rules on abortion drugs conflict with federal law.",
		"body": "North Carolina doctor sues over abortion pill access, in test case on federal power\nThe lawsuit argues that state rules on abortion drugs conflict with federal law.\nBy\nJanuary 25, 2023, 6:12 AM\n1:36\nBoxes of the drug mifepristone sit on a shelf at the West Alabama Women's Center in Tuscaloosa, Ala., on March 16, 2022.\nAllen G. Breed/AP, FILE\nIn a lawsuit that could impact abortion access nationwide, a North Carolina doctor on Wednesday asked a federal district court to strike down the state's restrictions on the abortion drug mifepristone.\nThe complaint filed by Dr. Amy Bryant argues that North Carolina's restrictions on the abortion pill are at odds with rules set by the Food and Drug Administration, the federal agency tasked by law to determine drug access and safety.\n\"North Carolina cannot stand in the shoes of [the] FDA to impose restrictions on medication access that FDA determined are not appropriate and that upset the careful balance FDA was directed by Congress to strike,\" according to the complaint filed on Bryant's behalf by the law firm King\n& Spalding in the U.S. District Court for the Middle District of North Carolina.\nSince the Supreme Court overruled Roe v. Wade in June, at least 14 states have ceased nearly all abortions, including access to medication abortion, either because of laws passed by state legislators or because of confusion over the laws.\nThe limited access has resulted in soaring demand for mifepristone, a single pill that terminates an early pregnancy by blocking the hormone progesterone.\nMORE: Women turn to at-home abortions, as unregulated pill sites expand operations\nUnder FDA rules, mifepristone can only be prescribed by certified providers who understand how the drug works and agree to look out for potential complications or medical conditions such as an ectopic pregnancy, which requires immediate medical attention. But the FDA also says mifepristone is safe enough to be provided via telehealth appointments and mailed to a patient without evaluating them in person.\nEarlier this month, the FDA expanded the rules to allow for retail pharmacies to dispense the drug for the first time, so long as they follow certain rules. Some pharmacy chains like Walgreens and CVS say they plan to join the program but are continuing to sort through the details.\nBut many states, including North Carolina, have their own rules when it comes to dispensing the drug.\nBoxes of the drug mifepristone sit on a shelf at the West Alabama Women's Center in Tuscaloosa, Ala., on March 16, 2022.\nAllen G. Breed/AP, FILE\nIn North Carolina, mifepristone is allowed early in pregnancy in line with FDA rules. But the state also requires that the patient obtain the drug through a physician in a specially certified surgical facility. The state also requires state-mandated counseling 72 hours in advance of any abortion.\nIn a statement to ABC News, Bryant said she filed her lawsuit because there's \"no medical reason for politicians to interfere or restrict access\" to the drug.\n\"These burdensome restrictions on medication abortion force physicians to deal with unnecessary restrictions on patient care and on the healthcare system,\" she said.\nBryant's lawyer, Eva Temkin, argued federal rules for the drug preempt state regulations when the two conflict.\nMORE: FDA says it will greenlight pharmacies to fill prescriptions for abortion pill\n\"Congress has made clear that FDA is tasked with establishing regulatory controls for this drug to ensure safety and patient access in the least burdensome way,\" she said.\nAdvocates in favor of abortion rights are hopeful that this kind of \"federal preemption\" case will test a new legal strategy that could be applied in other states.\nThey also see North Carolina as a hopeful place to try it out. While Republicans control both chambers of the state legislature, the administration is run by Democratic Gov. Roy Cooper. The lawsuit names North Carolina Attorney General Josh Stein as a defendant; Stein, a Democrat, last week announced his bid for governor in 2024.\n\"No state has ever blocked access to an FDA approved drug before and that should not start now,\" said Kirsten Moore, director of the Expanding Medication Abortion Access Project. \"We can't have a Swiss cheese of what drugs you can get\" in different parts of the country.\nAnti-abortion groups are awaiting a ruling on their own case in Texas. The Alliance Defending Freedom (ADF) filed a lawsuit last fall on behalf of other anti-abortion rights organizations arguing that the FDA was wrong to approve mifepristone decades ago. That case could lead to a nationwide injunction on distribution of the pill before eventually winding its way to the Supreme Court.\n\"We urge the court to reject the marketing and distribution of  chemical abortion drugs so that the health, safety, and welfare of women are protected,\" an attorney for ADF said in November.",
		"snippet": "North Carolina doctor sues over abortion pill access, in <b>test</b> case on federal power The lawsuit argues that state rules on abortion drugs conflict ...",
		"keywords": "",
		"language": "en",
		"isSafe": true,
		"datePublished": "2023-01-25T11:23:10",
		"provider": {
			"name": "go",
			"favIcon": "",
			"favIconBase64Encoding": ""
		},
		"image": {
			"url": "https://s.abcnews.com/images/Politics/mifepristone-abortion-pills-ap-lv-230123_1674590671892_hpMain_16x9_1600.jpg",
			"height": 900,
			"width": 1600,
			"thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=2218283268227020840",
			"thumbnailHeight": 126,
			"thumbnailWidth": 224,
			"base64Encoding": null,
			"name": null,
			"title": null,
			"provider": {
				"name": "go",
				"favIcon": "",
				"favIconBase64Encoding": ""
			},
			"imageWebSearchUrl": null,
			"webpageUrl": "https://abcnews.go.com/Health/north-carolina-doctor-sues-abortion-pill-access-test/story?id=96634916"
		}
	},
	{
		"id": "339736323625669842",
		"title": "Tesla Is Hiring ADAS Test Operators in Europe in Preparation for an Upcoming FSD Launch",
		"url": "https://www.autoevolution.com/news/tesla-is-hiring-adas-test-operators-in-europe-in-preparation-for-an-upcoming-fsd-launch-209087.html",
		"description": "The Tesla FSD Beta program is live in North America only, with other global markets planned at an unspecified time. It seems like the next region to get ...",
		"body": "25 Jan 2023, 10:52 UTC\n By:\nCristian Agatie\nThe Tesla FSD Beta program is live in North America only, with other global markets planned at an unspecified time. It seems like the next region to get the FSD software is Europe, as revealed by new job openings for ADAS test operators.\n11 photos\nTesla asks a lot of money for what it calls Full Self-Driving Capability on its cars, although the feature is not yet ready. In the United States, it costs $15,000 and is at least available to a relatively small group of beta testers. Nevertheless, Tesla owners in Europe cannot use the feature theyve been paying for. It still costs 7,500 euros to add to new cars, a steep price for having traffic lights and stop sign recognition on top of what Enhanced Autopilot already offers.\nThe\nFSD\ncapability is having other problems besides not being available at the moment. For instance, its tied to the vehicle, which means that if you sell it or replace it for whatever reason, you need to pay again for the same feature. This makes people pay pretty money for a feature they might never use. Some may argue that this money would be recouped when selling the car. Some even see it as an investment, arguing that the FSD capability would likely cost more than they paid for it. Nevertheless, crash the car, and there goes your investment.\nThankfully, Tesla hinted that the FSD Beta program would open up to customers in other regions. This raises hopes that at least some of those who paid for the feature would get to test it. Europe is expected to be among the first regions outside North America. However, the traffic rules vary across the continent, which makes implementing the feature more difficult than it is in the U.S. Certainly, Tesla would need a lot of testing to adjust the system to the different rules and regulations in the 27 countries of the European Union.\nTesla acknowledges this and is already hiring ADAS test operators in three European countries: Switzerland, Finland, and Denmark. The job listing description mentions testing for all current and future Autopilot features on the path to full self-driving.\nThe ADAS Test Operator will be responsible to identify improvements and regressions across software iterations, writes the job description. A strong candidate will be objectively focused when making judgments, highly organized with great attention to detail, and a self-starter. This role could require the flexibility of traveling to domestic and international destinations as necessary to test vehicles on public roads, test tracks, and proving grounds.\nElon Musk promised that the FSD Beta program would open to European customers around summer 2022, at least for the left-hand drive markets. Of course, like every one of Musks promises, this should also be taken with a grain of salt. An FSD rollout in Europe is highly dependent on regulatory approval, and the European Union is notoriously reluctant to approve anything it perceives as dangerous. If youre asking, were sure the EU knows about FSD struggles and controversies in the U.S., so it should not go lightly on Tesla.",
		"snippet": "... the FSD software is Europe, as revealed by new job openings for ADAS <b>test</b> operators. 11 photos Tesla asks a lot of money for what it calls Full ...",
		"keywords": "",
		"language": "en",
		"isSafe": true,
		"datePublished": "2023-01-25T10:52:20",
		"provider": {
			"name": "autoevolution",
			"favIcon": "",
			"favIconBase64Encoding": ""
		},
		"image": {
			"url": "https://s1.cdn.autoevolution.com/images/news/tesla-is-hiring-adas-test-operators-in-europe-in-preparation-for-an-upcoming-fsd-launch-209087_1.jpg",
			"height": 928,
			"width": 1611,
			"thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=1768835086650482950",
			"thumbnailHeight": 173,
			"thumbnailWidth": 301,
			"base64Encoding": null,
			"name": null,
			"title": null,
			"provider": {
				"name": "autoevolution",
				"favIcon": "",
				"favIconBase64Encoding": ""
			},
			"imageWebSearchUrl": null,
			"webpageUrl": "https://www.autoevolution.com/news/tesla-is-hiring-adas-test-operators-in-europe-in-preparation-for-an-upcoming-fsd-launch-209087.html"
		}
	},
	{
		"id": "5967607100661515802",
		"title": "Ask Amy: Should I ask for a paternity test? Hartford",
		"url": "https://www.courant.com/advice/ask-amy-20230125-ukg57m3cqfgb7mtoxco5vbwgpy-story.html",
		"description": "Dear Amy: I have questioned for years whether I am his biological father.",
		"body": "Dear Amy: I am the father of four sons, divorced from their alcoholic mother 17 years ago when the boys were very young. All of my sons are now in their 20s. Shortly after my divorce, I learned from a good friend of my ex that she began her long streak of infidelities within the first year of our marriage. I was aware during my marriage that she was spending time with male co-workers, including one man in particular, during a period of time which coincides with the conception of one of my sons. This particular son does not resemble his brothers. His physical characteristics strongly resemble the male co-worker that I suspect his mom was having a relationship with. I have questioned for years whether I am his biological father. For both his sake and mine, and for numerous other reasons, I have considered discussing this with him or getting DNA testing done. I cannot discuss this with my sons mom, because I will never get the truth. Is it wrong to discuss this with my son and/or get DNA tests to confirm or deny my biological connection to him? What is your advice?  Heartsick in the Heartland Dear Heartsick: It isnt necessarily wrong to try to discuss this issue with your son, but if you do, you should prepare yourself for a wide range of reactions from him  from possible relief to rejection. You should closely examine all of your motives for wanting to determine his DNA. This sort of DNA revelation can be extremely destabilizing, not only for an individual, but for the entire family system  including his relationship with his mother and his three brothers. I always advocate for an individuals right to know the truth about their DNA, but for your son, having this question imposed upon him by a parent  versus his choice to investigate on his own  could be very tough for him. (And  if you make this allegation and you two are proven to be biologically related, what then?) I suggest that you have your own DNA tested. See where that effort takes you. If your adult sons have already had their own DNA tested, your family connection (or lack of connection) might be revealed through the testing database. Dear Amy: My boyfriend just proposed to me. I joyfully accepted, and then four hours later I found out that my grandmother died. It was unexpected and painful. I am having a hard time feeling the joy I think I am supposed to be feeling right now. Because of the upcoming funeral, my fiance and I will get to see family members that I have not seen in a while, and I dont know if this is the time to tell them of our engagement, though I imagine some may notice my ring. I feel guilty when I feel any amount of happiness about being engaged because of the grief I still feel from losing my grandmother. And I worry about sharing the news. My question is, should I hold off telling my family about the engagement until everyone has had time to grieve the loss of my grandmother? Would sharing the engagement overshadow the celebration of life we should be focusing on? And if I wait, should I hide my ring in order to not bring any attention to it?  Grief and Joy Dear Grief and Joy: Im so sorry you are experiencing this very tough loss. I think you should tell your immediate family about your engagement now (if you havent, already). Dont make any sort of public announcement during or after your grandmothers memorial, but dont hide your ring, either. If people ask about your ring, you should confirm your engagement and allow them to congratulate you. This happier news reminds everyone that good things continue to happen, even during otherwise tough times. A couple of weeks after the funeral, you might announce your news to a wider circle, and on social media. I hope it will provide some comfort to understand that your grandmother would have wanted you to experience joy and excitement. Dear Amy: I very much object to your sympathetic response to Looking for Love, the 72-year-old husband who hasnt had sex with his wife for 20 years. I am a man in his age group, also in a very long marriage. Intimacy involves more than just sex, and if he has been in this sexless marriage for this long, in my opinion, thats on him.  Happy Husband Dear Happy: Well put. Thank you. (You can email Amy Dickinson at askamy@amydickinson.com or send a letter to Ask Amy, P.O. Box 194, Freeville, NY 13068. You can also follow her on Twitter @askingamy or Facebook.)",
		"snippet": "Dear Amy: I have questioned for years whether I am his biological father.\nDear Amy: I am the father of four sons, divorced from their alcoholic mother 17 years ago when the boys were very young.",
		"keywords": "",
		"language": "en",
		"isSafe": false,
		"datePublished": "2023-01-25T10:30:00",
		"provider": {
			"name": "courant",
			"favIcon": "",
			"favIconBase64Encoding": ""
		},
		"image": {
			"url": "https://www.courant.com/resizer/bFV-F4ZUHdKK5diEjdI24Lwe_5s=/382x215/filters:format(jpg):quality(70)/cloudfront-us-east-1.images.arcpublishing.com/tronc/DCFVHQSMKVC2PKBXV4JZESRFK4.jpg",
			"height": 215,
			"width": 382,
			"thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=9063323055060070823",
			"thumbnailHeight": 215,
			"thumbnailWidth": 382,
			"base64Encoding": null,
			"name": null,
			"title": null,
			"provider": {
				"name": "courant",
				"favIcon": "",
				"favIconBase64Encoding": ""
			},
			"imageWebSearchUrl": null,
			"webpageUrl": "https://www.courant.com/advice/ask-amy-20230125-ukg57m3cqfgb7mtoxco5vbwgpy-story.html"
		}
	},
	{
		"id": "3132668868174820423",
		"title": "CH-53K Lifts F-35C In External Load Test At Pax River",
		"url": "https://thebaynet.com/ch-53k-lifts-f-35c-in-external-load-test-at-pax-river/",
		"description": "NAVAL AIR SYSTEMS COMMAND PATUXENT RIVER, Md. A CH-53K King Stallion heavy lift helicopter from Marine Operational Test and Evaluation Squadron (VMX) performed an external load certification lift of an []",
		"body": "Email\nA non-flyable F-35C Lightning II airframe is flown as part of a CH-53K King Stallion external load certification lift Dec. 13, 2022, at Naval Air Station Patuxent River, Md. The structure is from the first F-35C carrier variant aircraft, CF-1, a former developmental flight test jet from the Patuxent River F-35 Integrated Test Force (ITF). ITF test teams collaborated with Marine Operational Test and Evaluation Squadron One (VMX-1) and a Marine helicopter support team with Combat Logistics Battalion (CLB) 24, Combat Logistics Regiment 2, 2nd Marine Logistics Group to conduct the lift. (U.S. Navy photo by Kyra Helwick)\nNAVAL AIR SYSTEMS COMMAND PATUXENT RIVER, Md. A CH-53K King Stallion heavy lift helicopter from Marine Operational Test and Evaluation Squadron (VMX) performed an external load certification lift of an inoperable F-35 Lightning II airframe in December at Naval Air Station (NAS) Patuxent River, Maryland. The lift was to evaluate the load and inform future lift capabilities.\nThe CH-53K is the most powerful helicopter ever developed by the United States government. This new-build helicopter will continue to fill the CH-53E Super Stallion mission as a pillar of logistics and assault support for the U.S. Marine Corps efforts, but with significant improvements such as state-of-the-art, fly-by-wire technology reducing pilot work load, contributing to aircraft stability, and improving overall safety. The recent full rate production decision for the CH-53K is validation of the aircrafts value to the U.S. Marine Corps and last months test lift is one more demonstration of its performance and reliability.\nThe NAS Patuxent River F-35 Integrated Test Force (ITF) test team, Naval Air Systems Command (NAVAIR) Cargo Lab, and others ensured a successful lift and flight by conducting load certification testing, sling configuration analysis, and cargo characteristics documentation were completed as required. Data from the tests will inform the flight envelope for future events. An earlier crane test lift verified the sling, rig, pitch and bank attitudes of the jet, and control surface states.\nThe aircraft lifted is a developmental test carrier variant F-35C fighter jet that had accrued 750 flight hours during 450 test flights between 2010 and 2016. The F-35C and rigging weighed about 22,000 pounds after removal of its mission and propulsion systems, outer wings, and additional equipment.\nA non-flyable F-35C Lightning II airframe is flown as part of a CH-53K King Stallion external load certification lift Dec. 13, 2022, at Naval Air Station Patuxent River, Md. The structure is from the first F-35C carrier variant aircraft, CF-1, a former developmental flight test jet from the Patuxent River F-35 Integrated Test Force (ITF). ITF test teams collaborated with Marine Operational Test and Evaluation Squadron One (VMX-1) and a Marine helicopter support team with Combat Logistics Battalion (CLB) 24, Combat Logistics Regiment 2, 2nd Marine Logistics Group to conduct the lift. The CLB-24 helicopter support team conducted operations to develop tactics, techniques, and procedures of CH-53K King Stallion utilization as the Marine Corps modernizes and prepares to respond globally to emerging crises or contingencies. (U.S. Navy photo by Kyra Helwick)\nThe CH-53K is currently cleared to conduct a 27,000-pound external lift and is projected to be cleared for a 36,000-pound external lift, nearly three-times more under high, hot conditions than its predecessor, the CH-53E.\nIn September 2021, the CH-53K performed its first operational mission by lifting a Navy MH-60S Knighthawk helicopter from a 12,000-foot mountain top in California. That aircraft weighed approximately 15,000 pounds and was successfully transported 23 miles to Fallon, NV.\nThis type of mission is precisely what the K was designed and built to do, said Col. Kate Fleeger, program manager for the Heavy Lift Helicopter Program Office (PMA-261). It continues to prove its value in support of Marine Corps operations, transporting equipment that no other rotary wing platform can lift.\nThe CH-53K entered its full rate production and deployment phase in December and is on schedule to declare Full Operational Capability in FY2029.\nThe F-35 Lightning II Joint Program Office (JPO) leads the life-cycle program management of the F-35A, F-35B, and F-35C; the fifth-generation joint strike fighter (JSF) air system of choice for the U.S. Air Force, U.S. Navy, U.S. Marine Corps, international partners and foreign military sales customers.\nHeavy Lift Helicopter Program Office (PMA-261) manages the cradle-to-grave procurement, development, support, fielding and disposal of the entire family of H-53 heavy lift helicopters.\nRelated Stories",
		"snippet": "A CH-53K King Stallion heavy lift helicopter from Marine Operational <b>Test</b> and Evaluation Squadron (VMX) performed an external load certification lift ...",
		"keywords": "",
		"language": "en",
		"isSafe": true,
		"datePublished": "2023-01-25T10:15:00",
		"provider": {
			"name": "thebaynet",
			"favIcon": "",
			"favIconBase64Encoding": ""
		},
		"image": {
			"url": "https://i0.wp.com/thebaynet.com/wp-content/uploads/2023/01/22P00281_072.jpg?fit=1200%2C674&ssl=1",
			"height": 674,
			"width": 1200,
			"thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=99188324637344431",
			"thumbnailHeight": 94,
			"thumbnailWidth": 167,
			"base64Encoding": null,
			"name": null,
			"title": null,
			"provider": {
				"name": "thebaynet",
				"favIcon": "",
				"favIconBase64Encoding": ""
			},
			"imageWebSearchUrl": null,
			"webpageUrl": "https://thebaynet.com/ch-53k-lifts-f-35c-in-external-load-test-at-pax-river/"
		}
	},
	{
		"id": "8760245642665241476",
		"title": "Ravichandran Ashwin sweats it out in the gym ahead of IND vs AUS Tests, see pics",
		"url": "https://www.sportskeeda.com/cricket/news-ravichandran-ashwin-sweats-gym-ahead-ind-vs-aus-tests-see-pics",
		"description": "Ravichandran Ashwin is gearing up for the upcoming four-match Test series against Australia at home.",
		"body": "Ravichandran Ashwin is gearing up for the upcoming four-match Test series against Australia at home. In the latest Instagram stories, the 36-year-old was seen working out in the gym to gear up for the Border Gavaskar series. In a post, he could be seen lifting weights and stretching his leg in another Instagram story.Take a look at the pictures below:So far, Ravichandran Ashwin has scalped 89 wickets in Tests against Australia.The ace spinner will look to ensure that Team India wins their fifth consecutive Test series against Australia at home. Ashwin has a good track record against the Aussies. So far, he has scalped 89 wickets in 18 Tests, including six fifers. He has also scored 457 runs with the bat, including a couple of half-centuries.Ravichandran Ashwin, who has so far scalped 449 wickets in 88 Tests, will be looking to become the second Indian bowler to complete 450 wickets. Its worth mentioning that Anil Kumble has picked up the most wickets in Tests for India  619 wickets in 132 Tests.Iceland Cricket@icelandcricketWho is the best spin bowler with >350 Test wickets?Muralitharan has most wickets, most 5 & 10 wicket hauls, and lowest average. Ashwin has the lowest strike rate. But many would still give the title to Warne, who mastered leg-spin, cricket's most difficult art, and entertained.5408Who is the best spin bowler with >350 Test wickets?Muralitharan has most wickets, most 5 & 10 wicket hauls, and lowest average. Ashwin has the lowest strike rate. But many would still give the title to Warne, who mastered leg-spin, cricket's most difficult art, and entertained. https://t.co/QGF4JNbxfMBig challenge  Australias Matt Renshaw on Ravichandran AshwinAustralian batter Matt Renshaw has predicted that Ravichandran Ashwin will pose a stiff challenge to the visitors in the upcoming Test series.Speaking to AAP, Renshaw said:Ashwin is difficult to face. He is a smart bowler with a lot of variations and he uses them very well, but you do get used to him once you've faced him for a while.He added:I think the big challenge from Ashwin and any off-spinner in spinning conditions to a left-hander is the lbw threat. Obviously, everyone thinks about the one that turns and gets you caught at slip, but the big one is the lbw when it doesn't spin. You just have to be ready for that one.For the uninitiated, Renshaw was dismissed by Ashwin during Australia's last Test tour of India (the first Test in Pune) in 2017. Ashwin picked up 21 wickets in four Test-match series, which India won 2-1.sports news@CricketDeDaNaDaAshwin will be one of the toughest challenges during India series: RenshawAshwin will be one of the toughest challenges during India series: Renshaw https://t.co/OVQJIJGypoThe first Test between India and Australia will begin in Nagpur on Thursday, February 9.",
		"snippet": "... for the upcoming four-match <b>Test</b> series against Australia at home. Ravichandran ... up for the upcoming four-match <b>Test</b> series against Australia at home.",
		"keywords": "",
		"language": "en",
		"isSafe": true,
		"datePublished": "2023-01-25T10:13:07",
		"provider": {
			"name": "sportskeeda",
			"favIcon": "",
			"favIconBase64Encoding": ""
		},
		"image": {
			"url": "https://staticg.sportskeeda.com/editor/2023/01/8e90d-16746391265720-1920.jpg",
			"height": 1047,
			"width": 1920,
			"thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=3160512645015842159",
			"thumbnailHeight": 130,
			"thumbnailWidth": 238,
			"base64Encoding": null,
			"name": null,
			"title": null,
			"provider": {
				"name": "sportskeeda",
				"favIcon": "",
				"favIconBase64Encoding": ""
			},
			"imageWebSearchUrl": null,
			"webpageUrl": "https://www.sportskeeda.com/cricket/news-ravichandran-ashwin-sweats-gym-ahead-ind-vs-aus-tests-see-pics"
		}
	},
	{
		"id": "301754635955266781",
		"title": "Cricket Australia 2023, Test great Jason Gillespie says India tour can be career defining",
		"url": "https://www.foxsports.com.au/cricket/australia/cricket-australia-2023-test-great-jason-gillespie-says-india-tour-can-be-career-defining/news-story/093f5c77dbefc83cb2e479f696ee698b",
		"description": "Legends big ego warning for Aussies as career-defining moment awaits",
		"body": "Nca Newswire\nJanuary 25th, 2023 8:50 pm\nFormer champion Australian fast bowler Jason Gillespie has turned up the pressure ahead of the upcoming tour of India, declaring it could be career-defining for the current crop of national players.\nGillespie was part of the last successful tour of India in late 2004 when Australia won the Test series 2-1 and was the Aussies leading wicket-taker on that tour with 20 scalps at 16.15.\nIt remains the only tour of India in which Australia has triumphed in 10 attempts since the summer of 1969-70, but Gillespie believes Pat Cummins men have a great chance of creating history in the next couple of months.\nI think all us cricket tragics and fans should be pretty excited about this group of players; I know Im excited as a cricket fan to see what this group can achieve in India, Gillespie said.\nBut Gillespie warned one of the keys to success for the Aussies will be the bowling attack keeping their egos in check.\nBack in 2004 we, as a bowling group, put our egos away, said Gillespie, who is Australias ninth-greatest Test wicket-taker.\nI remember in 2001, we still went over there thinking we could bowl the Australian line and length and get away with that and wed just roll them over.\nThe Australian team celebrates its series win back in 2004.\nSource: News Corp Australia\nIn 04 we thought about it long and hard and reflected on it and decided we needed to just put our egos away and play subcontinent-style cricket and we did that. We had a bit of success with three quicks and The King (Shane Warne) bowing, with some help from Pup (Michael) Clarke and Boof (Darren) Lehmann.\nSo whichever way the Australian team goes, I think adaptability and situation awareness is going to be absolutely crucial. Backing your skills and backing your fitness is also key on the subcontinent because its hot, its humid, its uncomfortable, theyre foreign conditions  youve got to bank on your fitness and strength taking you deep into games.\nI love what Australia did in Pakistan (last year); their goal was to win on day 15 of the (three-match) Test series and I thought the way they went about it was fantastic, and theres no reason why they cant do it India. I think theyve got the cattle, theyve got the fuel, theyve got the ammo, theyre ready to go, I reckon.\nBut Gillespie stressed it was important Australia didnt lapse into a false sense of security just because they beat Pakistan 1-0 on their home soil last year in similar conditions to what theyll confront in India.\nIts subcontinental conditions, but they are different, and Pakistan players use the conditions slightly different to India players, Gillespie said.\nSpeaking to Nathan Lyon  he talked about the difference between bowling to Pakistan batsmen and Indian batsmen. Indian batsmen dont tend to sweep, whereas Pakistan batsmen will just pull out the broom  so thats a challenge for him as a spin bowler.\nAdam Gilchrist, Justin Langer, Simon Katich and Jason Gillespie celebrate in 2004. Picture: Hamish Blair / Getty Images\nSource: Getty Images\nBut I think the quicks will get a little more assistance off the surface in India. Pakistan is a really tough place to bowl for a fast bowler.\nIndia is a challenge, but youve got to have a really positive attitude and believe you can have an impact and more often than not, quicks can have a real impact in India; theyve just got to believe it up here (in the mind).\nGillespie, who coaches the Adelaide Strikers, believes a couple of his players in Alex Carey and Travis Head will have a big say in Australias chances against India.\nI think hes in a wonderful sweet spot of his career, Gillespie said of Carey.\nHes playing some great cricket with the bat, hes keeping very well.\nWeve got Alex and Trav hoping they can be part of history. I think we have an opportunity to do just that and I think Kez (Carey) is going to be a central figure in that and I think Travis will play a huge role as well.\nSPORTS",
		"snippet": "... the last successful tour of India in late 2004 when Australia won the <b>Test</b> series 2-1 and was the Aussies leading wicket-taker on that tour with 20 ...",
		"keywords": "",
		"language": "en",
		"isSafe": true,
		"datePublished": "2023-01-25T09:50:00",
		"provider": {
			"name": "foxsports",
			"favIcon": "",
			"favIconBase64Encoding": ""
		},
		"image": {
			"url": "https://content.api.news/v3/images/bin/a0b4838a175121ceef544f45ead9b417",
			"height": 720,
			"width": 1280,
			"thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=7220596099022702987",
			"thumbnailHeight": 180,
			"thumbnailWidth": 320,
			"base64Encoding": null,
			"name": null,
			"title": null,
			"provider": {
				"name": "foxsports",
				"favIcon": "",
				"favIconBase64Encoding": ""
			},
			"imageWebSearchUrl": null,
			"webpageUrl": "https://www.foxsports.com.au/cricket/australia/cricket-australia-2023-test-great-jason-gillespie-says-india-tour-can-be-career-defining/news-story/093f5c77dbefc83cb2e479f696ee698b"
		}
	},
	{
		"id": "7706842286340747505",
		"title": "2023 Ford Ranger Raptor Is Mighty Impressive In Acceleration Test",
		"url": "https://www.motor1.com/news/633025/2023-ford-ranger-raptor-acceleration-test/",
		"description": "Bear in mind we are talking about a 5,340-pound (2,422-kilogram) truck with chunky tires and an off-road-tuned transmission.",
		"body": "The new Ford Ranger Raptor isnt available in the United States yet but it will eventually arrive in North America. We havent had the chance to sample the performance truck yet but we expect to get behind the wheel in the very near future. If you are eager to find out how quick the pickup truck is off the line, you dont have to wait until it arrives in the US. Thanks to a new video, we can see the 2023 Ranger Raptor in action unleashing all its potential.\nThe PDriveTV channel on YouTube recently had the privilege to test drive the new Ranger Raptor. The vehicle featured in the clip above is from the Australian specification, which means it has the more powerful version of the 3.0-liter EcoBoost V6. As a reminder, due to emissions restrictions, in Europe, the truck has just 288 horsepower (215 kilowatts) and 362 pound-feet (491 Newton-meters).\n\nThats not the case for the AU market, though. In the Land Down Under, the speedy truck comes with 392 hp (292 kW) and almost the same amount of torque as the European version. Thats a significant boost over the EU-spec model and it translates into very impressive acceleration figures. The team that did this test drive performed a few different sprints but we are obviously most interested in the 0-62 miles per hour (0-100 kilometers per hour) data.\nThe best achievement the Ranger Raptor recorded was 5.79 seconds with a simulated launch control function. Without holding the brakes and pushing the throttle pedal, the truck did the sprint in 6.43 seconds, which is still quite impressive. Bear in mind that we are talking about a 5,340-pound (2,422-kilogram) truck with chunky tires and an off-road-tuned transmission. Its obviously not a street truck and still remains a pretty capable off-roader as this video also shows.\n The New Ranger Raptor Is A Monster: 2023 Ford Ranger Raptor Dyno Run Shows 274 HP At The Wheels 2023 Ford Ranger Raptor Outside Of Europe Has Nearly 400 Horsepower \nImpressed? We are. If you like what you see, you are probably going to be happy to hear this truck will be sold in the United States starting later this year. It's unclear if it will be a 2023 or 2024 model at that point, and it's also unknown if the truck will undergo any significant changes for US and Canadian buyers. We believe only the 3.0 V6 EcoBoost engine will be available on this side of the big pond as opposed to Europes alternative twin-turbo four-cylinder diesel.",
		"snippet": "The PDriveTV channel on YouTube recently had the privilege to <b>test</b> drive the new Ranger Raptor. The vehicle featured in the clip above is from the ...",
		"keywords": "",
		"language": "en",
		"isSafe": true,
		"datePublished": "2023-01-25T09:29:58",
		"provider": {
			"name": "motor1",
			"favIcon": "",
			"favIconBase64Encoding": ""
		},
		"image": {
			"url": "https://cdn.motor1.com/images/mgl/bgzymM/s1/2023-ford-ranger-raptor-acceleration-test.jpg",
			"height": 1080,
			"width": 1920,
			"thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=486994583519466475",
			"thumbnailHeight": 202,
			"thumbnailWidth": 359,
			"base64Encoding": null,
			"name": null,
			"title": null,
			"provider": {
				"name": "motor1",
				"favIcon": "",
				"favIconBase64Encoding": ""
			},
			"imageWebSearchUrl": null,
			"webpageUrl": "https://www.motor1.com/news/633025/2023-ford-ranger-raptor-acceleration-test/"
		}
	},
	{
		"id": "5623330198145245543",
		"title": "Conway happy with improvement in game against spin ahead of World Cup",
		"url": "https://www.tbsnews.net/sports/conway-happy-improvement-game-against-spin-ahead-world-cup-573746",
		"description": "\"I'm certainly pretty happy with how things have gone, personally, over the last month-and-a-half,\" Conway said at the post-match press conference.",
		"body": "25 January, 2023, 03:25 pm\nLast modified: 25 January, 2023, 03:30 pm\nBefore the ODI World Cup in India later this year, New Zealand opener Devon Conway is thrilled to have added the sweep and reverse sweep to his toolkit. After winning the ODI series in Pakistan, New Zealand is on a bittersweet tour of the Indian subcontinent because the Black Caps suffered a 0-3 loss in the 50-over matches in India.\nConway managed both countries' spinners to score two Test centuries in the tied series against Pakistan, then 138 against India in the third ODI.\n\"I'm certainly pretty happy with how things have gone, personally, over the last month-and-a-half,\" Conway said at the post-match press conference.\n\"There's been a lot of learning for me, how to attack spin in the subcontinent. I've had to learn how to sweep, reverse sweep and put bowlers under pressure as much as possible.\"\nConway, who has a terrific record in all three forms and a double century in his Test debut, has solidified himself as a big force at the top of the game.\n\"I've been very fortunate to have good experience in our group. We had Kane with us in Pakistan, it gave me the opportunity to have those conversations with him and Tommy Latham - guys who've played here in these conditions quite often - and see how they go about it.\n\"For me, I can take a lot of learning moving forward, especially for the World Cup coming up,\" he added.",
		"snippet": "Conway managed both countries' spinners to score two <b>Test</b> centuries in the tied series against Pakistan, then 138 against India in the third ...",
		"keywords": "",
		"language": "en",
		"isSafe": true,
		"datePublished": "2023-01-25T09:25:00",
		"provider": {
			"name": "tbsnews",
			"favIcon": "",
			"favIconBase64Encoding": ""
		},
		"image": {
			"url": "https://www.tbsnews.net/sites/default/files/styles/social_share/public/images/2023/01/25/353223.jpg",
			"height": 314,
			"width": 600,
			"thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=3599305479378706061",
			"thumbnailHeight": 116,
			"thumbnailWidth": 223,
			"base64Encoding": null,
			"name": null,
			"title": null,
			"provider": {
				"name": "tbsnews",
				"favIcon": "",
				"favIconBase64Encoding": ""
			},
			"imageWebSearchUrl": null,
			"webpageUrl": "https://www.tbsnews.net/sports/conway-happy-improvement-game-against-spin-ahead-world-cup-573746"
		}
	},
	{
		"id": "2580525524560500180",
		"title": "IQ Score Measurement: How high is high IQ? Tests that measure Intelligence Quotient and how they are rated",
		"url": "https://www.timesnownews.com/health/iq-score-measurement-how-high-is-high-iq-tests-that-measure-intelligence-quotient-and-how-they-are-rated-article-97305847",
		"description": "People often discuss high IQ scores, often referred to as a genius. But what exactly do these numbers mean and how do they stack up? Read on to all about the Intelligence quotient, the tests that determine your ratings, and also how to improve your IQ through a few cognitive-enhancing basic techniques like learning a new language or even listening to music.",
		"body": "New Delhi: what exactly makes a genius? Well, the answer is simple. A score that measures the Intelligence quotient or IQ of a person determines their intellectual abilities and potential. According to experts, IQ is something a person is largely born with. It is not a test of knowledge but things you largely learn through life-long education and life experiences.  The IQ score does not exist in isolation but represents how your results compare to those of other people your age.  What do IQ scores mean?  IQ scores are measured through tests designed to reflect a wide range of cognitive skills, such as reasoning, logic, and problem-solving.  A score of 116 or more is considered above average, while more than 130 signals a high IQ. Membership in Mensa, the High IQ society, includes people who score in the top 2 per cent. The IQ tests are based on the original test devised in the early 1900s by French psychologist Alfred Binet. He did so to identify students in need of extra assistance in school. Based on research, Binet developed the concept of mental age which helped the children know their own average abilities in their peer group.  Your average score, according to Binet's research, is a measure of fluid and crystallised intelligence. IQ test generally indicates how well you did on these tests of mental abilities compared to other people in your age group. A breakdown of IQ scores  According to experts, the IQ score represents how you compare to your peer group in the:  Language Reasoning abilities Processing speed Visual-spatial processing Memory Mathematics The average score on an IQ test is 100. These labels are often given for IQ scores:  1 to 24: Profound mental disability 25 to 39: Severe mental disability 40 to 54: Moderate mental disability 55 to 69: Mild mental disability 70 to 84: Borderline mental disability 85 to 114: Average intelligence 115 to 129: Above average or bright 130 to 144: Moderately gifted 145 to 159: Highly gifted 160 to 179: Exceptionally gifted 180 and up: Profoundly gifted While there is no upper limit to an IQ score, many people across the world have achieved super IQs as claimed in the media. Also, over the years, IQ tests have changed quite a bit and that makes it difficult to compare results from different eras and decades.  People who have an IQ of less than 70 are said to have limited intellectual functioning. However, experts believe that social, practical, and conceptual skills also need to be taken into account while making that kind of determination.  Mathematician Terence Tao is said to have an IQ of 220 or 230. Tao started high school in the 1980s at age 7, earned a bachelors degree at age 16, and a doctorate at 21.  Ways to boost IQ  There are various brain activities and exercises you can do to be able to raise your IQ scores. A few of them are: Memory activities  These activities help improve memory and enhance reasoning and language skills. You can indulge in:  Jigsaw puzzles Crossword puzzles Concentration enhancing games Sudoku Visuospatial reasoning activities  These involve reading and interpreting maps that help increase reasoning.  Mazes3-D modelsPrism-makingRelational skillsRelational Frame Theory helps build a connection between cognitive activities and language development through relational associations. It can be increased through:  Language learning books Object comparisons MusicAccording to a study, https://pubmed.ncbi.nlm.nih.gov/23793255/, learning new music and instruments can increase the IQ scores of children in particular. However, adults can benefit from music training, too.Learning a new language  A new language is always beneficial for the human brain, culture, and behaviour. It also helps increase your IQ as according to experts, talking and interaction improve cognitive abilities, especially in children. Disclaimer: Tips and suggestions mentioned in the article are for general information purposes only and should not be construed as professional medical advice. Always consult your doctor or a dietician before starting any fitness programme or making any changes to your diet.",
		"snippet": "It is not a <b>test</b> of knowledge but things you largely learn through life-long education and life experiences. The IQ score does not exist in isolation ...",
		"keywords": "",
		"language": "en",
		"isSafe": true,
		"datePublished": "2023-01-25T09:02:27",
		"provider": {
			"name": "timesnownews",
			"favIcon": "",
			"favIconBase64Encoding": ""
		},
		"image": {
			"url": "https://static.tnn.in/thumb/msid-97305847,imgsize-28056,width-1280,height-720,resizemode-75/97305847.jpg",
			"height": 720,
			"width": 1278,
			"thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=6712456409968565317",
			"thumbnailHeight": 202,
			"thumbnailWidth": 358,
			"base64Encoding": null,
			"name": null,
			"title": null,
			"provider": {
				"name": "timesnownews",
				"favIcon": "",
				"favIconBase64Encoding": ""
			},
			"imageWebSearchUrl": null,
			"webpageUrl": "https://www.timesnownews.com/health/iq-score-measurement-how-high-is-high-iq-tests-that-measure-intelligence-quotient-and-how-they-are-rated-article-97305847"
		}
	},
	{
		"id": "5356054645114363683",
		"title": "Conway happy to have developed spin game ahead of ODI World Cup",
		"url": "https://sportstar.thehindu.com/cricket/conway-spin-game-odi-world-cup-2023-india-vs-new-zealand/article66431411.ece",
		"description": "Opener Devon Conway is delighted to have added the sweep and reverse sweep to his repertoire on New Zealands ongoing tour of the sub-continent with the ODI World Cup scheduled in India later this year",
		"body": "WIPL 2023 LIVE, Team announcement updates: Bidding process starts\nConway scored two Test centuries in the drawn series against Pakistan, followed by a 138 in the third ODI against India as he successfully negotiated spinners of both countries.\nIm certainly pretty happy with how things have gone, personally, over the last month-and-a-half, Conway said at the post-match press conference.\nTheres been a lot of learnings for me, how to attack spin in the subcontinent. Ive had to learn how to sweep, reverse sweep and put bowlers under pressure as much as possible. The 31-year-old opener has emerged as a force to reckon with at the top, boasting of the an exceptional record across all three formats that includes a double century on Test debut.\nIve been very fortunate to have good experience in our group. We had Kane with us in Pakistan, it gave me the opportunity to have those conversations with him and Tommy Latham - guys whove played here in these conditions quite often - and see how they go about it.\nFor me, I can take a lot of learning moving forward, especially for the World Cup coming up, he added.\nAlso Read\nRohit, Gill, Shardul shine as India sweeps ODI series with 90-run win against New Zealand\nThe third ODI against India started on a challenging note for the Kiwis as it was raining sixes and fours with Rohit Sharma and Shubman Gill sharing a 212-run opening stand.\nIt was a challenge for our bowlers today, it was a batting surface. The nature in which Rohit and Shubman batted put serious pressure on us. We just tried to hang in there and break the partnership and the put pressure on the new batter. New Zealand were without the services of several senior players including the pace duo of Trent Boult and Tim Southee.\nThe absence of Boulty and Southee is massive for us, they are very experienced bowlers but on the flipside it has given opportunity for the younger bowlers to come through and learn on the go, said Conway.",
		"snippet": "... 2023 LIVE, Team announcement updates: Bidding process starts Conway scored two <b>Test</b> centuries in the drawn series against Pakistan, followed by a 138 ...",
		"keywords": "",
		"language": "en",
		"isSafe": true,
		"datePublished": "2023-01-25T08:59:48",
		"provider": {
			"name": "thehindu",
			"favIcon": "",
			"favIconBase64Encoding": ""
		},
		"image": {
			"url": "https://ss-i.thgim.com/public/incoming/ua2d6x/article66431398.ece/alternates/LANDSCAPE_1200/India_New_Zealand_Cricket_20363.jpg",
			"height": 675,
			"width": 1200,
			"thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=2671995874963476304",
			"thumbnailHeight": 189,
			"thumbnailWidth": 336,
			"base64Encoding": null,
			"name": null,
			"title": null,
			"provider": {
				"name": "thehindu",
				"favIcon": "",
				"favIconBase64Encoding": ""
			},
			"imageWebSearchUrl": null,
			"webpageUrl": "https://sportstar.thehindu.com/cricket/conway-spin-game-odi-world-cup-2023-india-vs-new-zealand/article66431411.ece"
		}
	},
	{
		"id": "3433579451336750555",
		"title": "Cheteshwar Pujara Birthday: BCCI Wishes India's Test Cricket Star As He Turns 35",
		"url": "https://www.latestly.com/socially/sports/cricket/cheteshwar-pujara-birthday-bcci-wishes-indias-test-cricket-star-as-he-turns-35-4755994.html",
		"description": "Pujara is celebrating his 35th birthday today and BCCI wished him on this special day. Scroll below to see what they wrote for the Test cricket specialist.",
		"body": "Cheteshwar Pujara turned 35 today and on this special day, the Board of Control for Cricket in India (BCCI) took to social media to wish the cricketer.Here's wishing @cheteshwar1- one of the grittiest modern-day batters - a very happy birthday,&quot; wrote BCCI on Twitter along with the numbers he has achieved in international cricket so far. Pujara has, over the years, established himself to be a mainstay in India's Test team.'Hamari Bhabhi Kaisi Ho, Sara Bhabhi Jaisi Ho,' Spectators Tease Shubman Gill During IND vs NZ 3rd ODI 2023 in Indore (Watch Video). BCCI's Birthday Wish for Cheteshwar Pujara: 103 intl. matches 7065 intl. runs 19 intl. tons Here's wishing @cheteshwar1 - one of the grittiest modern-day batters - a very happy birthday.  #TeamIndia pic.twitter.com/ePkBfqnSSa  BCCI (@BCCI) January 25, 2023",
		"snippet": "Scroll below to see what they wrote for the <b>Test</b> cricket specialist. Cheteshwar Pujara turned 35 today and on this special day, the Board of Control ...",
		"keywords": "",
		"language": "en",
		"isSafe": true,
		"datePublished": "2023-01-25T08:57:57",
		"provider": {
			"name": "latestly",
			"favIcon": "",
			"favIconBase64Encoding": ""
		},
		"image": {
			"url": "https://st1.latestly.com/wp-content/uploads/2022/12/resize2-5.jpg",
			"height": 675,
			"width": 1200,
			"thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=1753385349694346794",
			"thumbnailHeight": 126,
			"thumbnailWidth": 224,
			"base64Encoding": null,
			"name": null,
			"title": null,
			"provider": {
				"name": "latestly",
				"favIcon": "",
				"favIconBase64Encoding": ""
			},
			"imageWebSearchUrl": null,
			"webpageUrl": "https://www.latestly.com/socially/sports/cricket/cheteshwar-pujara-birthday-bcci-wishes-indias-test-cricket-star-as-he-turns-35-4755994.html"
		}
	},
	{
		"id": "1333574772867109699",
		"title": "India No. 1 in ODIs: What it means for Rohit-led side in World Cup year",
		"url": "https://thefederal.com/sports/india-no-1-in-odis-what-it-means-for-rohit-led-side-in-world-cup-year/",
		"description": "If Indias win the 4-Test series against Australia by a margin of at least 2-0 or 3-1, it will hold the No. 1 ranking in all three formats. If and when that does happen, it will be a remarkable achievement.",
		"body": "2:14 PM, 25 January, 2023\n0\nCOMMENTS\nIndia completed a 3-0 clean sweep over New Zealand in the ODI series in Indore on Tuesday (January 24). Photo: BCCI\nA week back, when it took the field in Hyderabad, New Zealand was ranked the No. 1 One-Day International side in the world. After its 90-run hammering in Indore on Tuesday night (January 24), it ceded that spot to its vanquisher. Rohit Sharmas India is now the top dog in 50-over cricket too, as it is in Twenty20 Internationals. Should it win the four-Test series against Australia by a margin of at least two matches (2-0 or 3-1), it will hold the No. 1 ranking in all three formats. If and when that does happen, it will be a remarkable achievement.\nAlso read:\nSplit captaincy in Indian cricket: What Rahul Dravid says\nThat said, how much should we read into the successive 3-0 routs of Sri Lanka and New Zealand in the back-to-back ODI series? Havent we been here before, lording bilateral showdowns and then coming a cropper when it comes to the crunch, in multi-team tournaments? Is there something now that suggests an imminent snapping of that trend? These are questions uppermost in the minds of most Indian followers, who have lapped up victories with expected glee but whod rather settle for bilateral meltdowns if it means another trophy in the cabinet.\nPlenty of choices\nAdvertisement\nTo not acknowledge Indias consistency  for thats the No. 1 ranking means  will be unfair because across conditions and at different times of the year, with different personnel, it has held its own against all-comers. Workload management and the non-availability of key resources due to injuries havent allowed India to field its best combination at all times, which makes the sides ascent to the very top even more commendable. But it also cant be disregarded that in the final analysis, its the trophies and the cups that offer a more tangible valuation of a sportsperson or a team, and Indias think-tank wont be unaware that on that count, it has a fair bit of work ahead of them.\nWhat these six victories on the bounce have done is provide an indication of what the thinking of the brains trust is, and who are the personnel that, for the time being, have made themselves undroppable. The logjam will become more intense when, at some stage in the next few weeks, Jasprit Bumrah, Prasidh Krishna and Ravindra Jadeja too will be primed for international comebacks. What then will Rohit and Rahul Dravid do? Bumrah is a shoo-in and Jadeja would appear to be so, even though Axar Patel has ensured in the last several months that the Saurashtra all-rounder hasnt been terribly missed. Will India be tempted to play both left-arm spinning all-rounders in the playing XI?\nAlso read:\nICC Awards 2022: Three Indians named in ICC T20I Team of the Year\nThese are all questions that assume significance because this is the year of the 50-over World Cup. In India, no less. Spin might not play as much of a part now than it might have in the past, but the changing dynamics of the white-ball game, with a studied focus on players with more than one skill, means the likes of Jadeja, Axar and Shardul Thakur will perhaps be more the flavour than pure specialists like Kuldeep Yadav, Yuzvendra Chahal and Prasidh, no matter how prolific they might loom as wicket-taking options. After all, it is a delicate balancing act, and walking that particular tightrope isnt the easiest of tasks, as India has found out twice in the last two years at 20-over World Cups in the UAE and Australia.\nShubman Gills rise\nThe rout of New Zealand reiterated how far Shubman Gill has come as a reliable, hungry, barely-satisfied ODI opener. Pretty 30s and graceful 40s no longer cut ice with the 23-year-old, already the youngest double-centurion in 50-over internationals. Three hundreds  including that phenomenal 208 against the Kiwis in Hyderabad  in his last four ODI hits indicate a consistency that in the past has been linked to Virat Kohli and Rohit. Gills intimidating alliance with Rohit at the top of the batting tree has been fruitful, electrifying, explosive and impactful; the middle order hasnt always built on the wonderful starts provided by the skipper and his understudy, but its only a matter of time before that anomaly is addressed, such is the quality of batting that follows the openers.\nAlso see:\nPhotos from KL Rahul-Athiya Shetty wedding\nNot even Gills aesthetics, however, could overshadow a much-awaited 30th ODI hundred for Rohit. The captain might be peeved that people are talking about the three-year gap between 50-over tons because he only played 16 innings in this format in that period, but such is the high standard he has set that 16 knocks without a century are perceived as a prolonged drought. Rohit has taken the onus of setting an aggressive tone from the outset to heart; determined to lead by example, he has often chanced his arm once too often and been dismissed with the bowling at his mercy. Which Rohit  the one who begins carefully and finishes with a huge score, or the one who kicks off at the rate of knots and therefore attracts attendant risks  is better for the team is open to debate though for the time being, he has silenced wagging tongues, much like Kohli had done last September when he ended a 1,020-day wait for his 71st international hundred.\nFor all his pyrotechnics in 20-over cricket, Suryakumar Yadav has struggled for like success in the longer white-ball variant, while Ishan Kishan has found the middle-order conundrum too hard to crack. Admittedly, the sample size is small, but both will not be unaware that they have to do plenty more if they are to impress the think-tank and displace incumbents Shreyas Iyer and KL Rahul respectively.\nIndia has sought to take the less travelled path to victory against the Lankans and the Kiwis, which must be welcomed. In India, batting second is a preferred option, not least because the dew can be so incapacitating when defending a total. India often chose to set a target by choice, and scores of 373, 390, 349 and 385 in the four matches in which it batted first must be viewed as a vindication of the teams thinking and masterly execution. As always, the spectre of multi-nation events will loom as an ominous footnote, but with eight months to the World Cup, there is justified optimism that the tide could turn this time around.\nAnother comprehensive performance from #TeamIndia as they outclass New Zealand by 90 runs in Indore to complete a 3-0 whitewash. \nScorecard ",
		"snippet": "If Indias win the 4-<b>Test</b> series against Australia by a margin of at least 2-0 or 3-1, it will hold the No.\n1 ranking in all three formats.\nIf and when that does happen, it will be a remarkable achievement.",
		"keywords": "",
		"language": "en",
		"isSafe": true,
		"datePublished": "2023-01-25T08:44:41",
		"provider": {
			"name": "thefederal",
			"favIcon": "",
			"favIconBase64Encoding": ""
		},
		"image": {
			"url": "https://thefederal.com/file/2023/01/india-vs-nz-odis.jpg",
			"height": 512,
			"width": 960,
			"thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=7213508618822638557",
			"thumbnailHeight": 128,
			"thumbnailWidth": 240,
			"base64Encoding": null,
			"name": null,
			"title": null,
			"provider": {
				"name": "thefederal",
				"favIcon": "",
				"favIconBase64Encoding": ""
			},
			"imageWebSearchUrl": null,
			"webpageUrl": "https://thefederal.com/sports/india-no-1-in-odis-what-it-means-for-rohit-led-side-in-world-cup-year/"
		}
	},
	{
		"id": "4771284151456155472",
		"title": "Are you a Soldier Poet or King? Take the test that's gone viral on TikTok",
		"url": "https://www.indy100.com/tiktok/soldier-poet-king-quiz-test-2659306467",
		"description": "If you love a good ol' personality quiz, there's a new one that's making rounds on TikTok where you can find out if you're more like a soldier,  poet or king. But why those three unique occupations? Well, the test is inspired by the song \"Soldier, Poet, King\" by The Oh Hellos according to the creato...",
		"body": "Sign up\nto our free Indy100 weekly newsletter\nAfter entering your answers, you will be given a result of either a solider, poet or king, with a summary as to what qualities you possess that matched you to this role.\nThis is what the quiz looks like, simply enter you name and press \"Start Quiz,\" to answer the multiple choice questions\nuQuiz\nThe quiz has sparked discussions on TikTok as people have revealed what role they were given.\n\"Highly recommend taking the quiz, it asks some interesting questions. The description of king made so much sense for me but damn I wanted to be a poet,\" @bews.world wrote.\nWhile @caityreads has been sharing aesthetic videos for the solider, poet and king.\nTikToker @iamyourmothersmistress went viral with 4.1m views after sharing how she took the test and was disappointed to be given king instead of poet.\nElsewhere, another uQuiz went viral on TikTok last year that tells you what emotion you are after answering 11 questions include choosing your preferred drink and flower to \"choose a random event from life that suits you.\"\nHave your say in our news democracy. Click the upvote icon at the top of the page to help raise this article through the indy100 rankings",
		"snippet": "But why those three unique occupations? Well, the <b>test</b> is inspired by the song \"Soldier, Poet, King\" by The Oh Hellos according to the creato. Sign ...",
		"keywords": "",
		"language": "en",
		"isSafe": false,
		"datePublished": "2023-01-25T08:09:49",
		"provider": {
			"name": "indy100",
			"favIcon": "",
			"favIconBase64Encoding": ""
		},
		"image": {
			"url": "https://www.indy100.com/media-library/tesla-owner-uses-tiktoker-topher-s-voice-for-car-horn.jpg?id=32888249&width=1200&height=600&coordinates=0%2C193%2C0%2C174",
			"height": 600,
			"width": 1200,
			"thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=1477434844961334243",
			"thumbnailHeight": 150,
			"thumbnailWidth": 300,
			"base64Encoding": null,
			"name": null,
			"title": null,
			"provider": {
				"name": "indy100",
				"favIcon": "",
				"favIconBase64Encoding": ""
			},
			"imageWebSearchUrl": null,
			"webpageUrl": "https://www.indy100.com/tiktok/soldier-poet-king-quiz-test-2659306467"
		}
	},
	{
		"id": "7736928779699227493",
		"title": "York City police: ShotSpotter 60 percent accurate in recent test",
		"url": "https://www.yorkdispatch.com/story/archives/2023/01/20/york-city-police-shotspotter-60-percent-accurate-in-recent-test/69825010007/",
		"description": "The city's $600,000 gunfire detection system is still not performing as it should be, according to the latest live-fire test results.",
		"body": "'Horrific': Led by York City, county records most homicides ever in 2022\nThe system is made up of 40 rooftop sensors designed to detect gunshots, map their location and notify the York County 911 center within seconds. Eight cameras connected to the system automatically turn in the direction of the shots.\nIn last week's live-fire test, officers shot firearms in six locations around the city. The system was tested for single and multiple gunfire from .22-caliber, 9 mm and 40-caliber firearms.\nCompany's response: Gregg Rowland, senior vice president for ShotSpotter, said an operations team was on site as the\nlive-fire test was conducted. He declined to comment on ShotSpotter's performance.\n\"Unfortunately, nobody in our company can confirm any accuracy data,\" he said.\nRowland said ShotSpotter should be performing to 80 percent accuracy or better in its coverage area, which is about 82 feet from the point of gunfire. He said engineers will analyze problems and fix them on site, but declined to say what problems York's system has.\n\"I'm sure our engineers look into the system from time to time, but I couldn't tell you what adjustments happened in York,\" he said. \"Whatever problems were reported in York, they were probably repaired or will be repaired as part of our maintenance and support.\"\nIssue with cameras: Bankert, who took over running York's ShotSpotter in January 2009, said he is not satisfied with the live-fire test results. He said he specifically wanted to test how the eight cameras connected to the ShotSpotter sensors responded.\n\"Some cameras didn't respond correctly to the gunfire,\" Bankert said. \"They went the opposite direction.\"\nThe cameras are the most helpful aspect of ShotSpotter, Bankert said. The cameras are supposed to automatically turn toward the direction of gunfire about five seconds after it occurs.\nFootage the cameras capture is sometimes used as corroborative evidence. Although they do not necessarily film the shooting, they can potentially catch people leaving the scene, and police can pull license plate numbers from vehicles leaving, he said.\nNext step: After reviewing the live-fire test report, Bankert said he is not sure how else to tweak the system to record more gunfire incidents.\n\"I think they can change the sensitivity,\" Bankert said. \"But then there's issues with sensitivity. We tried that before, but there's a lot more sounds that aren't gunfire.\"\nIn 2009, the system recorded 710 incidents in May, but most were determined to be construction work, and 685 incidents in July, which were largely determined to be firecrackers.\nLast year, Bankert increased the sensors' sensitivity to weed out noises, such as those firecracker pops and construction work.\nHe also asked York County 911 operators to use discretion when dispatching \"shots fired\" calls. Dispatchers can replay the sounds that are captured by ShotSpotter sensors and determine if they are truly gunfire. Bankert said firecracker pops have a distinct whistle sound.\nYork City Police will continue to adjust the system, Bankert said.",
		"snippet": "... not performing as it should be, according to the latest live-fire test results. 'Horrific': Led by York City, county records most homicides ever in ...",
		"keywords": "",
		"language": "en",
		"isSafe": true,
		"datePublished": "2023-01-25T08:07:00",
		"provider": {
			"name": "yorkdispatch",
			"favIcon": "",
			"favIconBase64Encoding": ""
		},
		"image": {
			"url": "https://www.gannett-cdn.com/presto/2023/01/20/PPYD/cbfdda43-2f69-465b-b894-94dc74aea89d-AP22361611974418.jpg?crop=1023,576,x0,y102&width=1023&height=576&format=pjpg&auto=webp",
			"height": 576,
			"width": 1023,
			"thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=350328282953993864",
			"thumbnailHeight": 287,
			"thumbnailWidth": 511,
			"base64Encoding": null,
			"name": null,
			"title": null,
			"provider": {
				"name": "yorkdispatch",
				"favIcon": "",
				"favIconBase64Encoding": ""
			},
			"imageWebSearchUrl": null,
			"webpageUrl": "https://www.yorkdispatch.com/story/archives/2023/01/20/york-city-police-shotspotter-60-percent-accurate-in-recent-test/69825010007/"
		}
	},
	{
		"id": "7463904435506280405",
		"title": "Who will benefit most from a liquid biopsy cancer screening test?",
		"url": "https://exbulletin.com/world/health/2021621/",
		"description": " The studies featured in this summary were research plaza As a preprint, it has not yet been peer-reviewed. important point A risk-stratified approach using blood-based liquid biopsy testing for early cancer detection may help identify individuals who would benefit most. It is important to understand the risk/benefit balance of using these tests. positive predictive []",
		"body": "ovaries, pancreas, and prostate cancer type.\nThe researchers also took into account two important lifestyle-related exposures: smoking and BMI.\nWe then calculated and evaluated the performance of the pan-cancer risk score using standardized hazard ratios of instantaneous risk and area under the curve (AUC).\nMain results\nThe pan-cancer risk score was associated with the risk of developing at least one cancer during the womens follow-up period (hazard ratio [HR]1.39) and males (HR, 1.41).\nCombining age, cancer-specific polygenic risk score, and influence of traditional risk factors, the researchers identified a high level of multicancer risk stratification across multiple cancer types.\nResearchers found the benefit of combining cancer-specific polygenic risk scores and traditional risk factors into predictive models when comparing 1-year and 10-year trajectories across different ages and risk strata. , 0.60) versus polygenic risk score-only model (female AUC, 0.58; male AUC, 0.58) and risk factor-only model (female AUC, 0.55; male AUC, 0.57).\nThe combined model revealed a mean 1-year overall absolute cancer risk of 2.63% in the high-risk group (top 10th percentile) and 0.74% in the low-risk group (bottom 10th percentile). This is almost a 4x increase.\nHowever, risk factor-only models provided less risk stratification between high and low risk groups, 2.34% vs. 1.13%, a two-fold increase.\nPredictive positive predictive values for multi-cancer liquid biopsy tests also varied with individual pan-cancer risk scores and diagnostic accuracy of specific liquid biopsy tests.\nLimitations\nThe researchers assumed that the reported sensitivity and specificity of the test would be applicable to all ages, genders, and risk groups.\nResearchers have included a limited set of risk factors in a risk prediction model for multiple cancers.\nDisclosure\nThis work was supported by the National Human Genome Research Institute, the National Cancer Institute, Dr. Miriam and Sheldon G. Adelson Foundation for Medical Research, the Gray Foundation, and the Commonwealth Foundation.\nThis is a summary of the preprint research study Potential Usefulness of Risk Stratification by Liquid Biopsy for Multiple Cancer Screening. This study has not been peer-reviewed.full text   You can find it at researchsquare.com.\nFollow Medscape for more information. Facebook, twitter, Instagram,\nThe mention sources can contact us to remove/changing this article\nWhat Are The Main Benefits Of Comparing Car Insurance Quotes Online\nLOS ANGELES, CA / ACCESSWIRE / June 24, 2020, / Compare-autoinsurance.Org has launched a new blog post that presents the main benefits of comparing multiple car insurance quotes. For more info and free online quotes, please visit https://compare-autoinsurance.Org/the-advantages-of-comparing-prices-with-car-insurance-quotes-online/ The modern society has numerous technological advantages. One important advantage is the speed at which information is sent and received. With the help of the internet, the shopping habits of many persons have drastically changed. The car insurance industry hasn't remained untouched by these changes. On the internet, drivers can compare insurance prices and find out which sellers have the best offers. View photos The advantages of comparing online car insurance quotes are the following: Online quotes can be obtained from anywhere and at any time. Unlike physical insurance agencies, websites don't have a specific schedule and they are available at any time. Drivers that have busy working schedules, can compare quotes from anywhere and at any time, even at midnight. Multiple choices. Almost all insurance providers, no matter if they are well-known brands or just local insurers, have an online presence. Online quotes will allow policyholders the chance to discover multiple insurance companies and check their prices. Drivers are no longer required to get quotes from just a few known insurance companies. Also, local and regional insurers can provide lower insurance rates for the same services. Accurate insurance estimates. Online quotes can only be accurate if the customers provide accurate and real info about their car models and driving history. Lying about past driving incidents can make the price estimates to be lower, but when dealing with an insurance company lying to them is useless. Usually, insurance companies will do research about a potential customer before granting him coverage. Online quotes can be sorted easily. Although drivers are recommended to not choose a policy just based on its price, drivers can easily sort quotes by insurance price. Using brokerage websites will allow drivers to get quotes from multiple insurers, thus making the comparison faster and easier. For additional info, money-saving tips, and free car insurance quotes, visit https://compare-autoinsurance.Org/ Compare-autoinsurance.Org is an online provider of life, home, health, and auto insurance quotes. This website is unique because it does not simply stick to one kind of insurance provider, but brings the clients the best deals from many different online insurance carriers. In this way, clients have access to offers from multiple carriers all in one place: this website. On this site, customers have access to quotes for insurance plans from various agencies, such as local or nationwide agencies, brand names insurance companies, etc. \"Online quotes can easily help drivers obtain better car insurance deals. All they have to do is to complete an online form with accurate and real info, then compare prices\", said Russell Rabichev, Marketing Director of Internet Marketing Company. CONTACT: Company Name: Internet Marketing CompanyPerson for contact Name: Gurgu CPhone Number: (818) 359-3898Email:\n: https://compare-autoinsurance.Org/ SOURCE: Compare-autoinsurance.Org View source version on accesswire.Com:https://www.Accesswire.Com/595055/What-Are-The-Main-Benefits-Of-Comparing-Car-Insurance-Quotes-Online View photos\nRelated",
		"snippet": "... The researchers assumed that the reported sensitivity and specificity of the <b>test</b> would be applicable to all ages, genders, and risk groups.",
		"keywords": "",
		"language": "en",
		"isSafe": true,
		"datePublished": "2023-01-25T06:52:19",
		"provider": {
			"name": "exbulletin",
			"favIcon": "",
			"favIconBase64Encoding": ""
		},
		"image": {
			"url": "https://i.imgur.com/AoyxWyw.png",
			"height": 600,
			"width": 600,
			"thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=2380187371982823609",
			"thumbnailHeight": 600,
			"thumbnailWidth": 600,
			"base64Encoding": null,
			"name": null,
			"title": null,
			"provider": {
				"name": "exbulletin",
				"favIcon": "",
				"favIconBase64Encoding": ""
			},
			"imageWebSearchUrl": null,
			"webpageUrl": "https://exbulletin.com/world/health/2021621/"
		}
	},
	{
		"id": "8634334947856099391",
		"title": "Rohit Sharma lashes out at broadcasters over out of context statistic displayed after 100 vs NZ",
		"url": "https://www.indiatvnews.com/sports/cricket/rohit-sharma-lashes-out-at-broadcasters-over-out-of-context-statistic-displayed-after-100-vs-nz-2023-01-25-842029",
		"description": "Rohit Sharma, who was visibly upset, criticized the broadcaster for stating that his century in the third ODI against New Zealand was his first in 'three years,' as he noted that he had not played many 50-over matches during that time frame due to various reasons.",
		"body": "Rohit Sharma, who was visibly upset, criticized the broadcaster for stating that his century in the third ODI against New Zealand was his first in \"three years,\" as he noted that he had not played many 50-over matches during that time frame due to various reasons.As Rohit pulled away to deep square to get to his 30th ODI century in the third game against New Zealand on Tuesday, the broadcaster flashed the statistic that it was the Indian skipper's first ton since January 2020. While the statistic is true, Rohit felt it did not convey the correct picture. \"Regarding the first hundred in three years, I've played only 12 (17) ODIs in three years. Three years sounds a lot,\" Rohit told reporters after the match.\"You guys should know what's happening. I know that it was shown on broadcast but kabhi kabhi woh cheez bhi dhyan dena chahiye, broadcaster ko bhi sahi cheez dikhana chahiye (the broadcasters should give the correct picture),\" he added. When a journalist further asked if it was the return of the 'Hitman', a moniker used for him, Rohit, who slammed nine fours and six sixes in India's 90-run win, said, \"As I said, there were no matches in 2020.\"\"Everyone was sitting at home because of COVID-19. We hardly played ODIs, I was injured so I played two Tests during that time, so you have to put all of that in perspective. We were playing T20 cricket last year. And in T20 cricket, there's no better batsman than Suryakumar Yadav at the moment. He has hit two hundreds and I don't think anyone else has.\"Shardul Thakur changed the complexion of the match with his wicket-laden second spell as he snapped Daryl Mitchell and Tom Latham's wickets off back-to-back balls before getting rid of Glenn Phillips in his next over.\"He has got the knack of taking wickets at the crucial time for us. We have seen it not just in ODI cricket but also in Tests. He's very critical to us, and where we stand as a team. So, I just hope he keeps putting up performances like this and it will only do good to the team and give him confidence that he can come and take wickets. This guy is very smart, he has played a lot of domestic cricket and understands what needs to be done.\"He revealed how Shardul, Hardik Pandya and Virat Kohli plotted New Zealand skipper Tom Latham's dismissal.\"In this format, you need to use your skills and he (Shardul) definitely has them. He bowled a good knuckleball to Tom Latham today (Tuesday), nicely planned in the middle by Virat, Hardik, and Shardul.\"The skipper was also full of praise for the young Shubman Gill, who was the leading run-getter in the series. \"The way he was batting in the series I don't think much needs to be told. He understands his game, he paces his innings well and that is what we want, to go big and deep into the game.\"No matter how flat the pitch is, a double hundred isn't easy and that shows. In that game (first ODI) the next-best score was 34, which shows that he is calculative. He's got great maturity.\"India moved to the number one position in the ODI rankings following their victory. The attention now shifts to the much-awaited 4-match Test series vs Australia.Also Read:Shubman Gill equals Babar Azam's phenomenal world record in 3rd ODI vs NZ(Inputs PTI)",
		"snippet": "The attention now shifts to the much-awaited 4-match <b>Test</b> series vs Australia.Also Read:Shubman Gill equals Babar Azam's phenomenal world record in ...",
		"keywords": "",
		"language": "en",
		"isSafe": false,
		"datePublished": "2023-01-25T06:46:41",
		"provider": {
			"name": "indiatvnews",
			"favIcon": "",
			"favIconBase64Encoding": ""
		},
		"image": {
			"url": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2023/01/16745508561032350_india_new_zealand_cricket_80657.jpg",
			"height": 870,
			"width": 1200,
			"thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=6744537624807196787",
			"thumbnailHeight": 217,
			"thumbnailWidth": 299,
			"base64Encoding": null,
			"name": null,
			"title": null,
			"provider": {
				"name": "indiatvnews",
				"favIcon": "",
				"favIconBase64Encoding": ""
			},
			"imageWebSearchUrl": null,
			"webpageUrl": "https://www.indiatvnews.com/sports/cricket/rohit-sharma-lashes-out-at-broadcasters-over-out-of-context-statistic-displayed-after-100-vs-nz-2023-01-25-842029"
		}
	},
	{
		"id": "3714663352597204052",
		"title": "NASA to test NUCLEAR ROCKETS for flying astronauts to Mars in ultra-fast time",
		"url": "https://www.mirror.co.uk/news/world-news/nasa-test-nuclear-rockets-flying-29043183",
		"description": "NASA has unveiled plans to test a nuclear-powered rocket that could be used to take astronauts to Mars in considerably quicker time than conventional chemical propulsion",
		"body": "NASA is planning to test a nuclear-powered rocket that would be able to take astronauts to Mars in considerably quicker time.\nThe space agency is working with The US governments Defence Advanced Research Projects Agency (\nDARPA\n) with the aim of having the thermal rockets ready to be tried out in 2027.\n\"Using a nuclear thermal rocket allows for faster transit time, reducing risk for astronauts. Reducing transit time is a key component for human missions to Mars, as longer trips require more supplies and more robust systems,\" read a\nstatement.\n\"Maturing faster, more efficient transportation technology will help NASA meet its Moon to Mars Objectives.\"\nThe aim is for a whole new form of propulsion compared to the chemical systems used so far in space travel.\nImage:\nGetty Images)\nA nuclear thermal rocket provides a thrust-to-weight ratio of around 10,000 times more than electric propulsion and two-to-five times more efficient than conventional chemical propulsion.\n\"With the help of this new technology, astronauts could journey to and from deep space faster than ever  a major capability to prepare for crewed missions to Mars, said NASA Administrator Bill Nelson.\nAnd NASA Deputy Administrator Pam Melroy said: NASA has a long history of collaborating with DARPA on projects that enable our respective missions, such as in-space servicing.\nExpanding our partnership to nuclear propulsion will help drive forward NASA's goal to send humans to Mars.\nUnder the partnership, NASA will take the lead in the development of the nuclear thermal engine which will then be integrated with DARPAs experimental aircraft.\nDARPA will also be overseeing the whole programme including rocket systems integration and procurement with the engine due to be assembled before an in-space demonstration as early as 2027.\nDARPA and NASA have a long history of fruitful collaboration in advancing technologies for our respective goals, from the Saturn V rocket that took humans to the Moon for the first time to robotic servicing and refueling of satellites, said Dr Stefanie Tompkins, director, DARPA.\nThe space domain is critical to modern commerce, scientific discovery, and national security. The ability to accomplish leap-ahead advances in space technology through the DRACO nuclear thermal rocket program will be essential for more efficiently and quickly transporting material to the Moon and eventually, people to Mars.",
		"snippet": "NASA has unveiled plans to <b>test</b> a nuclear-powered rocket that could be used to take astronauts to Mars in considerably quicker time than conventional ...",
		"keywords": "",
		"language": "en",
		"isSafe": true,
		"datePublished": "2023-01-25T06:12:55",
		"provider": {
			"name": "mirror",
			"favIcon": "",
			"favIconBase64Encoding": ""
		},
		"image": {
			"url": "https://i2-prod.mirror.co.uk/incoming/article29043187.ece/ALTERNATES/s1200/0_astronaut-on-planet-Mars-watching-the-rising-Sun-3d-space-illustration.jpg",
			"height": 630,
			"width": 1200,
			"thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=3079840586431472536",
			"thumbnailHeight": 157,
			"thumbnailWidth": 299,
			"base64Encoding": null,
			"name": null,
			"title": null,
			"provider": {
				"name": "mirror",
				"favIcon": "",
				"favIconBase64Encoding": ""
			},
			"imageWebSearchUrl": null,
			"webpageUrl": "https://www.mirror.co.uk/news/world-news/nasa-test-nuclear-rockets-flying-29043183"
		}
	},
	{
		"id": "2332501451398217015",
		"title": "NASA, DARPA collaborate to test 'DRACO', a rocket engine that'll send humans to Mars faster than ever",
		"url": "https://www.wionews.com/technology/nasa-darpa-collaborate-to-test-draco-a-rocket-engine-thatll-send-humans-to-mars-faster-than-ever-555781",
		"description": "NASA and the Defense Advanced Research Projects Agency (DARPA), a research arm of the US Department of Defense, have unveiled plans to test nuclear-powered rockets that would one day fly humans to Mars.Announcing the ambitious plans on Tuesday, the space agency said that it will partner with DARPA on the Demonstration Rocket for Agile Cislunar Operations, or DRACO, programme. It is slated to happen by 2027.Watch |NASA's Mars Perseverance rover finds samples of Microbial life on mars",
		"body": "Follow Us\nStory highlights\nThe current technology allows for the 225 million-kilometre average distance journey from Earth to Mars to be completed in about seven months. While the estimated time using a nuclear thermal rocket engine is not known, as per the NASA Administrator, it would allow astronauts to undertake the \"journey to and from deep space faster than ever\"\nNASA and the Defense Advanced Research Projects Agency (DARPA), a research arm of the US Department of Defense, have unveiled plans to test nuclear-powered rockets that would one day fly humans to Mars.\nAnnouncing the ambitious plans on Tuesday, the space agency said that it will partner with DARPA on the Demonstration Rocket for Agile Cislunar Operations, or DRACO, programme. It is slated to happen by 2027.\nWatch |NASA's Mars Perseverance rover finds samples of Microbial life on mars\n\"NASA will work with our long-term partner, DARPA, to develop and demonstrate advanced nuclear thermal propulsion technology as soon as 2027,\" said NASA Administrator Bill Nelson as he announced the mission.\n\"With the help of this new technology, astronauts could journey to and from deep space faster than evera major capability to prepare for crewed missions to Mars,\" he explained.\nThe nuclear thermal rocket, as per the NASA website, will allow for a \" faster transit time\" and will also reduce the risk for astronauts.\nAlso read |",
		"snippet": "... arm of the US Department of Defense, have unveiled plans to <b>test</b> nuclear-powered rockets that would one day fly humans to Mars.Announcing the ...",
		"keywords": "",
		"language": "en",
		"isSafe": true,
		"datePublished": "2023-01-25T06:01:03",
		"provider": {
			"name": "wionews",
			"favIcon": "",
			"favIconBase64Encoding": ""
		},
		"image": {
			"url": "http://cdn.wionews.com/sites/default/files/2023/01/25/327953-new-wion-6.png",
			"height": 675,
			"width": 1200,
			"thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=58370778734749841",
			"thumbnailHeight": 252,
			"thumbnailWidth": 448,
			"base64Encoding": null,
			"name": null,
			"title": null,
			"provider": {
				"name": "wionews",
				"favIcon": "",
				"favIconBase64Encoding": ""
			},
			"imageWebSearchUrl": null,
			"webpageUrl": "https://www.wionews.com/technology/nasa-darpa-collaborate-to-test-draco-a-rocket-engine-thatll-send-humans-to-mars-faster-than-ever-555781"
		}
	},
	{
		"id": "1608029628807195075",
		"title": "Matt Renshaw dissects Ravichandran Ashwin threat ahead of India series",
		"url": "https://www.sportskeeda.com/cricket/news-you-get-used-you-ve-faced-while-matt-renshaw-dissects-ravichandran-ashwin-s-threat-ahead",
		"description": "Australian opener Matt Renshaw is prepared to face Ravichandran Ashwin in the upcoming Border-Gavaskar Trophy in India should he get a chance.",
		"body": "Speaking to AAP, Renshaw admitted that Ashwin is a canny operator, but feels the off-spinner becomes easy to face over time and that the biggest threat against him is the LBW dismissal.\nThe southpaw said he would be ready if a chance came his way. He said:\n\"Ashwin is difficult to face. He is a smart bowler with a lot of variations and he uses them very well, but you do get used to him once youve faced him for a while. I think the big challenge from Ashwin and any off-spinner in spinning conditions to a left-hander is the lbw threat. Obviously everyone thinks about the one that turns and gets you caught at slip, but the big one is the lbw when it doesnt spin. You just have to be ready for that one.\n\"I think two years batting at No.5 helped me with facing spin. I know my game a lot better now and I am a lot more comfortable in different situations. We have a strong squad and it is going to be hard to push my way in, but I know that I will be ready if I do get a chance.\"\nIn 2021, Ashwin became the first bowler in Test history to take 200 scalps against left-handed batters. However, the 2016-17 series saw Renshaw get dismissed only once by the veteran finger-spinner.\n\"We have got a good week and a bit in India before the first Test\" - Matt Renshaw\nMatt Renshaw. (Image Credits: Twitter)\n, currently playing for the Brisbane Heat in the BBL, further stated that the Aussie batters have used every opportunity to practice hitting the red ball in conditions tailormade for the India tour.\nHe expects the tourists to have ample time before the first Test, adding:\n\"The SG ball is a bit different, so we are just trying to prepare as well as we can during this BBL schedule if we get a window to hit red balls. It is a lot different conditions in India, so we are trying to replicate them as much as we can. We have got a good week and a bit in India before the first Test, so there will be plenty of time to prepare there as well.\"",
		"snippet": "In 2021, Ashwin became the first bowler in <b>Test</b> history to take 200 scalps against left-handed batters. However, the 2016-17 series saw Renshaw get ...",
		"keywords": "",
		"language": "en",
		"isSafe": true,
		"datePublished": "2023-01-25T05:53:45",
		"provider": {
			"name": "sportskeeda",
			"favIcon": "",
			"favIconBase64Encoding": ""
		},
		"image": {
			"url": "https://staticc.sportskeeda.com/editor/2023/01/bd9af-16746251488213-1920.jpg",
			"height": 1280,
			"width": 1920,
			"thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=2782628600276063504",
			"thumbnailHeight": 240,
			"thumbnailWidth": 360,
			"base64Encoding": null,
			"name": null,
			"title": null,
			"provider": {
				"name": "sportskeeda",
				"favIcon": "",
				"favIconBase64Encoding": ""
			},
			"imageWebSearchUrl": null,
			"webpageUrl": "https://www.sportskeeda.com/cricket/news-you-get-used-you-ve-faced-while-matt-renshaw-dissects-ravichandran-ashwin-s-threat-ahead"
		}
	},
	{
		"id": "5227241595984525886",
		"title": "After SpaceX's Successful Fuelling Test The Company Plans To Go On a More Ambitious Engine Firing Test",
		"url": "https://www.topbuzztrends.com/after-spacexs-successful-fuelling-test-the-company-plans-to-go-on-a-more-ambitious-engine-firing-test/",
		"description": "After SpaceX's Successful Fuelling Test, The Company Plans To Go On a More Ambitious Engine Firing Test - Top Buzz Trends",
		"body": "Shares of Chinese social media giant Weibo fall on Hong Kong debut\nCredit: arstechnica\nThe corporation published pictures and a video of its Super Heavy first stage and fully fuelled Starship upper stage in South Texas. As they were filled with very chilly liquid oxygen and methane propellants, the gleaming stainless steel vehicles took on a frosted appearance.\nSpaceX claimed to have loaded more than 10 million pounds (approximately 4.6 million kg) of fuel onto the vehicle, which stands 120 meters tall when completely packed, during this wet-dress rehearsal test. In other words, for over an hour, the business loaded a lean, 30-story building with flammable liquid fuelsand nothing blew up.\nSpaceX successfully completed this crucial fueling test on its first try while stacking Starship and Super Heavy. This test evaluated the rocket, the launch tower, and the ground systems necessary to pump these pressurized cryogenic fluids.\nADVERTISEMENT\nThe Starship spacecraft will now be taken off the top of the first stage and placed away, according to SpaceX. This will allow the business to test all 33 Raptor 2 rocket engines mounted to the first stage using static fire. This is the last significant technical test that must be completed before a launch attempt.\nThis fire will put numerous crucial components to the test, including simultaneous fuel delivery to all of the engines and engine ignition. This test may take place in the next seven or ten days, although that timeframe probably relies on a lot of work being completed on schedule.\nAnd if the test is successful? The Federal Aviation Administration, which is in charge of approving the experimental launch from SpaceXs facility in South Texas, will get data from this test and others from SpaceX. Additionally, SpaceX has been working to have its South Texas ground systems ready for the launch attempt.\nThe much-anticipated launch of Starship, which will be the largest, tallest, most capable, and most powerful rocket ever to leave Earth, is still coming along quite well for SpaceX.\nSource:",
		"snippet": "... (approximately 4.6 million kg) of fuel onto the vehicle, which stands 120 meters tall when completely packed, during this wet-dress rehearsal <b>test</b>.",
		"keywords": "",
		"language": "en",
		"isSafe": true,
		"datePublished": "2023-01-25T05:52:27",
		"provider": {
			"name": "topbuzztrends",
			"favIcon": "",
			"favIconBase64Encoding": ""
		},
		"image": {
			"url": "https://www.topbuzztrends.com/wp-content/uploads/2023/01/After-SpaceXs-Successful-Fuelling-Test-The-Company-Plans-To-Go-On-a-More-Ambitious-Engine-Firing-Test_.jpg",
			"height": 720,
			"width": 1080,
			"thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=5645601544072291671",
			"thumbnailHeight": 202,
			"thumbnailWidth": 303,
			"base64Encoding": null,
			"name": null,
			"title": null,
			"provider": {
				"name": "topbuzztrends",
				"favIcon": "",
				"favIconBase64Encoding": ""
			},
			"imageWebSearchUrl": null,
			"webpageUrl": "https://www.topbuzztrends.com/after-spacexs-successful-fuelling-test-the-company-plans-to-go-on-a-more-ambitious-engine-firing-test/"
		}
	},
	{
		"id": "2467687979326814951",
		"title": "Devon Conway happy to have developed spin game ahead of ODI World Cup",
		"url": "https://timesofindia.indiatimes.com/sports/cricket/new-zealand-in-india/devon-conway-happy-to-have-developed-spin-game-ahead-of-odi-world-cup/articleshow/97299288.cms",
		"description": "Cricket News: Opener Devon Conway is delighted to have added the sweep and reverse sweep to his repertoire on New Zealand's ongoing tour of the sub-continent with t",
		"body": "Opener Devon Conway is delighted to have added the sweep and reverse sweep to his repertoire on New Zealand's ongoing tour of the sub-continent with the ODI World Cup scheduled in India later this year.\nINDORE: Opener\nis delighted to have added the sweep and reverse sweep to his repertoire on\nNew Zealand\n's ongoing tour of the sub-continent with the\nODI World Cup\nscheduled in India later this year.\nNew Zealand are having a bittersweet tour of the sub-continent. Having won the ODI series in Pakistan, the\nBlack Caps\nslumped to a 0-3 loss in the 50-over fixtures in India.\nConway scored two Test centuries in the drawn series against Pakistan, followed by a 138 in the third ODI against India as he successfully negotiated spinners of both countries.\n\"I'm certainly pretty happy with how things have gone, personally, over the last month-and-a-half,\" Conway said at the post-match press conference.\n\"There's been a lot of learning for me, how to attack spin in the subcontinent. I've had to learn how to sweep, reverse sweep and put bowlers under pressure as much as possible.\"\nThe 31-year-old opener has emerged as a force to reckon with at the top, boasting of an exceptional record across all three formats that includes a double century on Test debut.\n\"I've been very fortunate to have good experience in our group. We had Kane with us in Pakistan, it gave me the opportunity to have those conversations with him and Tommy Latham - guys who've played here in these conditions quite often - and see how they go about it.\n\"For me, I can take a lot of learning moving forward, especially for the World Cup coming up,\" he added.\nThe third ODI against India started on a challenging note for the Kiwis as it was raining sixes and fours with Rohit Sharma and Shubman Gill sharing a 212-run opening stand.\n\"It was a challenge for our bowlers today, it was a batting surface. The nature in which Rohit and Shubman batted put serious pressure on us. We just tried to hang in there and break the partnership and the put pressure on the new batter.\"\nNew Zealand were without the services of several senior players including the pace duo of Trent Boult and Tim Southee.\n\"The absence of Boult and Southee is massive for us, they are very experienced bowlers but on the flipside it has given opportunity for the younger bowlers to come through and learn on the go,\" said Conway.\nStart a Conversation\nFOLLOW US ON SOCIAL MEDIA\nFacebook",
		"snippet": "Conway scored two <b>Test</b> centuries in the drawn series against Pakistan, followed by a 138 in the third ODI against India as he successfully negotiated ...",
		"keywords": "",
		"language": "en",
		"isSafe": true,
		"datePublished": "2023-01-25T05:41:00",
		"provider": {
			"name": "indiatimes",
			"favIcon": "",
			"favIconBase64Encoding": ""
		},
		"image": {
			"url": "https://static.toiimg.com/thumb/resizemode-4,width-1280,height-720,msid-97299295/97299295.jpg",
			"height": 720,
			"width": 1280,
			"thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=3627310414772640420",
			"thumbnailHeight": 270,
			"thumbnailWidth": 480,
			"base64Encoding": null,
			"name": null,
			"title": null,
			"provider": {
				"name": "indiatimes",
				"favIcon": "",
				"favIconBase64Encoding": ""
			},
			"imageWebSearchUrl": null,
			"webpageUrl": "https://timesofindia.indiatimes.com/sports/cricket/new-zealand-in-india/devon-conway-happy-to-have-developed-spin-game-ahead-of-odi-world-cup/articleshow/97299288.cms"
		}
	},
	{
		"id": "8080913719763614904",
		"title": "Ashwin will be one of the toughest challenges during India series: Renshaw",
		"url": "https://www.devdiscourse.com/article/sports-games/2331259-ashwin-will-be-one-of-the-toughest-challenges-during-india-series-renshaw",
		"description": "Australia batter Matt Renshaw has conceded that spinner Ravichandran Ashwin will be one of the toughest bowlers to face in the four-Test series in India beginning February 9 With the Border-Gavaskar series set to begin in Nagpur a lot of focus is on how the Pat Cummins-led Australia will face the the Indian off-spinner who made history in 2021 by becoming the first bowler to take 200 wickets of left-handers",
		"body": "Updated: 25-01-2023 11:09 IST | Created: 25-01-2023 10:56 IST\nMatt Renshaw.  Image Credit: ANI\nCountry:\nAustralia\nSHARE\nAustralia batter Matt Renshaw has conceded that spinner Ravichandran Ashwin will be one of the toughest bowlers to face in the four-Test series in India beginning February 9. With the Border-Gavaskar series set to begin in Nagpur, a lot of focus is on how the Pat Cummins-led Australia will face the the Indian off-spinner, who made history in 2021 by becoming the first bowler to take 200 wickets of left-handers.\nWith Australia's batting lineup packed with left-handers, including David Warner, Usman Khawaja, Travis Head, wicketkeeper Alex Carey and Renshaw himself, Aswhin could prove to be more than handful for the visitors during the high-profile series.\n''Ashwin is difficult to face. He is a smart bowler with a lot of variations and he uses them very well, but you do get used to him once you've faced him for a while,'' Renshaw, 26, was quoted as saying by Australian Associated Press on Wednesday.\n''I think the big challenge from Ashwin and any off-spinner in spinning conditions to a left-hander is the lbw threat.'' Renshaw indicated Australia should be wary of Ashwin's delivery that doesn't spin and has caused a lot of LBW dismissals.\n''Obviously everyone thinks about the one that turns and gets you caught at slip, but the big one is the lbw when it doesn't spin. You just have to be ready for that one.\n''I think two years batting at No.5 helped me with facing spin. I know my game a lot better now and I am a lot more comfortable in different situations,'' he added.\nRenshaw was a member of the side that toured India in 2017 and opened the innings in all but one innings of the four Tests. Ashwin dismissed him once, in the opening Test at Pune, but not before Renshaw had scored a half-century.\nThe Australian, who would most likely come in at No.5 if given an opportunity in the XI on the upcoming tour, however was confident his side would be strong challengers.\n''We have a strong squad and it is going to be hard to push my way in, but I know that I will be ready if I do get a chance.'' Renshaw said his Big Bash League (BBL) stint with Brisbane Heat was helping him prepare for the series as the side was packed with spinners. Heat have the likes of leg-spinner Mitchell Swepson, Matthew Kuhnemann and Marnus Labuschagne, and Renshaw said he is preparing for the India series with SG balls.\n''The SG ball is a bit different, so we are just trying to prepare as well as we can during this BBL schedule if we get a window to hit red balls,'' said Renshaw.\n''It is a lot different conditions in India, so we are trying to replicate them as much as we can. The plan was if (the Heat) got knocked out we'd do some prep with the (Australian) team in Sydney, but we just kept winning and are in the (BBL) finals now.\n''We have got a good week and a bit in India before the first Test, so there will be plenty of time to prepare there as well,'' he added.\n(This story has not been edited by Devdiscourse staff and is auto-generated from a syndicated feed.)\nREAD MORE ON:",
		"snippet": "Ashwin dismissed him once, in the opening <b>Test</b> at Pune, but not before Renshaw had scored a half-century. The Australian, who would most likely come ...",
		"keywords": "",
		"language": "en",
		"isSafe": false,
		"datePublished": "2023-01-25T05:26:58",
		"provider": {
			"name": "devdiscourse",
			"favIcon": "",
			"favIconBase64Encoding": ""
		},
		"image": {
			"url": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/04_01_2023_05_38_41_1155873.jpg?width=920",
			"height": 690,
			"width": 920,
			"thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=6454076958636615359",
			"thumbnailHeight": 150,
			"thumbnailWidth": 200,
			"base64Encoding": null,
			"name": null,
			"title": null,
			"provider": {
				"name": "devdiscourse",
				"favIcon": "",
				"favIconBase64Encoding": ""
			},
			"imageWebSearchUrl": null,
			"webpageUrl": "https://www.devdiscourse.com/article/sports-games/2331259-ashwin-will-be-one-of-the-toughest-challenges-during-india-series-renshaw"
		}
	},
	{
		"id": "3931495600736059192",
		"title": "Rohit Sharma drops BIG hint on Jasprit Bumrah's return to India squad",
		"url": "https://www.dnaindia.com/cricket/report-rohit-sharma-makes-big-statement-on-jasprit-bumrah-return-to-india-squad-ind-vs-nz-3019294",
		"description": "Rohit Sharma has expressed hope that Bumrah would return to the Indian team in the third Test against Australia.",
		"body": "Cricket\nRohit Sharma drops BIG hint on Jasprit Bumrah's return to India squad\nRohit Sharma has expressed hope that Bumrah would return to the Indian team in the third Test against Australia.\nReported By:\n| Edited By: DNA Web Team |Source: DNA webdesk |Updated: Jan 25, 2023, 09:53 AM IST\nFile photo\nTeam India defeated New Zealand by 90 runs in the third and final ODI of the series in Indore on Tuesday (January 24) to register a 3-0 series win. Batting first, India scored a huge total of 385/9 in their allotted quota of 50 overs. Captain Rohit Sharma (101) and Shubman Gill (112) hit quickfire tons to deflate Kiwis bowlers. In reply, New Zealand managed to score only 290 runs. Shardul Thakur and Kuldeep Yadav claimed three wickets each.\nIt is to be noted that Team India were playing without their ace fast bowler Jasprit Bumrah as the Mumbai Indians star is still recovering from a back injury. It may be recalled that Bumrah was named in the ODI squad for the series against Sri Lanka few weeks ago but his name was later removed from the squad amid reports that the team management was not interested in rushing Bumrahs return to the squad.\nBumrah will also miss Indias first two Tests against Australia. Talking to reporters after the third ODI against New Zealand, Indian captain Rohit Sharma has expressed hope that Bumrah would return to the Indian team in the third Test against Australia. Bumrah, 29, is out of action since September last year.\n\"Not too sure about Bumrah, I am hoping he plays next (last) two Tests (against Australia), we don't want to take any risks with him as back injuries are always critical. We have a lot of cricket coming back after that also,\" Rohit said.\n\"We are in constant touch with physios and doctors in NCA. The medical team will give him as much time as he wants,\" he added.",
		"snippet": "... to the Indian team in the third <b>Test</b> against Australia. Cricket Rohit Sharma drops BIG hint ... to the Indian team in the third <b>Test</b> against Australia.",
		"keywords": "",
		"language": "en",
		"isSafe": true,
		"datePublished": "2023-01-25T04:17:00",
		"provider": {
			"name": "dnaindia",
			"favIcon": "",
			"favIconBase64Encoding": ""
		},
		"image": {
			"url": "https://cdn.dnaindia.com/sites/default/files/styles/half/public/2023/01/25/2568561-2542395-boom.jpg",
			"height": 360,
			"width": 640,
			"thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=8879835490503877055",
			"thumbnailHeight": 180,
			"thumbnailWidth": 320,
			"base64Encoding": null,
			"name": null,
			"title": null,
			"provider": {
				"name": "dnaindia",
				"favIcon": "",
				"favIconBase64Encoding": ""
			},
			"imageWebSearchUrl": null,
			"webpageUrl": "https://www.dnaindia.com/cricket/report-rohit-sharma-makes-big-statement-on-jasprit-bumrah-return-to-india-squad-ind-vs-nz-3019294"
		}
	},
	{
		"id": "1818647552673330962",
		"title": "Alpha One in Adams Stakes test at Sandown for new stable",
		"url": "https://www.racenet.com.au/news/trent-busuttin-and-natalie-young-to-test-alpha-one-as-a-group-contender-in-adams-stakes-at-sandown-20230125",
		"description": "Speedy colt Alpha One will start a campaign geared towards autumn sprint features for a new stable in Thursday's Listed Adams Stakes at Sandown.",
		"body": "Race Previews\nAlpha on One path after Sandown test for new stable\nSpeedster Alpha One will have his first start for trainers Trent Busuttin and Natalie Young at Sandown on Thursday. Picture: Getty Images\nBy              Brad Waters\n04:11am  25 January 2023\nCranbourne trainers Trent Busuttin and Natalie Young have a simple task with stable recruit Alpha One beyond Thursday's Listed Adams Stakes at Sandown.\nAlpha One joined Busuttin and Young's camp less than a fortnight ago but the trainers immediately threw the three-year-old into a tough contest against older horses.\nBusuttin said Group races were the aim with Alpha One, who previously raced in the care of the Peter and Paul Snowden camp, with the Adams Stakes to indicate whether the colt could measure up to autumn features.\nAUTUMN CARNIVAL OFFER: UNLOCK EVERYTHING ON RACENET FOR $1\n\"They are hoping the horse is a Group horse but there's no set plans,\" Busuttin said.\n\"I guess if he were to win on Thursday, we'd look at a race like the (Group 2) Rubiton Stakes.\n\"I suppose the Oakleigh Plate is the logical target but, at the end of the day, he is a rating 77 horse.\n\"Thursday will tell the story.\"\nWhile Alpha One is still rated below his rivals in the Adams Stakes, the son of Super One has an impressive form reference on his record.\nGiga Kick needed every centimetre of the Caulfield straight to run down Alpha One when the pair met in the Group 3 Vain Stakes\n(1100m) last August.\nGiga Kick went on to win the Group 2 Danehill Stakes before his memorable win in Australia's richest race, The Everest, in Sydney.\nThe Everest winner Giga Kick (left) and Alpha One (right) went head-to-head at Caulfield in August last year. Picture: Getty Images\n\"We say he's only a rating 77 horse but he's been beaten a nose by a horse that won The Everest,\" Busuttin said.\n\"Weight-wise, he doesn't get in that well on Thursday but we'll find out exactly where the horse is in the order of things.\"\nBusuttin said the stable had only enough time to give Alpha One a single gallop before Thursday's race but the sprinter is fit enough for the $175,000 feature after his first-up fifth in Sydney last month.\n\"We've only had the horse a week but, from what I've seen of him, he's a sound horse with a very good action,\" Busuttin said.\n\"He had a little run along on Saturday and the track rider was very happy with him.\n\"He's turned up in great order, which you would expect when coming from a top stable like the Snowdens.\"\nAlpha One is a $5.50 chance in TAB's early market on the Adams Stakes.\nThe Clinton McDonald-trained Star Patrol is the $2.20 favourite.\nRead all news by",
		"snippet": "Race Previews Alpha on One path after Sandown <b>test</b> for new stable Speedster Alpha One will have his first start for trainers Trent Busuttin and ...",
		"keywords": "",
		"language": "en",
		"isSafe": true,
		"datePublished": "2023-01-25T04:11:00",
		"provider": {
			"name": "racenet",
			"favIcon": "",
			"favIconBase64Encoding": ""
		},
		"image": {
			"url": "https://static.perform.news/sites/sites/2/2023/01/25151156/7903cc40ceeb97177de527808507f62a.jpeg",
			"height": 720,
			"width": 1280,
			"thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=6718331877214800343",
			"thumbnailHeight": 180,
			"thumbnailWidth": 320,
			"base64Encoding": null,
			"name": null,
			"title": null,
			"provider": {
				"name": "racenet",
				"favIcon": "",
				"favIconBase64Encoding": ""
			},
			"imageWebSearchUrl": null,
			"webpageUrl": "https://www.racenet.com.au/news/trent-busuttin-and-natalie-young-to-test-alpha-one-as-a-group-contender-in-adams-stakes-at-sandown-20230125"
		}
	},
	{
		"id": "6921194752056747824",
		"title": "Three years sounds a lot, have only played few ODIs: Rohit miffed with broadcasters",
		"url": "https://www.devdiscourse.com/article/sports-games/2331180-three-years-sounds-a-lot-have-only-played-few-odis-rohit-miffed-with-broadcasters",
		"description": "An annoyed Rohit Sharma slammed the broadcaster for showing his century in the third ODI against New Zealand was the first in three years as the skipper pointed out he hardly played any 50-over matches during the period due to various reasons",
		"body": "Updated: 25-01-2023 09:29 IST | Created: 25-01-2023 09:29 IST\nCountry:\nIndia\nSHARE\nAn annoyed Rohit Sharma slammed the broadcaster for showing his century in the third ODI against New Zealand was the first in ''three years'' as the skipper pointed out he hardly played any 50-over matches during the period due to various reasons.\nAs Rohit pulled away to deep square to get to his 30th ODI century in the third game against New Zealand on Tuesday, the broadcaster flashed the statistic that it was the Indian skipper's first ton since January 2020.\nWhile the statistic is true, Rohit felt it did not convey the correct picture.\n''Regarding the first hundred in three years, I've played only 12 (17) ODIs in three years. Three years sounds a lot,'' Rohit told reporters after the match.\n''You guys should know what's happening. I know that it was shown on broadcast but kabhi kabhi woh cheez bhi dhyan dena chahiye, broadcaster ko bhi sahi cheez dikhana chahiye (the broadcasters should give the correct picture),'' he added.\nWhen a journalist further asked if it was the return of the 'Hitman', a moniker used for him, Rohit, who slammed nine fours and six sixes in India's 90-run win, said, ''As I said, there were no matches in 2020.'' ''Everyone was sitting at home because of COVID-19. We hardly played ODIs, I was injured so I played two Tests during that time, so you have to put all of that in perspective.\n''We were playing T20 cricket last year. And in T20 cricket, there's no better batsman than Suryakumar Yadav at the moment. He has hit two hundreds and I don't think anyone else has.'' Shardul Thakur changed the complexion of the match with his wicket-laden second spell as he snapped Daryl Mitchell and Tom Latham's wickets off back-to-back balls before getting rid of Glenn Phillips in his next over.\n''He has got the knack of taking wickets at the crucial time for us. We have seen it not just in ODI cricket but also in Tests. He's very critical to us, and where we stand as a team.\n''So, I just hope he keeps putting up performances like this and it will only do good to the team and give him confidence that he can come and take wickets.\n''This guy is very smart, he has played a lot of domestic cricket and understands what needs to be done.'' He revealed how Shardul, Hardik Pandya and Virat Kohli plotted New Zealand skipper Tom Latham's dismissal.\n''In this format, you need to use your skills and he (Shardul) definitely has them. He bowled a good knuckle ball to Tom Latham today (Tuesday), nicely planned in the middle by Virat, Hardik, and Shardul.'' The skipper was also full of praise for the young Shubman Gill, who was the leading run-getter in the series.\n''The way he was batting in the series I don't think much needs to be told. He understands his game, he paces his innings well and that is what we want, to go big and deep into the game.\n''No matter how flat the pitch is, a double hundred isn't easy and that shows. In that game (first ODI) the next best score was 34, which shows that he is calculative. He's got great maturity.'' With the win, India climbed to the top spot in the ODI rankings but Rohit was indifferent to the feat.\n''Honestly speaking, ranking and all doesn't matter. Before this series we were fourth. I don't know how we were fourth because the entire last year I don't think we lost any series.\n''We don't get too much into it, we prepare for the big tournaments. We want to be ready for everything. All these series give confidence.''\n(This story has not been edited by Devdiscourse staff and is auto-generated from a syndicated feed.)\nREAD MORE ON:",
		"snippet": "An annoyed Rohit Sharma slammed the broadcaster for showing his century in the third ODI against New Zealand was the first in three years as the skipper pointed out he hardly played any 50-over matches during the period due to various reasons.",
		"keywords": "",
		"language": "en",
		"isSafe": false,
		"datePublished": "2023-01-25T03:59:12",
		"provider": {
			"name": "devdiscourse",
			"favIcon": "",
			"favIconBase64Encoding": ""
		},
		"image": {
			"url": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/imagegallery/16_01_2019_13_05_02_5451348.jpg?width=920",
			"height": 400,
			"width": 920,
			"thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=7927579441641838296",
			"thumbnailHeight": 87,
			"thumbnailWidth": 200,
			"base64Encoding": null,
			"name": null,
			"title": null,
			"provider": {
				"name": "devdiscourse",
				"favIcon": "",
				"favIconBase64Encoding": ""
			},
			"imageWebSearchUrl": null,
			"webpageUrl": "https://www.devdiscourse.com/article/sports-games/2331180-three-years-sounds-a-lot-have-only-played-few-odis-rohit-miffed-with-broadcasters"
		}
	},
	{
		"id": "8962625675123251344",
		"title": "US to test nuclear-powered spacecraft by 2027",
		"url": "https://www.arabnews.com/node/2238471/offbeat",
		"description": "WASHINGTON: The United States plans to test a spacecraft engine powered by nuclear fission by 2027 as part of a long-term NASA effort to demonstrate more efficient methods of propelling astronauts to Mars in the future, the space agencys chief said on Tuesday. NASA will partner with the US militarys research and development agency, DARPA, to develop a nuclear thermal",
		"body": "\r\n\tWASHINGTON: The United States plans to test a spacecraft engine powered by nuclear fission by 2027 as part of a long-term NASA effort to demonstrate more efficient methods of propelling astronauts to Mars in the future, the space agencys chief said on Tuesday.\r\n\tNASA will partner with the US militarys research and development agency, DARPA, to develop a nuclear thermal propulsion engine and launch it to space as soon as 2027, NASA administrator Bill Nelson said during a conference in National Harbor, Maryland.\r\n\tThe US space agency has studied for decades the concept of nuclear thermal propulsion, which introduces heat from a nuclear fission reactor to a hydrogen propellant in order to provide a thrust believed to be far more efficient than traditional chemical-based rocket engines.\r\n\tNASA officials view nuclear thermal propulsion as crucial for sending humans beyond the moon and deeper into space. A trip to Mars from Earth using the technology could take roughly four months instead of some nine months with a conventional, chemically powered engine, engineers say.\r\n\tThat would substantially reduce the time astronauts would be exposed to deep-space radiation and would also require fewer supplies, such as food and other cargo, during a trip to Mars.\r\n\tIf we have swifter trips for humans, they are safer trips, NASA deputy administrator and former astronaut Pam Melroy said Tuesday.\r\n\tThe planned 2027 demonstration, part of an existing DARPA research program that NASA is now joining, could also inform the ambitions of the US Space Force, which has envisioned deploying nuclear reactor-powered spacecraft capable of moving other satellites orbiting near the moon, DARPA and NASA officials said.\r\n\tDARPA in 2021 awarded funds to General Atomics, Lockheed Martin and Jeff Bezos space company Blue Origin to study designs of nuclear reactors and spacecraft. By around March, the agency will pick a company to build the nuclear spacecraft for the 2027 demonstration, the programs manager Tabitha Dodson said in an interview.\r\n\tThe joint NASA-DARPA efforts budget is $110 million for fiscal year 2023 and is expected to be hundreds of millions of dollars more through 2027.\r\n\r\n\r\n\t",
		"snippet": "WASHINGTON: The United States plans to <b>test</b> a spacecraft engine powered by nuclear fission by 2027 as part of a long-term NASA effort to demonstrate ...",
		"keywords": "",
		"language": "en",
		"isSafe": true,
		"datePublished": "2023-01-25T03:12:28",
		"provider": {
			"name": "arabnews",
			"favIcon": "",
			"favIconBase64Encoding": ""
		},
		"image": {
			"url": "https://www.arabnews.com/sites/default/files/styles/n_670_395/public/main-image/2023/01/25/3644926-1264175870.jpg?itok=6whQEqOb",
			"height": 391,
			"width": 670,
			"thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=8176751334737852652",
			"thumbnailHeight": 219,
			"thumbnailWidth": 375,
			"base64Encoding": null,
			"name": null,
			"title": null,
			"provider": {
				"name": "arabnews",
				"favIcon": "",
				"favIconBase64Encoding": ""
			},
			"imageWebSearchUrl": null,
			"webpageUrl": "https://www.arabnews.com/node/2238471/offbeat"
		}
	},
	{
		"id": "3348450289582704920",
		"title": "Rohit Sharma Gives Update on Jasprit Bumrahs Team India Comeback",
		"url": "https://www.india.com/sports/ind-vs-aus-rohit-sharma-gives-update-on-jasprit-bumrahs-team-india-comeback-5868207/",
		"description": "Rohit Sharma, Rohit Sharma news, Rohit Sharma age, Rohit Sharma updates, Rohit Sharma records, Rohit Sharma captain, Rohit Sharma runs, Jasprit Bumrah, Jasprit Bumrah news, Jasprit Bumrah age, Jasprit Bumrah updates, Jasprit Bumrah wickets, Jasprit Bumrah records, Ind vs NZ, Ind vs Aus, India vs Australia, India vs New Zealand, Ind vs Aus schedule, Ind vs Aus squads -- aaa",
		"body": "Rohit Sharma Gives Update on Jasprit Bumrahs Team India Comeback\nRohit Sharma Gives Update on Jasprit Bumrahs Team India Comeback\nClaiming that he is not too sure about Bumrah, Rohit admitted that he hopes the pacer is back for the last two Tests versus Australia.\nUpdated: January 25, 2023 8:25 AM IST\nBy India.com Sports Desk\n|\nEdited by  Ankit Banerjee\nRohit Sharma makes huge statement on Jasprit Bumrah's potential Team India return: 'I'm hoping he comes back for...'\nIndore: While there is not much known about Jasprit Bumrahs comeback, India captain Rohit Sharma provided a much-needed update on the premier pacer on Tuesday after India whitewashed New Zealand in the ODI series. Claiming that he is not too sure about Bumrah, Rohit admitted that he hopes the pacer is back for the last two Tests versus Australia.\nAlso Read:\nHighlights | India Vs New Zealand, 3rd ODI Score: IND Beat NZ By 90 Runs, Clean Sweep Series 3-0\nNot too sure about Bumrah, I am hoping he plays next (last) two Tests (against Australia), we dont want to take any risks with him as back injuries are always critical. We have a lot of cricket coming back after that also, Rohit said after the match against New Zealand on Tuesday.\nBumrah was added to the India squad for the ODIs versus Sri Lanka, but his name was withdrawn on the eve of the first game. Bumrah has not played international cricket since September last year.\nMeanwhile, India became the No. 1 ODI team in the latest ICC ranking after whitewashing NZ.\nEngland, who had gained the top spot merely three days back following New Zealands loss to India in the second ODI, are now in second position, with New Zealand slipping to the fourth spot.\nPrior to Tuesdays game, all three sides had been tied on 113 points, with their overall points the deciding differential.\nBut the latest result means that India are now first with 114 rating points, England sit at the second spot with 113 rating points, while Australia move up into third place with 112 rating points. The New Zealand team has 111 rating points.\nFor breaking news and live news updates, like us on Facebook or follow us on Twitter and Instagram. Read more on Latest                        Cricket News on India.com.\nTopics",
		"snippet": "Rohit Sharma Gives Update on Jasprit Bumrahs Team India Comeback Rohit Sharma Gives Update on Jasprit Bumrahs Team India Comeback Claiming that he is not too sure about Bumrah, Rohit admitted that he hopes the pacer is back for the last two <b>Tests</b> versus Australia.",
		"keywords": "",
		"language": "en",
		"isSafe": true,
		"datePublished": "2023-01-25T02:51:24",
		"provider": {
			"name": "india",
			"favIcon": "",
			"favIconBase64Encoding": ""
		},
		"image": {
			"url": "https://static.india.com/wp-content/uploads/2022/07/Collage-Maker-13-Jul-2022-04.11-PM.jpg",
			"height": 641,
			"width": 1200,
			"thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=1411861930594072320",
			"thumbnailHeight": 240,
			"thumbnailWidth": 449,
			"base64Encoding": null,
			"name": null,
			"title": null,
			"provider": {
				"name": "india",
				"favIcon": "",
				"favIconBase64Encoding": ""
			},
			"imageWebSearchUrl": null,
			"webpageUrl": "https://www.india.com/sports/ind-vs-aus-rohit-sharma-gives-update-on-jasprit-bumrahs-team-india-comeback-5868207/"
		}
	},
	{
		"id": "7516861785231835517",
		"title": "Cricket News Live Updates, January 25: Rohit Hoping Bumrah Will be Available For Australia Tests",
		"url": "https://www.news18.com/cricketnext/news/cricket-news-live-updates-live-score-latest-upcoming-full-matches-january-25-ipl-2023-india-schedule-livenews-6910147.html",
		"description": "A warm greeting toall our readers.",
		"body": "January 25, 2023, 08:00 IST\nNew Delhi, India\nAnother series, another win for India at home. (AP Photo)\nA warm greeting to all our readers. We will be bringing to you the live updates from the world of cricket as they happen. Stick with use for all the latest developments. Meanwhile, Indian men cricket teams excellent start to 2023 continues as they wrapped up another ODI series clean sweep when they beat New Zealand in the third match in Indore on Tuesday night. Having set a mammoth 386 to win, India bowled out their opponent for 295 in 41.2 overs to win by 90 runs and win the series 3-0.\nIndia captain Rohit Sharma said the aim in the third ODI for India was to test their bench strength. I thought in the last six\n07:49 IST\nA 3-0 Clean Sweep\nIndia have become the new world No. 1 in ODIs after completing a 3-0 clean sweep of New Zealand, who started the series at No. 1. At Holkar Stadium on Tuesday, India openers Shubman Gill and Rohit Sharma struck quick hundreds in stunning opening stand to set the base for 385/9. New Zealand were in the chase till the 32nd over when they lost their opener Devon Conway for 138 following which they were bowled out for 295.\n\nRead more\ngames we played we did most parts right and that is the key in 50-over games. We were consistent too. Without (Mohammed) Siraj and (Mohammed) Shami I knew we wanted to give chances to people on the bench. Wanted to get (Yuzvendra) Chahal and Umran (Malik) in the mix. We wanted to see how they react under pressure, he said at the post-match presentation.\nGet the latest",
		"snippet": "... captain Rohit Sharma said the aim in the third ODI for India was to <b>test</b> their bench strength. I thought in the last six 07:49 IST A 3-0 Clean Sweep ...",
		"keywords": "",
		"language": "en",
		"isSafe": true,
		"datePublished": "2023-01-25T02:30:38",
		"provider": {
			"name": "news18",
			"favIcon": "",
			"favIconBase64Encoding": ""
		},
		"image": {
			"url": "https://images.news18.com/ibnlive/uploads/2023/01/india-cricket-team-ap-8-167461286916x9.jpg",
			"height": 900,
			"width": 1600,
			"thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=7481301058245205730",
			"thumbnailHeight": 225,
			"thumbnailWidth": 400,
			"base64Encoding": null,
			"name": null,
			"title": null,
			"provider": {
				"name": "news18",
				"favIcon": "",
				"favIconBase64Encoding": ""
			},
			"imageWebSearchUrl": null,
			"webpageUrl": "https://www.news18.com/cricketnext/news/cricket-news-live-updates-live-score-latest-upcoming-full-matches-january-25-ipl-2023-india-schedule-livenews-6910147.html"
		}
	},
	{
		"id": "4673799526487142735",
		"title": "Test to detect pancreatic cancer in early stages now in human trials",
		"url": "https://www.sandiegouniontribune.com/business/story/2023-01-24/san-diego-companys-test-to-detect-pancreatic-cancer-in-early-stages-moves-to-human-trials",
		"description": "Biological Dynamics spent more than a decade validating cancer diagnostic process spun out of UC San Diego and now has launched a study for people at high risk of pancreatic cancer",
		"body": "For more than a decade, Biological Dynamics has been working on technology licensed out of UC San Diego to enable early detection of diseases ranging from cancer to tuberculous to Alzheimers. Now, that technology has matured to the point where the San Diego biotech firm is eyeing commercialization of its initial product  a lab-on-a-chip plasma test to uncover pancreatic cancer before its too late. The 76-employee company, which counts Qualcomm co-founder Irwin Jacobs as an investor and chairman of its board, has received regulatory clearance to begin enrolling high-risk patients in a clinical study to validate its lab-developed test for pancreatic cancer. When diagnosed in late stages, the disease has a five-year survival rate of less than 12 percent. We want to show in patients, particularly patients who have high risk, that we can improve the number of patients who are detected at the early, curable stage than the current standard of care, said Dr. Paul Billings, chief executive of Biological Dynamics. The clinical study is called ExoLuminate. It has one patient enrolled so far. The company expects to conduct the study at roughly 50 sites throughout the globe. Founded in 2009, Biological Dynamics has developed proprietary technology that repels red blood cells and platelets to exclusively isolate exosomes  which are tiny structures inside a cell that contain some of the cells proteins, DNA and RNA. The lab-on-a-chip then detects the concentration of a handful of individual bio-markers specific to pancreatic cancer. The technology, which can be tuned to pinpoint other diseases, came from well-known nano-engineering professor Mike Hellers lab at UC San Diego. There, researcher and Biological Dynamics founder Raj Krishnan, figured out how to use alternating current to ferret out very small bio-markers from blood and other liquid solutions. No one thought you could use alternation current to successfully isolate cells or other proteins  DNA or RNA  because the thought was the alternating current and charged molecules did something that would be toxic to either the cells or the proteins, said Billings. The company has raised $125 million since its founding to refine the technology. Biological Dynamics has 49 patents either granted or pending around its UCSD technology license. There are other early cancer detection tests available, most notably from Grail, which San Diego gene sequencing giant Illumina acquired last year for $7.1 billion. Grail claims to be able to detect 50 different types of cancer from a single blood draw. Anti-monopoly regulators in Europe and the U.S. have challenged Illuminas acquisition of Grail, with legal proceedings ongoing. Asked about competitors, Billings said Biological Dynamics expects the overall costs of using its technology to be less than gene sequencing methods. After the pancreatic cancer study, the company aims to expand into diagnosing other cancers, said Billings. Within the next 12 months, our plan is to commercialize the early pancreatic cancer test and to then begin a similar process for an early ovarian cancer test and an early lung cancer test as well, he said.",
		"snippet": "... Diego biotech firm is eyeing commercialization of its initial product a lab-on-a-chip plasma <b>test</b> to uncover pancreatic cancer before its too late.",
		"keywords": "",
		"language": "en",
		"isSafe": true,
		"datePublished": "2023-01-25T01:54:21.831",
		"provider": {
			"name": "sandiegouniontribune",
			"favIcon": "",
			"favIconBase64Encoding": ""
		},
		"image": {
			"url": "https://ca-times.brightspotcdn.com/dims4/default/21216c8/2147483647/strip/true/crop/1467x770+517+0/resize/1200x630!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fe9%2Fa4%2Fd6de5df34eb2b43b4711e2b13efa%2Fbiological-dynamics-verita-chip.jpg",
			"height": 630,
			"width": 1200,
			"thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=8583811968413806968",
			"thumbnailHeight": 236,
			"thumbnailWidth": 449,
			"base64Encoding": null,
			"name": null,
			"title": null,
			"provider": {
				"name": "sandiegouniontribune",
				"favIcon": "",
				"favIconBase64Encoding": ""
			},
			"imageWebSearchUrl": null,
			"webpageUrl": "https://www.sandiegouniontribune.com/business/story/2023-01-24/san-diego-companys-test-to-detect-pancreatic-cancer-in-early-stages-moves-to-human-trials"
		}
	},
	{
		"id": "8423588679653965050",
		"title": "'The Medical Team Will Give Him...': Rohit Sharma Gives a Major Update on Jasprit Bumrah's Recovery",
		"url": "https://www.news18.com/cricketnext/news/the-medical-team-will-give-him-rohit-sharma-gives-a-major-update-on-jasprit-bumrahs-recovery-6909649.html",
		"description": "Rohit Sharma said that the management will not rush to include Jasprit Bumrah as they don't want to take a risk regarding his injury.",
		"body": "Google News\nIndia captain Rohit Sharma revealed that the team management is in touch with the medical staff at NCA to get regular updates about Jasprit Bumrah and is hoping that the premier pacer gets in fit in time to play the last two Test matches against Australia. Bumrah was set to return to the Indian team with the Sri Lanka ODIs but he failed to recover in time from his back injury.\nBumrah, who hasnt played international cricket since September last year, failed to make the cut for the first two Tests against Australia.\nIndia vs New Zealand 3rd ODI Match Highlights\nThe Indian skipper said that the management will not rush to include Bumrah as they dont want to take a risk regarding his injury.\nNot too sure about Bumrah, I am hoping he plays next (last) two Tests (against Australia), we dont want to take any risks with him as back injuries are always critical. We have a lot of cricket coming back after that also,\" Rohit said here on Tuesday.\nWe are in constant touch with physios and doctors in NCA. The medical team will give him as much time as he wants,\" he added.\nThe India captain was speaking at the post-match press conference after leading India to a 3-0 ODI series sweep over visiting New Zealand here.\nBumrah began training in late November last year and then bowling by mid of December.\nAlso Read |\n3rd ODI: Centurions Shubman Gill, Rohit Sharma Star as India Complete 3-0 Whitewash Over New Zealand\nHe sustained a lower back stress fracture after the England tour as he missed the Asia Cup 2022 but then returned for the three-match T20I series where his injury aggravated further and he was ruled out of the crucial T20 World Cup.\nThe first match of the series will be played in Nagpur on February 9, while Arun Jaitley Stadium in New Delhi will host the second Test match of the series.\nThe four-match Test series is going to be very crucial for India to seal a place in World Test Championship final for the second consecutive time.\nThe last two Tests are scheduled to be held across the first two weeks of March.\nTo enhance the teams chances at the T20 World Cup last October-November, Bumrah was rushed to the T20 side during a home series against Australia, where he broke down once again and was ruled out for an indefinite period.\nGet the latest Cricket News,\nand  Cricket Live Scores  here\nAbout the Author",
		"snippet": "... regular updates about Jasprit Bumrah and is hoping that the premier pacer gets in fit in time to play the last two <b>Test</b> matches against Australia.",
		"keywords": "",
		"language": "en",
		"isSafe": true,
		"datePublished": "2023-01-25T01:43:53",
		"provider": {
			"name": "news18",
			"favIcon": "",
			"favIconBase64Encoding": ""
		},
		"image": {
			"url": "https://images.news18.com/ibnlive/uploads/2023/01/jasprit-bumrah-trent-1600-afp-167331755716x9.jpg",
			"height": 900,
			"width": 1600,
			"thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=6150726744208834822",
			"thumbnailHeight": 252,
			"thumbnailWidth": 448,
			"base64Encoding": null,
			"name": null,
			"title": null,
			"provider": {
				"name": "news18",
				"favIcon": "",
				"favIconBase64Encoding": ""
			},
			"imageWebSearchUrl": null,
			"webpageUrl": "https://www.news18.com/cricketnext/news/the-medical-team-will-give-him-rohit-sharma-gives-a-major-update-on-jasprit-bumrahs-recovery-6909649.html"
		}
	},
	{
		"id": "1917414667648338249",
		"title": "Jimmie Johnson runs first laps in Next Gen car at Phoenix test",
		"url": "https://nascar.nbcsports.com/2023/01/24/jimmie-johnson-runs-first-laps-in-next-gen-car-at-phoenix-test/",
		"description": "Jimmie Johnson tested at Phoenix to get acclimated with the Next Gen car. He discussed the test and his schedule for this year.",
		"body": "Comments\nSeven-time champion Jimmie Johnson ran his first laps in a Next Gen car Tuesday in a test at Phoenix Raceway and said the vehicle is dramatically different than what he was used to in the Cup Series.\nYou cannot drive these cars as sideways as the generation of cars that I drove due to the (tire) sidewall and also just the aero properties of the car, Johnson told reporters after he finished his one-day session.\nJohnson was allowed to test under NASCARs Select Driver Orientation Testing Rules. It limits a team to three sets of tires and how much data can be collected. The test is allowed to take part at a track that driver will not be entered.\nThis rule allowed former F1 champion Kimi Raikkonen to test a Cup car last year before competing for Trackhouse Racing at Watkins Glen in his first series start.\nJohnson tested in the car in its 2022 configuration. Six other cars tested Tuesday at Phoenix in 2023 configurations. Among the objectives of the NASCAR test for those six cars was to improve the racing primarily at short tracks and road courses. Johnson was not permitted to run with those cars.\nTuesday marked Johnsons first time in a Cup car still leaving the series after the 2020 season to compete in IndyCar.\n(I was) trying to work through it and find speed today, Johnson said of his goal for the test. The sim helped. I understood some big no-nos to do with where I put my hands, when I go to the throttle.  Ultimately, I wanted to get up against the limit today and get a feel for things.\nThe co-owner of Legacy M.C. said he felt good in the session.\nI think the fifth or sixth time by was my fastest time in the car, Johnson said. To be able to be on pace and be with the group that quick, it was nice just to have that to fall back on, and really, instinctively, drive the car instead of worrying about every little detail, and where I put the car and how I used the pedals and the wheel like Id been doing in IndyCar the past two years.\nEven with a session in a simulator last week, Johnson was thankful for some track time in the new car.\nSeat time is everything, he told reporters. Drivers, teams, you try to do what you can in the sim, but being at the track is where you learn everything.\nTo run a limited scheduled with (the No. 84 team) that is running a limited schedule, we need to keep our expectations realistic about the job ahead of us. Its a very competitive sport. A lot of great teams and drivers.\nI assume, as I continue to get more seat time in these cars, Ill understand where to find speed and continue to make myself more competitive.\nJust like riding a bike\nJanuary 24, 2023\nTuesday also marked Johnsons first day working with crew chief Todd Gordon at the track. The team announced this week that Gordon, a former Cup champion crew chief, would work with Johnson this season.\nTodd is a true professional, Johnson said. Clearly his stats speak for themself. Trying to find somebody to really help fit in with me and also help the organization. Todds a perfect candidate for that, so were very excited to have him on board.\n\nJohnson will seek to earn one of four open spots in the next months Daytona 500. He said he plans to run a handful of Cup races this season but likely wont have that schedule set until the coming weeks.\nJohnson remains hopeful hell be one of the drivers for the Garage 56 program that will take a specially prepared Cup car to the 24 Hours of Le Mans in June.\nJohnson did say that the door is probably shut on any IndyCar racing, meaning he wouldnt have the chance to compete in the Indianapolis 500 and Coca-Cola 600 on the same day this year.\nRead more about NASCAR",
		"snippet": "He discussed the <b>test</b> and his schedule for this year. Comments Seven-time ... a Next Gen car Tuesday in a <b>test</b> at Phoenix Raceway and said the vehicle is ...",
		"keywords": "",
		"language": "en",
		"isSafe": true,
		"datePublished": "2023-01-25T01:11:41",
		"provider": {
			"name": "nbcsports",
			"favIcon": "",
			"favIconBase64Encoding": ""
		},
		"image": {
			"url": "https://nascar.nbcsports.com/wp-content/uploads/sites/9/2023/01/GettyImages-1438986648-e1674608483832.jpg?w=200",
			"height": 112,
			"width": 200,
			"thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=6403007842176489160",
			"thumbnailHeight": 112,
			"thumbnailWidth": 200,
			"base64Encoding": null,
			"name": null,
			"title": null,
			"provider": {
				"name": "nbcsports",
				"favIcon": "",
				"favIconBase64Encoding": ""
			},
			"imageWebSearchUrl": null,
			"webpageUrl": "https://nascar.nbcsports.com/2023/01/24/jimmie-johnson-runs-first-laps-in-next-gen-car-at-phoenix-test/"
		}
	},
	{
		"id": "2321536360211442751",
		"title": "Cheteshwar Pujara Turns 35: Top Knocks Of The Batsman Who Made Test Batting Tempting In The Era Of T20 Cricket",
		"url": "https://www.cnbctv18.com/photos/sports/cheteshwar-pujara-birthday-top-knocks-in-test-t20-cricket-england-australia-sri-lanka-15742831.htm",
		"description": "India's Test batsman Cheteshwar Pujara is celebrating his 35th birthday today. While Pujara might have endured a tough patch in recent years, there is no denying that at his peak it was impossible to get his wicket. Like his hero, the current Indian coach Rahul Dravid, Pujara is also known to churn out long grinding Test knocks. As a cricket commentator once rightly said, As Harsha Bhogle says, \"It was wonderful to be part of the Rahul Dravid era; it is just as fun being part of the Pujara era.\". Like how Shane Warne made leg spin look sexy in the early 90s, Pujara is making Test batting appealing in the age of slam-bang cricket. With Pujara celebrating his birthday, here is a throwback to the top knocks of the batsman who made Test batting look tempting again",
		"body": "/\n12\n159 vs New Zealand, Hyderabad, August 2012 | Cheteshwar Pujara secured his first Test ton in August 2012. New Zealand had arrived in India to play two Tests and two T20Is. In the first Test in Hyderabad India batted first and was reduced to 49/1 when Pujara walked to the middle to take strike. Pujara then spent 468 minutes facing 306 balls as he notched his first Test hundred. Pujara's knock of 159 which was decorated with 19 fours and a six, coupled with Virat Kohli's 58 and MS Dhoni's 73 helped India to 438. The spin duo of R Ashwin and Pragyan Ojha then dismissed New Zealand on 159 and 164 in two successive innings as India wrapped up a clinical win by an inning and 115 runs. Although Ashwin won the Player of the Match award for his 12 wickets in the match, Pujara's maiden Test hundred played a pivotal role in the team's win. (Image: AP)\n2\n/\n12\n206* vs England, Ahemdabad, November 2012 | Not long after Purjara hit his first Test hundred, did he reach his maiden Test double ton. In the later months of 2012, England was on a tour of India to play four Tests, two T20Is, and 5 ODIs. The first Test was played in Ahemdabad. India batted first and Pujara playing at his favoured no.3 spot punished the English bowlers en route to his first double hundred. Pujara played a patient knock to test the English attack as he spent 513 minutes in the middle and faced 389 balls. The right-handed batsman hit 21 fours in his unbeaten knock of 206. On the back of Pujara's double-hundred and Virender Sehwag's run-a-ball 117 India piled up 521/8 in the first innings. England never came back into the contest as India rounded off a win by 9 wickets. The innings of 206* remains Pujara's highest Test score to date. (Image: Reuters)\n3\n/\n12\n204 vs Australia, Hyderabad, March 2013 | Pujara conquered Hyderabad's Rajiv Gandhi International Stadium for the second time in his career when he smashed the second double hundred of his Test career. In the second Test of the three-match Test series, Australia was reduced to just 237/9 in the first innings. In reply, India mounted 503 thanks to a hundred by opener Murali Vijay and a double century by Pujara. In another marathon effort, Pujara batted for 450 minutes, played 341 balls and scored 204 runs. Australia was then bowled out on just 131 in their second outing as India went 2-0 in the series. (Image: BCCI)\n4\n/\n12\n145 * vs Sri Lanka, Colombo, September 2015 | Cheteshwar Pujara was trusted as an opener in the third Test of the three-match series during India's tour of Sri Lanka in 2015. While Sri Lanka had claimed the opening Test, India bounced back to win the second match. With the fate of the series on the line, Pujara hammered an unbeaten 145 in India's first innings that helped the team to a total of 312 runs. Post Pujara's hundred Ishant Sharma and R Ashwin took care of Sri Lankan batters as India won the match by 117 runs and the series 2-1. (Image: AP)\n5\n/\n12\n202 vs Australia, Ranchi, March 2017 | Cheteshwar Pujara's third Test double hundred and second against Australia came in the summer of 2017. In the third Test of the four-match series played in Ranchi, Australia raced to 451 riding high on the tons by Steve Smith and Glenn Maxwell. India in a response posted 603/9 d. The chief architect of the Indian innings was Pujara who in a gritty display of batsmanship played 525 balls to grind out 202 runs. Although the match ended in a draw, Pujara for his batting walked away with the Player of the Match award. (Image: AP)\n6\n/\n12\n153 vs Sri Lanka, Galle, July 2017 | Sri Lanka was once again the victim of a stellar show by Cheteshwar Pujara in July 2017. In the opening Test of the three-match Test series Shikhar Dhawan's blistering 190 and Pujara's steady 153 paved the way for India to score 600 in the first innings. Sri Lanka was never able to compete after the two hundred as India won the match by a margin of 304 runs. Although Dhawan walked away with the Player of the Match award, Pujara's 153 was equally crucial in India's win. (Image: Reuters)\n7\n/\n12\n133 vs Sri Lanka, Colombo, July 2017 | Cheteshwar Pujara followed his 153 in Galle with a 133 in Colombo in the next Test. Continuing his good form Pujara struck 133 in 232 deliveries in India's first innings. Pujara was backed by Ajinkya Rahane who hit 132. Thanks to the hundreds by the two batsmen, India scored 622/9d. Sri Lanka made 183 and 386 in their two outings as India won the match by an inning and 53 runs. Although Ravindra Jadeja was the Player of the Match for his 7 wickets and unbeaten 70, Pujara's knock laid the foundation for India's win. (Image: AP)\n8\n/\n12\n143 vs Sri Lanka, Nagpur, November 2017 | Cheteshwar Pujara continued to dominate Sri Lankan bowlers in 2017 as he smashed his way to a third century against the Lankans in Nagpur in the latter part of the year. Sri Lankan arrived in India in the latter half of 2017 to play 3 Tests, 3 ODIs, and 3 T20Is. After the drawn first Test in Kolkata, the two teams moved to Nagpur for the next Test. Sri Lankan was skittled out on just 205. Then on a batting-friendly track, Virat Kohli slammed a double-hundred and Pujara, Murali Vijay and Rohit Sharma backed their captain by hitting centuries. Amid a double century and two other hundreds, Pujara's sturdy knock of 143 stood out. When Pujara was finally dismissed he walked back to a standing ovation. Needless to say, India won the match by an inning and 239 runs. (Image: AP)\n9\n/\n12\n132 vs England, Southampton, Sept 2012 | India played a forgettable four-match Test series away in England in 2018 but the series had some memorable performances by the Indian batsmen. One of those memorable performances was Pujrara's hundred in the 4th Test in Southampton. England scored only 246 in their first innings. Indian batsmen sans Pujara struggled against the English bowlers. Pujara was not fazed as he hit 132 in 257 balls. His lone efforts helped India to 273. Pujara's solo effort was not enough as England clinched the match by 60 runs. (Image: Reuters)\n10\n/\n12\n123 vs Australia, Adelaide, December 2018 | The 2018-19 Border-Gavaskar trophy between India and Australia remains Cheteshwar Pujara's pinnacle. The batsman kickstarted the series with a century in the first Test in Adelaide. Pujara slammed 123 in India's first innings and ended up contributing nearly 50% of the team's total as India was bowled out on 250. Pujara followed his 123 in the first innings with a 71 in the second innings as India won the Test by 71 runs. (Image: AP)\n11\n/\n12\n106 vs Australia, Melbourne, December 2018 | After returning with scores of 24 and 4 in the second Test in Perth, Pujara bounced back to hit his second century of the series in Melbourne. Giving support to an inexperienced opening pair of Hanuma Vihari and Mayank Agarwal, Pujara hit 106 in India's first innings. With the fifties from Agarwal, Virat Kohli, and Rohit Sharma India ended with a score of 443/7d. Indian bowlers took control after that as India clinched the match by 137 runs. (Image: Reuters)\n12",
		"snippet": "India's <b>Test</b> batsman Cheteshwar Pujara is celebrating his 35th birthday today. While Pujara might have endured a tough patch in recent years, there ...",
		"keywords": "",
		"language": "en",
		"isSafe": false,
		"datePublished": "2023-01-25T01:03:51",
		"provider": {
			"name": "cnbctv18",
			"favIcon": "",
			"favIconBase64Encoding": ""
		},
		"image": {
			"url": "https://images.cnbctv18.com/wp-content/uploads/2023/01/Cheteshwar-Pujara-cover-pic-1019x573.jpg",
			"height": 573,
			"width": 1019,
			"thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=3412391835578605038",
			"thumbnailHeight": 214,
			"thumbnailWidth": 380,
			"base64Encoding": null,
			"name": null,
			"title": null,
			"provider": {
				"name": "cnbctv18",
				"favIcon": "",
				"favIconBase64Encoding": ""
			},
			"imageWebSearchUrl": null,
			"webpageUrl": "https://www.cnbctv18.com/photos/sports/cheteshwar-pujara-birthday-top-knocks-in-test-t20-cricket-england-australia-sri-lanka-15742831.htm"
		}
	},
	{
		"id": "3580864287552855389",
		"title": "'Why is there a test to drive but not to decide fate of UK?'",
		"url": "https://metro.co.uk/2023/01/25/why-is-there-a-test-to-drive-but-not-to-decide-fate-of-uk-18157950/",
		"description": "The debate of whether or not we should take an IQ test before we are eligible to vote is still on Metro readers' minds.",
		"body": "Copy link\nWhats got readers talking? (Picture: Getty/Wales News Service/Rex/Shutterstock/Metro)\nThe topic of whether or not the electorate should take IQ tests before were eligible to vote is still occupying Metro readers minds.\nMeanwhile, others are discussing prime minister Rishi Sunak being caught out not wearing a seatbelt, and King Charless upcoming coronation.\nAlso a hot topic is whether smokers or vapers are more tolerated by non-smokers.\nRead on to see what else people are fuming about.\n Mike (\nMetroTalk, Mon\n) suggests voters should have to pass an IQ test because he was asked daft questions while a presiding officer at a polling station. Im struggling to disagree but the trouble is, where would you draw the pass line and who would agree with it?\nWe require qualifications to do our jobs and even to drive a car, but we need none to decide on a government. There should be a test on peoples comprehension of what government is and how different choices can decide a nations fate or fortunes. Pass the test and youre fit to vote, regardless of age or IQ. Ian, Croydon\n Perhaps a test to see whether the potential voter knows what an IQ test actually measures or a test on how the British democratic process works might be a good idea.  The IQ test measures only a certain type of mental ability  the ability to solve certain types of logic puzzles. A test based on the ability to complete crosswords is of equal validity.\nMany people who have scored above 100 on an IQ test could easily struggle to understand how economics or international trade works. They could also fail in understanding politics, history, classics or even some of the sciences, whereas some who would struggle with an IQ test could excel in other areas. I should know  I struggle with the type of logic that IQ tests work on and I have a masters degree. Nick, Manchester\nShould people have to take IQ tests before they cast their votes? (Picture: Getty)\n Instead of sneering about people who are unsure of the correct voting procedure, such as the Brexit referendum voter who asked what Remain meant, Mike from Stockport should instead be gratified that they actually turned up to cast their votes. Next hell be complaining about voter apathy. Tansy, Colchester\n One example of voter ignorance Mike gave related to a student being registered to vote at home as well as at university.\nHe said he explained to her that people must be registered in one place but she tried to convince him that many students were registered at both locations.\nAs a presiding officer, Mike should have been aware that university students can register at university and home addresses, although they can only vote in one location. Karen, Hornchurch\n Mike might be surprised to learn that when I was at university from 1971 to 1975, it was common for students to be registered automatically at their college while parents continued to register them at home.\nAt the time of the 1975 EEC referendum, I asked a couple of my lecturers which vote I should use. They replied both. I didnt use both but I wonder how many people did. Valerie, London\nBelow the belt to slam Rishi Sunak and not cyclists\nIs Rishi Sunak above the law? (Picture: Scott Heppell  WPA Pool/Getty)\n I feel that with all the problems this country has, the last thing we should be bothered about is Rishi Sunak not wearing a seatbelt (\n). If you argue that no one is above the law, what about all the cyclists running red lights across London? Nothing is done about them but they clearly cause more danger every single day. John, Bromley\nPeople not eating healthy food is a matter of choice, not money\n To Liz (\n), instead of focusing on the weight of an air passenger, increased pricing based on the amount of noise, dress code and unpleasant odours they emit would lead to better flights. Don, Braintree\n Sorry, Summer (\nMetroTalk, Mon\n) but your comment has forced me to write in. You say that to lower obesity levels, dont weigh air passengers but make healthy food more accessible and more affordable. What is the first section you see when you enter a supermarket? Answer: the fruit and veg section. Also, do you know much a kilo of carrots costs in Asda? Answer: 50p.\nIts not about making this food more affordable and accessible, its about putting effort into cooking. There are loads of online recipes for budget meals. People just need to put the effort in. Frank, Kent\nWoke-up call needed for coronation\n Stefan Badham (\nMetroTalk, Tue\n) says that with King Charless coronation celebrating refugees, multiculturalism and the NHS, it will be as cringeworthy as the woke opening ceremony for the 2012 London Olympics. Perhaps he would like to offer a definition of what he thinks woke means.\nIn most dictionaries, its defined as being alert to social injustices, especially those regarding race  which is a good thing. Unless, like many Conservatives, hes using it as a pejorative for things he doesnt like. Ash, Derby\nA reader thought the opening ceremony for the 2012 London Olympic Games was cringeworthy (Picture: Eddie Mulholland/REX/Shutterstock)\nKing Charles coronation will be celebrated this year (Picture: Chris Jackson  WPA Pool /Getty)\nAnd another thing\n I answered the door to someone who was exactly 3ft and 3in tall. I asked, Who are you? and he said, Im the meter man. Jeff, Nuneaton\n Regarding the butter debate in MetroTalk, some of us  me included  love to have butter on sandwiches. Especially chip butties and bacon sandwiches. And Im not a big, fat person either. Diane Webb, Wakefield\n I am not a smoker and have never touched a cigarette in my life but I must admit I prefer smokers to vapers. Smokers at least try to take into account other people. Vapers just continually emit huge clouds of smoke. Data is not yet available on the damage that vaping is doing to people and the planet, but I am sure it must impact both. Paul, London\nAre smokers more considerate than vapers? (Picture: Getty)\n I just wanted to say what a blessing it is to have Metro to read while travelling on public transport. I am unable to drive at the moment and reading Metro really brightens the bus journeys on these dark and dismal days. L Kelly, by email\n Since the pandemic we seem to have slipped into a parallel universe where everything looks familiar but nothing feels right. Alan Cheesman, Orpington\nStart a text with VIEWS followed by your comment, name and where you live to 65700. Standard network charge applies. Or email",
		"snippet": "The debate of whether or not we should take an IQ <b>test</b> before we are eligible to vote is still on Metro readers' minds. Copy link Whats got readers ...",
		"keywords": "",
		"language": "en",
		"isSafe": true,
		"datePublished": "2023-01-25T00:01:00",
		"provider": {
			"name": "metro",
			"favIcon": "",
			"favIconBase64Encoding": ""
		},
		"image": {
			"url": "https://metro.co.uk/wp-content/uploads/2023/01/SEI141522356-119e_1674587538.jpg?quality=90&#038;strip=all&#038;w=1200&#038;h=630&#038;crop=1",
			"height": 630,
			"width": 1200,
			"thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=4267861870821267404",
			"thumbnailHeight": 157,
			"thumbnailWidth": 299,
			"base64Encoding": null,
			"name": null,
			"title": null,
			"provider": {
				"name": "metro",
				"favIcon": "",
				"favIconBase64Encoding": ""
			},
			"imageWebSearchUrl": null,
			"webpageUrl": "https://metro.co.uk/2023/01/25/why-is-there-a-test-to-drive-but-not-to-decide-fate-of-uk-18157950/"
		}
	},
	{
		"id": "3019225748601674544",
		"title": "Man jailed for 130 years for murdering tourist released after fresh DNA test",
		"url": "https://www.irishexaminer.com/world/arid-41056349.html",
		"description": "Rolling coverage of the international stories of interest to our readers",
		"body": "\nA man jailed for kidnapping, sexually assaulting and murdering a woman visiting Hawaii has been released after more than 20 years after his lawyers presented new evidence and said he is innocent.\nAlbert Ian Schweitzer, who was convicted in 2000  the year after the killing  and sentenced to 130 years in prison, should be released from his shackles immediately, judge Peter Kubota ruled.\nThat prompted applause in the Hilo courtroom and hugs for Mr Schweitzer, who was flown to the Big Island for the hearing from the Arizona prison where he was serving his sentence.\nMy feelings were all over the place, Mr Schweitzer said about the moment of his release.\nNerves, anxiety, scared.\nAlbert Ian Schweitzer, left, hugs his mother, Linda, moments after a judge ordered him released from prison (Marco Garcia/The Innocence Project/AP)\nThe justice system is flawed, he said, calling himself one of many imprisoned for crimes they did not commit. He earlier told reporters he is grateful the judge did the honourable thing.\nA petition filed late on Monday outlined additional evidence in one of Hawaiis biggest murders, which unfolded on Christmas Eve in 1991 on the Big Island.\nDana Ireland, 23, was found barely alive in bushes along a fishing trail in Puna, a remote section of the island. She had been sexually assaulted and beaten and later died at Hilo Medical Centre.\nThe mangled bicycle she had been riding was found several miles away and appeared to have been hit by a vehicle.\nThe murder of the blonde-haired, blue-eyed visitor from Virginia gained national attention and remained unsolved for years, putting intense pressure on police to find the killer.\nWhenever you have a white, female victim  it gets a lot more attention than people of colour and Native Hawaiians, said Kenneth Lawson, co-director of the Hawaii Innocence Project.\nHawaii Innocence Project co-director Kenneth Lawson, left, and law student Skye Jansen go over files and photos related to the 1991 murder of Dana Ireland (Jennifer Sinco Kelleher/AP)\nThe parents, understandably, were becoming more and more infuriated.  There was insurmountable pressure to solve this case. And when that happens, mistakes are made. Some intentional and some unintentional.\nMs Irelands relatives could not immediately be reached for comment on the petition and Mr Schweitzers release. Prosecutors did not immediately comment on Mr Schweitzers release.\nWith help from the Innocence Project in New York, the co-counsel in the case, Mr Lawsons group represented Mr Schweitzer, the last of three Native Hawaiian men convicted over Ms Irelands death still in prison.\nDNA evidence previously submitted in the case belonged to an unknown man and all three convicted men were excluded as sources.\nNew DNA evidence, according to the petition, shows a Jimmy Z brand T-shirt found near Ms Ireland and soaked with her blood belonged to the same unknown man and not one of the three men, as prosecutors claimed.\nNew tyre tread analysis also concluded Mr Schweitzers Volkswagen Beetle car did not leave the tyre marks at either location where Ms Ireland and her bike were found.\nAlbert Ian Schweitzer in court in 2000 (W.M. Ing/Hawaii Tribune-Herald/AP)\nA forensic odontologist also concluded an injury on her left breast was not a bite mark as previously believed, the petition said.\nAt a new trial today, a jury would not convict Mr Schweitzer of Ms Irelands sexual assault and murder, the petition said.\nIn fact, a prosecutor would likely not even arrest Mr Schweitzer for this crime.\nThe likelihood all three men participated in a sexual attack and left no trace of biological evidence  including a lack of evidence uncovered with advanced forensic testing  is extraordinarily improbable, the petition said.\nIn 2019, Mr Schweitzers lawyers and Hawaii County prosecutors entered into a conviction integrity agreement to reinvestigate the case.\nIt was the first time in Hawaii there has been this type of agreement, Mr Lawson said, which is increasingly being used to reexamine questionable convictions and guard against future errors.\nAlbert Ian Schweitzer, left, looks on as Innocence Project lawyer Susan Freidman speaks (Marco Garcia/The Innocence Project/AP)\nOver the last three years, we have shared information and re-examined forensic evidence. No matter the outcome in these post-conviction proceedings, we remain committed to identifying unknown male number one and seeking justice for Dana Ireland and her `ohana, Hawaii County prosecuting attorney Kelden Waltjen said in a statement before the ruling, using the Hawaiian word for family.\nHowever, deputy prosecuting attorney Shannon Kagawa asked the judge to deny the petition, saying the new evidence would not change the outcome of a new trial.\nMr Kubota disagreed, saying that based on the new evidence, a jury would acquit Mr Schweitzer.\nMuch of the background on the case is detailed in a document filed with the petition listing facts defence lawyers and prosecutors have stipulated.\nIn 1994, police made what they believed to be a major breakthrough.\nA man facing charges for his role in a cocaine conspiracy contacted police and claimed his half-brother, Frank Pauline Jnr, witnessed the attack on Ms Ireland, according to the stipulated facts document.\nUniversity of Hawaii law school student Skye Jansen, left, and Hawaii Innocence Project co-director Kenneth Lawson pose with photos related to the 1991 murder of Dana Ireland (Jennifer Sinco Kelleher/AP)\nPolice interviewed Pauline Jnr, who was in his third month of a 10-year sentence for an unrelated sexual assault and theft.\nHe claimed brothers Ian and Shawn Schweitzer attacked and killed Ms Ireland. But he was interviewed at least seven times and gave inconsistent accounts each time, eventually incriminating himself, the stipulation document said.\nDespite a lack of evidence linking them to the killing, the two Schweitzers and Pauline were indicted in 1997.\nAt one point the charges were dismissed because all three men were excluded as the source of bodily fluid found on Ms Irelands body and a hospital bedsheet. They were indicted again after another informant claimed Ian Schweitzer confessed to him in jail that Pauline raped and killed Ms Ireland.\nPauline later said he offered details to police about Ms Irelands murder in order to get drug charges dropped against his half-brother.\nIn a prison interview with the A&E show American Justice, Pauline compared his story to the tale of the boy who cried wolf.\nInnocence Project co-founder and special counsel Barry Scheck speaks (Marco Garcia/The Innocence Project/AP)\nWasnt me, he said in a strong Hawaii Pidgin accent. But when he started telling the truth, he said no one believed him.\nShawn Schweitzer took a deal to plead guilty to manslaughter and kidnapping  and receive credit for about a year served and five years of probation  after seeing juries convict Pauline and his brother in 2000.\nIn October, Shawn Schweitzer met with prosecutors and reca",
		"snippet": "Rolling coverage of the international stories of interest to our readers.\nA man jailed for kidnapping, sexually assaulting and murdering a woman visiting Hawaii has been released after more than 20 years after his lawyers presented new evidence and said he is innocent.",
		"keywords": "",
		"language": "en",
		"isSafe": false,
		"datePublished": "2023-01-25T00:00:00",
		"provider": {
			"name": "irishexaminer",
			"favIcon": "",
			"favIconBase64Encoding": ""
		},
		"image": {
			"url": "https://www.irishexaminer.com/cms_media/module_img/6792/3396269_4_seoimageog_e391c96aa45147a1b4520d29db0a709b.jpg.jpg",
			"height": 630,
			"width": 1200,
			"thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=8496824221814919445",
			"thumbnailHeight": 157,
			"thumbnailWidth": 299,
			"base64Encoding": null,
			"name": null,
			"title": null,
			"provider": {
				"name": "irishexaminer",
				"favIcon": "",
				"favIconBase64Encoding": ""
			},
			"imageWebSearchUrl": null,
			"webpageUrl": "https://www.irishexaminer.com/world/arid-41056349.html"
		}
	},
	{
		"id": "7617072820624775381",
		"title": "GBP to USD Forecasts: PPI Input Numbers to Test Buyers at $1.2300",
		"url": "https://www.nasdaq.com/articles/gbp-to-usd-forecasts:-ppi-input-numbers-to-test-buyers-at-$1.2300",
		"description": "FXEmpire.com -",
		"body": "today, leaving investors to monitor chatter with the media.\nGBP/USD Price Action\nAt the time of writing, the Pound was down 0.07% to $1.23259. A mixed start to the day saw the GBP/USD rise to an early high of $1.23367 before falling to a low of $1.23110.\nGBPUSD 250123 Daily Chart\nTechnical Indicators\nThe Pound needs to move through the $1.2337 pivot to target the First Major Resistance Level (R1) at $1.2411 and the Tuesday high of $1.24134. A return to $1.24 would signal an extended breakout session.\nIn the event of an extended rally, the GBP to USD would likely test the Second Major Resistance Level (R2) at $1.2487. The Third Major Resistance Level sits at $1.2638.\nFailure to move through the pivot would leave the First Major Support Level (S1) at $1.2260 in play. However, barring a data-fueled sell-off, the GBP/USD should avoid sub-$1.2200 and the second Major Support Level (S2) at $1.2187.\nThe Third Major Support Level (S3) sits at $1.2036.\nGBPUSD 250123 1 Hourly Chart\nLooking at the EMAs and the 4-hourly chart, the EMAs send a bullish signal. The GBP/USD sits above the 50-day EMA, currently at $1.23034. The 50-day EMA pulled further away from the 100-day EMA, with the 100-day EMA widening from the 200-day EMA, delivering bullish signals.\nA hold above the 50-day EMA ($1.23034) would support a breakout from R1 ($1.2411) to target R2 ($1.2487) and $1.25. However, a fall through the 50-day EMA ($1.23034) would bring S1 $1.2260 and the 100-day EMA ($1.22390) into view. A fall through the 50-day EMA would send a bearish signal.\nGBPUSD 250123 4-Hourly Chart\nThe US Session\nIt is a quiet day ahead on the US economic calendar. There are no US economic indicators for investors to consider, leaving corporate earnings to influence market risk sentiment.\nBoeing (BA), IBM (IBM), and Tesla (TSLA) are among the big names releasing earnings results today.\nHowever, there are also FOMC members speaking today to influence, with the Fed having entered the blackout period on Saturday.\nThis article was originally posted on FX Empire\nMore From FXEMPIRE:",
		"snippet": "... the event of an extended rally, the GBP to USD would likely <b>test</b> the Second Major Resistance Level (R2) at $1.2487. The Third Major Resistance Level ...",
		"keywords": "",
		"language": "en",
		"isSafe": true,
		"datePublished": "2023-01-25T00:00:00",
		"provider": {
			"name": "nasdaq",
			"favIcon": "",
			"favIconBase64Encoding": ""
		},
		"image": {
			"url": "https://www.nasdaq.com/sites/acquia.prod/files/2019-05/0902-Q19%20Total%20Markets%20photos%20and%20gif_CC8.jpg",
			"height": 512,
			"width": 1024,
			"thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=1412367655541589588",
			"thumbnailHeight": 64,
			"thumbnailWidth": 128,
			"base64Encoding": null,
			"name": null,
			"title": null,
			"provider": {
				"name": "nasdaq",
				"favIcon": "",
				"favIconBase64Encoding": ""
			},
			"imageWebSearchUrl": null,
			"webpageUrl": "https://www.nasdaq.com/articles/gbp-to-usd-forecasts:-ppi-input-numbers-to-test-buyers-at-$1.2300"
		}
	},
	{
		"id": "7363649543138036644",
		"title": "Lockheed Martin says new F-16 test flight marks 'new era' for fighter jet",
		"url": "https://www.upi.com/Top_News/US/2023/01/24/lockheed-martin-f-16-block-70-first-flight/2221674597687/",
		"description": "Lockheed Martin tested its new, advanced F-16 Block 70 fighter jet Tuesday in Greenville, S.C.",
		"body": "",
		"snippet": "Lockheed Martin tested its new, advanced F-16 Block 70 fighter jet Tuesday in Greenville, S.C.",
		"keywords": "",
		"language": "en",
		"isSafe": true,
		"datePublished": "2023-01-24T23:11:15",
		"provider": {
			"name": "upi",
			"favIcon": "",
			"favIconBase64Encoding": ""
		},
		"image": {
			"url": "https://cdnph.upi.com/sv/ph/og/i/2221674597687/2023/1/16745978375992/v1.5/Lockheed-Martin-says-new-F-16-test-flight-marks-new-era-for-fighter-jet.jpg",
			"height": 798,
			"width": 1200,
			"thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=869980398673905579",
			"thumbnailHeight": 199,
			"thumbnailWidth": 299,
			"base64Encoding": null,
			"name": null,
			"title": null,
			"provider": {
				"name": "upi",
				"favIcon": "",
				"favIconBase64Encoding": ""
			},
			"imageWebSearchUrl": null,
			"webpageUrl": "https://www.upi.com/Top_News/US/2023/01/24/lockheed-martin-f-16-block-70-first-flight/2221674597687/"
		}
	},
	{
		"id": "8237716670257815783",
		"title": "Renshaw ready to face big Test from Ashwin",
		"url": "https://www.perthnow.com.au/sport/cricket/renshaw-ready-to-face-big-test-from-ashwin-c-9551810",
		"description": "Indian spinner Ravichandran Ashwin is a master at removing left-handers, but Matt Renshaw has prepared for the upcoming Test tour in interesting ways.",
		"body": "If Matt Renshaw gets a call-up to Australia's Test side on the upcoming tour of India, he says he will be as prepared as ever to take on spin maestro Ravichandran Ashwin.\nIn 2021 Ashwin became the first bowler in history to take 200 wickets against left-handed batsmen.\nThe 26-year-old Renshaw will tour with fellow top-six left-handers David Warner, Usman Khawaja and Travis Head. Wicketkeeper Alex Carey is also a lefty, so the challenges ahead are immense in the four-Test series that starts next month.\nRenshaw would play in the middle order if selected for the current side. When Australia toured India in 2017, he played all but one innings of the four Tests as an opener.\nAshwin got him out just once, in the first Test at Pune, but not before the Aussie had top-scored with 68.\n\"Ashwin is difficult to face. He is a smart bowler with a lot of variations and he uses them very well, but you do get used to him once you've faced him for a while,\" Renshaw told AAP.\n\"I think the big challenge from Ashwin and any off-spinner in spinning conditions to a left-hander is the lbw threat.\n\"Obviously everyone thinks about the one that turns and gets you caught at slip, but the big one is the lbw when it doesn't spin. You just have to be ready for that one.\n\"I think two years batting at No.5 helped me with facing spin. I know my game a lot better now and I am a lot more comfortable in different situations.\n\"We have a strong squad and it is going to be hard to push my way in, but I know that I will be ready if I do get a chance.\"\nRenshaw is still part of the Brisbane Heat's BBL campaign and has been preparing for India by having the spinners in his team, such as Mitch Swepson, Matt Kuhnemann and even Marnus Labuschagne, bowl the Sanspareil Greenlands (SG) ball at him that is used in Test cricket in India.\n\"The SG ball is a bit different, so we are just trying to prepare as well as we can during this BBL schedule if we get a window to hit red balls,\" Renshaw said.\n\"It is a lot different conditions in India, so we are trying to replicate them as much as we can.\n\"The plan was if (the Heat) got knocked out we'd do some prep with the (Australian) team in Sydney, but we just kept winning and are in the (BBL) finals now.\n\"We have got a good week and a bit in India before the first Test, so there will be plenty of time to prepare there as well.\"\nRenshaw returned to the Test team this month in Sydney against South Africa to replace the injured Cameron Green after previously playing in that format in 2018.\nHe did so on the back of strong form in first-class cricket.\nThe new father to baby daughter Charlotte has observed close friend and teammate Khawaja's mindset towards his cricket and has learned to enjoy the moment, rather than worry about selections.\n\"I am feeling good with my cricket. I am just rolling with any punches and enjoying myself,\" Renshaw said.\nShare to Facebook",
		"snippet": "... spinner Ravichandran Ashwin is a master at removing left-handers, but Matt Renshaw has prepared for the upcoming <b>Test</b> tour in interesting ways.",
		"keywords": "",
		"language": "en",
		"isSafe": false,
		"datePublished": "2023-01-24T23:02:23",
		"provider": {
			"name": "perthnow",
			"favIcon": "",
			"favIconBase64Encoding": ""
		},
		"image": {
			"url": "https://images.perthnow.com.au/publication/C-9551810/987c73d0f14b2998403b226e6393f8ef9340d49d-16x9-x0y0w1280h720.jpg?imwidth=1200",
			"height": 675,
			"width": 1200,
			"thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=1494983352242244666",
			"thumbnailHeight": 168,
			"thumbnailWidth": 298,
			"base64Encoding": null,
			"name": null,
			"title": null,
			"provider": {
				"name": "perthnow",
				"favIcon": "",
				"favIconBase64Encoding": ""
			},
			"imageWebSearchUrl": null,
			"webpageUrl": "https://www.perthnow.com.au/sport/cricket/renshaw-ready-to-face-big-test-from-ashwin-c-9551810"
		}
	},
	{
		"id": "5823044128825143019",
		"title": "India Tour: Matt Renshaw ready to face big Test from world-class Ravi Ashwin",
		"url": "https://thewest.com.au/sport/australian-cricket-team/renshaw-ready-to-face-big-test-from-ashwin-c-9551809",
		"description": "Indian spinner Ravichandran Ashwin is a master at removing left-handers, but Matt Renshaw has prepared for the upcoming Test tour in interesting ways.",
		"body": "Email Us\nCopy the Link\nIf Matt Renshaw gets a call-up to Australias Test side on the upcoming tour of India, he says he will be as prepared as ever to take on spin maestro Ravichandran Ashwin.\nIn 2021 Ashwin became the first bowler in history to take 200 wickets against left-handed batsmen.\nThe 26-year-old Renshaw will tour with fellow top-six left-handers David Warner, Usman Khawaja and Travis Head. Wicketkeeper Alex Carey is also a lefty, so the challenges ahead are immense in the four-Test series that starts next month.\nRenshaw would play in the middle order if selected for the current side. When Australia toured India in 2017, he played all but one innings of the four Tests as an opener.",
		"snippet": "... spinner Ravichandran Ashwin is a master at removing left-handers, but Matt Renshaw has prepared for the upcoming <b>Test</b> tour in interesting ways.",
		"keywords": "",
		"language": "en",
		"isSafe": true,
		"datePublished": "2023-01-24T23:02:23",
		"provider": {
			"name": "thewest",
			"favIcon": "",
			"favIconBase64Encoding": ""
		},
		"image": {
			"url": "https://images.thewest.com.au/publication/C-9551809/4fa6ecb300641c08496594f8cf9cd64c4152c26d-16x9-x227y71w2362h1329.jpg?imwidth=1200",
			"height": 675,
			"width": 1199,
			"thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=683314368246880789",
			"thumbnailHeight": 168,
			"thumbnailWidth": 298,
			"base64Encoding": null,
			"name": null,
			"title": null,
			"provider": {
				"name": "thewest",
				"favIcon": "",
				"favIconBase64Encoding": ""
			},
			"imageWebSearchUrl": null,
			"webpageUrl": "https://thewest.com.au/sport/australian-cricket-team/renshaw-ready-to-face-big-test-from-ashwin-c-9551809"
		}
	},
	{
		"id": "5607163599655984865",
		"title": "Gillespie backs Aussies for India success",
		"url": "https://thewest.com.au/sport/cricket/gillespie-backs-aussies-for-india-success-c-9551694",
		"description": "Jason Gillespie, who starred on Australia's last successful Test tour of India, believes Pat Cummins' team can secure a drought-breaking series win",
		"body": "Email Us\nCopy the Link\nFormer champion Australia quick Jason Gillespie believes Pat Cummins' team is ideally placed to secure a drought-breaking Test series win in India.\nAfter breaking through for their first Test series triumph on Indian soil in 35 years in 2004, Australia have won just one red-ball match there since.\nGillespie, who starred with 20 wickets in four Tests when Australia triumphed 2-1 19 years ago, said the current crop had what it takes.\n\"Let's be honest, for this group of Australian players, this could be a career-defining tour,\" the Adelaide Strikers coach said after their BBL season ended on Tuesday.\n\"All us cricket tragics and fans should be pretty excited about this group of players, I know I'm excited as a cricket fan to see what this group of players can achieve in India.\n\"Obviously we've got Alex (Carey) and Travis (Head) being part of that hoping they can be part of history because I think we've got an opportunity to do just that.\"\nGillespie also toured India in 2001 when the hosts won a memorable series 2-1, winning an iconic Test in Calcutta after famously being forced to follow-on.\nHe admits \"egos\" got in the way of that tour, but they learned their lesson three years later.\n\"In '04, as a bowling group, we put our egos away,\" Gillespie said.\n\"I remember in '01 we still went over there thinking we could follow the Australian line and length and get away with that and we'll just roll them over.\n\"We thought about it long and hard and reflected on it and decided we needed to just put our egos away and play sub-continent-style cricket and and we did that and had success.\"\nGillespie applauded Australia for how they played in Pakistan last March when they won a tense and gruelling series 1-0.\n\"Their goal was to win on day 15 of the series and I thought the way they went about it was just fantastic and there's no reason why they can't do it in India,\" he said.\n\"India can be is a challenge but you've got to have a really positive attitude and believe that you can have an impact and more often than not, you can.\"\nThe first Test gets underway in Nagpur, where Gillespie had match figures of 9-70 as Australia won to clinch the series in 2004, on February 9.",
		"snippet": "... starred on Australia's last successful <b>Test</b> tour of India, believes Pat ... ideally placed to secure a drought-breaking <b>Test</b> series win in India.",
		"keywords": "",
		"language": "en",
		"isSafe": true,
		"datePublished": "2023-01-24T22:56:08",
		"provider": {
			"name": "thewest",
			"favIcon": "",
			"favIconBase64Encoding": ""
		},
		"image": {
			"url": "https://images.thewest.com.au/publication/C-9551694/e57ce2e81ccd3d36cca13ac1ffd6aea7907d3372-16x9-x0y0w1280h720.jpg?imwidth=1200",
			"height": 675,
			"width": 1200,
			"thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=6089892403357314140",
			"thumbnailHeight": 147,
			"thumbnailWidth": 261,
			"base64Encoding": null,
			"name": null,
			"title": null,
			"provider": {
				"name": "thewest",
				"favIcon": "",
				"favIconBase64Encoding": ""
			},
			"imageWebSearchUrl": null,
			"webpageUrl": "https://thewest.com.au/sport/cricket/gillespie-backs-aussies-for-india-success-c-9551694"
		}
	},
	{
		"id": "765715743442053963",
		"title": "Gillespie backs Aussies for India success",
		"url": "https://www.perthnow.com.au/sport/cricket/gillespie-backs-aussies-for-india-success-c-9551691",
		"description": "Jason Gillespie, who starred on Australia's last successful Test tour of India, believes Pat Cummins' team can secure a drought-breaking series win",
		"body": "Cricket\nFormer champion Australia quick Jason Gillespie believes Pat Cummins' team is ideally placed to secure a drought-breaking Test series win in India.\nAfter breaking through for their first Test series triumph on Indian soil in 35 years in 2004, Australia have won just one red-ball match there since.\nGillespie, who starred with 20 wickets in four Tests when Australia triumphed 2-1 19 years ago, said the current crop had what it takes.\n\"Let's be honest, for this group of Australian players, this could be a career-defining tour,\" the Adelaide Strikers coach said after their BBL season ended on Tuesday.\n\"All us cricket tragics and fans should be pretty excited about this group of players, I know I'm excited as a cricket fan to see what this group of players can achieve in India.\n\"Obviously we've got Alex (Carey) and Travis (Head) being part of that hoping they can be part of history because I think we've got an opportunity to do just that.\"\nGillespie also toured India in 2001 when the hosts won a memorable series 2-1, winning an iconic Test in Calcutta after famously being forced to follow-on.\nHe admits \"egos\" got in the way of that tour, but they learned their lesson three years later.\n\"In '04, as a bowling group, we put our egos away,\" Gillespie said.\n\"I remember in '01 we still went over there thinking we could follow the Australian line and length and get away with that and we'll just roll them over.\n\"We thought about it long and hard and reflected on it and decided we needed to just put our egos away and play sub-continent-style cricket and and we did that and had success.\"\nGillespie applauded Australia for how they played in Pakistan last March when they won a tense and gruelling series 1-0.\n\"Their goal was to win on day 15 of the series and I thought the way they went about it was just fantastic and there's no reason why they can't do it in India,\" he said.\n\"India can be is a challenge but you've got to have a really positive attitude and believe that you can have an impact and more often than not, you can.\"\nThe first Test gets underway in Nagpur, where Gillespie had match figures of 9-70 as Australia won to clinch the series in 2004, on February 9.\nShare to Facebook",
		"snippet": "... starred on Australia's last successful <b>Test</b> tour of India, believes Pat ... ideally placed to secure a drought-breaking <b>Test</b> series win in India.",
		"keywords": "",
		"language": "en",
		"isSafe": true,
		"datePublished": "2023-01-24T22:56:08",
		"provider": {
			"name": "perthnow",
			"favIcon": "",
			"favIconBase64Encoding": ""
		},
		"image": {
			"url": "https://images.perthnow.com.au/publication/C-9551691/e57ce2e81ccd3d36cca13ac1ffd6aea7907d3372-16x9-x0y0w1280h720.jpg?imwidth=1200",
			"height": 675,
			"width": 1200,
			"thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=339488725128470346",
			"thumbnailHeight": 147,
			"thumbnailWidth": 261,
			"base64Encoding": null,
			"name": null,
			"title": null,
			"provider": {
				"name": "perthnow",
				"favIcon": "",
				"favIconBase64Encoding": ""
			},
			"imageWebSearchUrl": null,
			"webpageUrl": "https://www.perthnow.com.au/sport/cricket/gillespie-backs-aussies-for-india-success-c-9551691"
		}
	},
	{
		"id": "5769761024757500988",
		"title": "Jason Gillespie says careers could be made by Aussie success in India",
		"url": "https://thewest.com.au/news/jason-gillespie-says-careers-could-be-made-by-aussie-success-in-india-c-9551062",
		"description": "Jason Gillespie knows what it takes to win a Test series in India and has some words of advice for the current Australian players.",
		"body": "Email Us\nCopy the Link\nFormer champion Australian fast bowler Jason Gillespie has turned up the pressure dial ahead of the upcoming tour of India declaring it could be career-defining for the current crop of players.\nGillespie was part of the last successful tour of India in late 2004, which saw Australia win the Test series 2-1, and was the Aussies leading wicket-taker on that tour with 20 scalps at 16.15.\nIt remains the only tour of India in which Australia have triumphed in 10 attempts since the summer of 1969-70, but Gillespie believes Pat Cummins men have a great chance of creating history in the next couple of months.\nI think all us cricket tragics and fans should be pretty excited about this group of players, I know Im excited as a cricket fan to see what this group of players can achieve in India, Gillespie said.\nBut Gillespie warned that one of the keys to success for the Aussies will be the bowling attack keeping their egos in check.\nBack in 04 we, as a bowling group, put our egos away, said Gillespie, who is Australias ninth-greatest Test wicket-taker for Australia.\nI remember in 01, we still went over there thinking we could bowl the Australian line and length and get away with that and well just roll them over.\nCamera Icon\n29/10/2004. The Australian team celebrate their test and series win. Shane Warne and Jason Gillespie make an interesting pair. Australia v India Test Cricket at Nagpur.\nCredit:\nNews Corp Australia\nIn 04 we thought about it long and hard and reflected on it and decided we needed to just put our egos away and play subcontinent-style cricket and we did that and we had a bit of success with three quicks and The King (Shane Warne) bowing with some help from Pup (Michael) Clarke and Boof (Darren) Lehmann.\nSo whichever way the Australian team go, I think adaptability and situation awareness is going to be absolutely crucial and backing your skills, backing your fitness is key on the subcontinent, because its hot, its humid, its uncomfortable, its foreign conditions  youve got to bank on your fitness and strength of mind will take games deep.\nI love what Australia did in Pakistan (last year), their goal was to win on day 15 of the (three-match) Test series and I thought the way they went about it was fantastic, and theres no reason why they cant do it India. I think theyve got the cattle, theyve got the fuel, theyve got the ammo, theyre already to go I reckon.\nBut Gillespie stressed it was important that Australia didnt lapse into a false sense of security just because they beat Pakistan 1-0 on their home soil last year in similar conditions to what theyll confront in India.\nIts subcontinental conditions, but they are different, and Pakistan players play the conditions slightly different to India players, Gillespie said.\nSpeaking to Nathan Lyon ... he talked about the difference between bowling to Pakistan batsmen and Indian batsmen is Indian batsmen dont tend to sweep, whereas Pakistan batsmen will just pull out the broom  so thats a challenge for him as a spin bowler.\nBut I think the quicks will get a little more assistance off the surface in India than they will in Pakistan. Pakistan is a really tough place to bowl for a fast bowler.\nIndia is a challenge but youve got to have a real positive attitude and believe that you can have an impact and more often than not quicks can have a real impact in India, theyve just got to believe it up here (in the mind).\nAnd Gillespie, who coaches the Adelaide Strikers, believes a couple of his players in Alex Carey and Travis Head will have a big say in Australias chances against India.\nI think hes in a wonderful sweet spot of his career, Gillespie said of Carey.\nHes playing some great cricket with the bat, hes keeping very well.\nWeve got Alex and Trav being part of that hoping they can be part of history, because I think weve got an opportunity to do just that and I think Kez (Carey) is going to be a central figure in that and I think Travis will play a huge role as well.\nOriginally published as",
		"snippet": "Jason Gillespie knows what it takes to win a <b>Test</b> series in India and has some words of advice for the current Australian players. Email Us Copy the ...",
		"keywords": "",
		"language": "en",
		"isSafe": true,
		"datePublished": "2023-01-24T21:35:55",
		"provider": {
			"name": "thewest",
			"favIcon": "",
			"favIconBase64Encoding": ""
		},
		"image": {
			"url": "https://images.thewest.com.au/publication/C-9551062/2c43612ef3e1b8e3544da75bbcd0f2ef91a7e052-16x9-x0y771w2000h1125.jpg?imwidth=1200",
			"height": 675,
			"width": 1200,
			"thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=3954904611038619680",
			"thumbnailHeight": 168,
			"thumbnailWidth": 298,
			"base64Encoding": null,
			"name": null,
			"title": null,
			"provider": {
				"name": "thewest",
				"favIcon": "",
				"favIconBase64Encoding": ""
			},
			"imageWebSearchUrl": null,
			"webpageUrl": "https://thewest.com.au/news/jason-gillespie-says-careers-could-be-made-by-aussie-success-in-india-c-9551062"
		}
	},
	{
		"id": "488145690699961642",
		"title": "NASA to test nuclear rocket engine for possible Mars missions",
		"url": "https://www.kq2.com/news/nasa-to-test-nuclear-rocket-engine-for-possible-mars-missions/article_9df59c83-5df9-58c1-934e-3e3382c2c68d.html",
		"description": "A nuclear thermal rocket engine in development could one day transport humans to Mars.",
		"body": "Save\nA nuclear thermal rocket engine in development could one day transport humans to Mars.\nThe Defense Advanced Research Projects Agency, a research arm of the US Department of Defense, and NASA are setting their sights on a type of rocket engine that could be the holy grail for quickly and safely getting humans to the red planet. The first tests could occur as soon as 2027, according to a Tuesday news release from the space agency.\n\"DARPA and NASA have a long history of fruitful collaboration in advancing technologies for our respective goals, from the Saturn V rocket that took humans to the Moon for the first time to robotic servicing and refueling of satellites,\" DARPA director Dr. Stefanie Tompkins said in a statement. \"The space domain is critical to modern commerce, scientific discovery, and national security.\"\nThe US military and NASA sought to develop this type of technology in the mid-20th century, but the program stalled. Now, the initiative is gaining new traction in the modern era as the Demonstration Rocket for Agile Cislunar Operations, or DRACO, program.\nResearch into nuclear thermal rocket engines by NASA began in 1959. A key program in the 1960s, called the Nuclear Engine for Rocket Vehicle Application, even sought to demonstrate the technology in space  but that never came to fruition.\n\"Funding for NERVA, however, decreased in the late 1960s and the program was cancelled in 1973 before any flight tests of the engine took place,\" according to the space agency's website.\nThese days, NASA has renewed interest in sending humans to the red planet. The space agency's Artemis program, which had its inaugural uncrewed test flight to the moon last year, directs the space agency to return humans to the lunar surface as a stepping stone for eventually putting the first humans on Mars.\n\"Recent aerospace materials and engineering advancements are enabling a new era for space nuclear technology, and this flight demonstration will be a major achievement toward establishing a space transportation capability for an Earth-Moon economy,\" Jim Reuter, associate administrator for NASA's Space Technology Mission Directorate, said in a statement.\nPowerful nuclear thermal engines\nAs its name implies, nuclear thermal engines would rely on a nuclear reactor, using a process called atomic fission  in which a neutron slams into an atom to rip it apart, setting off a powerful chain reaction  to heat up propellant and provide the thrust needed to propel a rocket through space. (The nuclear fission process is better known in the public consciousness for its role in energy production, and NASA previously signed a deal with the US Department of Energy to research its applications for space travel.)\nThat process, according to NASA, is three or more times more efficient than the chemical propulsion used by the rockets currently in operation, in which an explosive fuel is mixed with an oxidizer to create a fiery blaze of thrust. The more efficient nuclear process, NASA said, could allow spacecraft to traverse the 140 million-mile (225 million-kilometer) average distance between the Earth and Mars far more quickly than is possible today, greatly reducing the amount of time astronauts are exposed to dangerous levels of radiation on future deep-space missions.\nUnder the agreement with DARPA  which is perhaps best known for its role in laying the groundwork for the internet  NASA will lead the technological development of the new engine. DARPA will design an experimental spacecraft, as well as lead the overall program, according to the contract.\nThe-CNN-Wire\n &  2023 Cable News Network, Inc., a Warner Bros. Discovery Company. All rights reserved.\nFacebook\nJan 19, 2022\nNews",
		"snippet": "The space agency's Artemis program, which had its inaugural uncrewed <b>test</b> flight to the moon last year, directs the space agency to return humans to ...",
		"keywords": "",
		"language": "en",
		"isSafe": true,
		"datePublished": "2023-01-24T21:34:28",
		"provider": {
			"name": "kq2",
			"favIcon": "",
			"favIconBase64Encoding": ""
		},
		"image": {
			"url": "https://bloximages.newyork1.vip.townnews.com/kq2.com/content/tncms/assets/v3/editorial/8/c9/8c9480eb-f096-59e6-b77d-014bae74f414/63d0506db2cc5.image.jpg?crop=1600%2C840%2C0%2C29&amp;resize=1200%2C630&amp;order=crop%2Cresize",
			"height": 840,
			"width": 1600,
			"thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=3309496110220885188",
			"thumbnailHeight": 210,
			"thumbnailWidth": 400,
			"base64Encoding": null,
			"name": null,
			"title": null,
			"provider": {
				"name": "kq2",
				"favIcon": "",
				"favIconBase64Encoding": ""
			},
			"imageWebSearchUrl": null,
			"webpageUrl": "https://www.kq2.com/news/nasa-to-test-nuclear-rocket-engine-for-possible-mars-missions/article_9df59c83-5df9-58c1-934e-3e3382c2c68d.html"
		}
	},
	{
		"id": "7148413036719149855",
		"title": "NASA to test nuclear thermal rocket engine for the first time in 50 years",
		"url": "https://www.kitv.com/news/national/nasa-to-test-nuclear-thermal-rocket-engine-for-the-first-time-in-50-years/article_08707ee9-c0b8-58a0-b22f-baa0e7ba7b34.html",
		"description": "A nuclear thermal rocket engine in development could one day transport humans to Mars.",
		"body": "Save\nA nuclear thermal rocket engine in development could one day transport humans to Mars.\nThe Defense Advanced Research Projects Agency, a research arm of the US Department of Defense, and NASA are setting their sights on a type of rocket engine that could be the holy grail for quickly and safely getting humans to the red planet. The first tests could occur as soon as 2027, according to a Tuesday news release from the space agency.\n\"DARPA and NASA have a long history of fruitful collaboration in advancing technologies for our respective goals, from the Saturn V rocket that took humans to the Moon for the first time to robotic servicing and refueling of satellites,\" DARPA director Dr. Stefanie Tompkins said in a statement. \"The space domain is critical to modern commerce, scientific discovery, and national security.\"\nThe US military and NASA sought to develop this type of technology in the mid-20th century, but the program stalled. Now, the initiative is gaining new traction in the modern era as the Demonstration Rocket for Agile Cislunar Operations, or DRACO, program.\nResearch into nuclear thermal rocket engines by NASA began in 1959. A key program in the 1960s, called the Nuclear Engine for Rocket Vehicle Application, even sought to demonstrate the technology in space  but that never came to fruition.\n\"Funding for NERVA, however, decreased in the late 1960s and the program was cancelled in 1973 before any flight tests of the engine took place,\" according to the space agency's website.\nThese days, NASA has renewed interest in sending humans to the red planet. The space agency's Artemis program, which had its inaugural uncrewed test flight to the moon last year, directs the space agency to return humans to the lunar surface as a stepping stone for eventually putting the first humans on Mars.\n\"Recent aerospace materials and engineering advancements are enabling a new era for space nuclear technology, and this flight demonstration will be a major achievement toward establishing a space transportation capability for an Earth-Moon economy,\" Jim Reuter, associate administrator for NASA's Space Technology Mission Directorate, said in a statement.\nPowerful nuclear thermal engines\nAs the name implies, a nuclear thermal engine would rely on a nuclear reactor, using a process called atomic fission  in which a neutron slams into an atom to rip it apart, setting off a powerful chain reaction  to heat up propellant and provide the thrust needed to propel a rocket through space. (The nuclear fission process is better known in the public consciousness for its role in energy production, and NASA previously signed a deal with the US Department of Energy to research its applications for space travel.)\nThat process, according to NASA, is three or more times more efficient than the chemical propulsion used by the rockets currently in operation, in which an explosive fuel is mixed with an oxidizer to create a fiery blaze of thrust. The more efficient nuclear process, NASA said, could allow spacecraft to traverse the 140 million-mile (225 million-kilometer) average distance between the Earth and Mars far more quickly than is possible today, greatly reducing the amount of time astronauts are exposed to dangerous levels of radiation on future deep-space missions.\nUnder the agreement with DARPA  which is perhaps best known for its role in laying the groundwork for the internet  NASA will lead the technological development of the new engine. DARPA will design an experimental spacecraft, as well as lead the overall program, according to the contract.\nThe-CNN-Wire\n &  2023 Cable News Network, Inc., a Warner Bros. Discovery Company. All rights reserved.\nFacebook",
		"snippet": "The space agency's Artemis program, which had its inaugural uncrewed <b>test</b> flight to the moon last year, directs the space agency to return humans to ...",
		"keywords": "",
		"language": "en",
		"isSafe": true,
		"datePublished": "2023-01-24T21:34:28",
		"provider": {
			"name": "kitv",
			"favIcon": "",
			"favIconBase64Encoding": ""
		},
		"image": {
			"url": "https://bloximages.newyork1.vip.townnews.com/kitv.com/content/tncms/assets/v3/editorial/e/97/e971e548-94d0-51d9-9cc7-3374f1c67ac8/63d05d362db28.image.jpg?crop=1600%2C840%2C0%2C29&amp;resize=1200%2C630&amp;order=crop%2Cresize",
			"height": 840,
			"width": 1600,
			"thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=5321750989026811483",
			"thumbnailHeight": 210,
			"thumbnailWidth": 400,
			"base64Encoding": null,
			"name": null,
			"title": null,
			"provider": {
				"name": "kitv",
				"favIcon": "",
				"favIconBase64Encoding": ""
			},
			"imageWebSearchUrl": null,
			"webpageUrl": "https://www.kitv.com/news/national/nasa-to-test-nuclear-thermal-rocket-engine-for-the-first-time-in-50-years/article_08707ee9-c0b8-58a0-b22f-baa0e7ba7b34.html"
		}
	},
	{
		"id": "4433472735277838863",
		"title": "Australian Test great Jason Gillespie says Indian tour can be career defining.",
		"url": "https://www.skynews.com.au/breaking-news/jason-gillespie-says-careers-could-be-made-by-aussie-success-in-india/news-story/c6f01aa7c79b86d83688f82650eed784",
		"description": "Former champion Australian fast bowler Jason Gillespie has turned up the pressure ahead of the upcoming tour of India, declaring it could be career-defining for the current crop of national players.",
		"body": "January 25, 2023 - 1:49PM\nNCA NewsWire\nFormer champion Australian fast bowler Jason Gillespie has turned up the pressure ahead of the upcoming tour of India, declaring it could be career-defining for the current crop of national players.\nGillespie was part of the last successful tour of India in late 2004 when Australia won the Test series 2-1 and was the Aussies leading wicket-taker on that tour with 20 scalps at 16.15.\nIt remains the only tour of India in which Australia has triumphed in 10 attempts since the summer of 1969-70, but Gillespie believes Pat Cummins men have a great chance of creating history in the next couple of months.\nI think all us cricket tragics and fans should be pretty excited about this group of players; I know Im excited as a cricket fan to see what this group can achieve in India, Gillespie said.\nBut Gillespie warned one of the keys to success for the Aussies will be the bowling attack keeping their egos in check.\nBack in 2004 we, as a bowling group, put our egos away, said Gillespie, who is Australias ninth-greatest Test wicket-taker.\nI remember in 2001, we still went over there thinking we could bowl the Australian line and length and get away with that and wed just roll them over.\nThe Australian team celebrates its series win back in 2004.\nIn 04 we thought about it long and hard and reflected on it and decided we needed to just put our egos away and play subcontinent-style cricket and we did that. We had a bit of success with three quicks and The King (Shane Warne) bowing, with some help from Pup (Michael) Clarke and Boof (Darren) Lehmann.\nSo whichever way the Australian team goes, I think adaptability and situation awareness is going to be absolutely crucial. Backing your skills and backing your fitness is also key on the subcontinent because its hot, its humid, its uncomfortable, theyre foreign conditions  youve got to bank on your fitness and strength taking you deep into games.\nI love what Australia did in Pakistan (last year); their goal was to win on day 15 of the (three-match) Test series and I thought the way they went about it was fantastic, and theres no reason why they cant do it India. I think theyve got the cattle, theyve got the fuel, theyve got the ammo, theyre ready to go, I reckon.\nBut Gillespie stressed it was important Australia didnt lapse into a false sense of security just because they beat Pakistan 1-0 on their home soil last year in similar conditions to what theyll confront in India.\nIts subcontinental conditions, but they are different, and Pakistan players use the conditions slightly different to India players, Gillespie said.\nSpeaking to Nathan Lyon  he talked about the difference between bowling to Pakistan batsmen and Indian batsmen. Indian batsmen dont tend to sweep, whereas Pakistan batsmen will just pull out the broom  so thats a challenge for him as a spin bowler.\nAdam Gilchrist, Justin Langer, Simon Katich and Jason Gillespie celebrate in 2004. Picture: Hamish Blair / Getty Images\nBut I think the quicks will get a little more assistance off the surface in India. Pakistan is a really tough place to bowl for a fast bowler.\nIndia is a challenge, but youve got to have a really positive attitude and believe you can have an impact and more often than not, quicks can have a real impact in India; theyve just got to believe it up here (in the mind).\nGillespie, who coaches the Adelaide Strikers, believes a couple of his players in Alex Carey and Travis Head will have a big say in Australias chances against India.\nI think hes in a wonderful sweet spot of his career, Gillespie said of Carey.\nHes playing some great cricket with the bat, hes keeping very well.\nWeve got Alex and Trav hoping they can be part of history. I think we have an opportunity to do just that and I think Kez (Carey) is going to be a central figure in that and I think Travis will play a huge role as well.\nOriginally published as",
		"snippet": "... the last successful tour of India in late 2004 when Australia won the <b>Test</b> series 2-1 and was the Aussies leading wicket-taker on that tour with 20 ...",
		"keywords": "",
		"language": "en",
		"isSafe": true,
		"datePublished": "2023-01-24T21:17:00",
		"provider": {
			"name": "skynews",
			"favIcon": "",
			"favIconBase64Encoding": ""
		},
		"image": {
			"url": "https://content.api.news/v3/images/bin/95a9f8b9d303d8d9312806ea346f003d",
			"height": 720,
			"width": 1280,
			"thumbnail": "https://rapidapi.usearch.com/api/thumbnail/get?value=307338631414829689",
			"thumbnailHeight": 135,
			"thumbnailWidth": 240,
			"base64Encoding": null,
			"name": null,
			"title": null,
			"provider": {
				"name": "skynews",
				"favIcon": "",
				"favIconBase64Encoding": ""
			},
			"imageWebSearchUrl": null,
			"webpageUrl": "https://www.skynews.com.au/breaking-news/jason-gillespie-says-careers-could-be-made-by-aussie-success-in-india/news-story/c6f01aa7c79b86d83688f82650eed784"
		}
	}
]
